{"text":"5: اس آیت نے یہ واضح حکم عطا فرما دیا کہ کوئی مسلمان عورت کسی بھی غیر مسلم کے نکاح میں نہیں رہ سکتی۔ چنانچہ اگر کسی غیر مسلم کی بیوی مسلمان ہوجائے تو اس کے شوہر کو بھی اسلام لانے کی پیشکش کی جائے گی، اگر وہ بھی عورت کی عدت کے دوران اسلام قبول کرلے تو ان کا نکاح باقی رہے گا، لیکن اگر وہ مسلمان نہ ہو، تو اس کی مسلمان بیوی اس کے نکاح سے نکل جائے گی، اور عدت کے بعد کسی مسلمان سے نکاح کرسکے گی۔\n 6: جو شادی شدہ عورتیں مسلمان ہو کر مدینہ منورہ آتیں، ان کے شوہروں سے ان کا نکاح ختم ہوجاتا تھا، لیکن چونکہ مکہ مکرمہ کے کافروں سے اس وقت صلح کا معاہدہ تھا، اس لیے ان کو یہ سہولت دی گئی تھی کہ انہوں نے اپنی بیویوں کو جو مہر دیا تھا، وہ ان کو اس طرح واپس کرنے کا حکم دیا گیا کہ جو مسلمان ان عورتوں سے نکاح کرے، وہ اس کا مہر اس کے پہلے کافر شوہر کو ادا کردے۔\n 7: اس آیت کے نزول سے پہلے بہت سے صحابہ ایسے تھے کہ وہ خود تو مسلمان ہوگئے تھے، لیکن ان کی بیویاں مسلمان نہیں ہوئی تھیں، اور وہ ابھی تک ان کے نکاح میں چلی آرہی تھیں۔ اس آیت نے حکم دے دیا کہ اب کوئی بت پرست عورت کسی مسلمان کے نکاح میں باقی نہیں رہ سکتی اور جیسا کہ مشرکین کے بارے میں یہ حکم دیا گیا تھا کہ انہوں نے اپنی مسلمان ہونے والی بیویوں کو جو مہر ادا کیا تھا، وہ انہیں واپس کیا جائے، اسی طرح مسلمانوں کی جن کافر بیویوں کا نکاح مسلمان ہونے والی بیویوں کو جو مہر ان کے مسلمان شوہروں نے دیا تھا، اسکے بارے میں بھی انصاف کا تقاضا یہ تھا کہ ان عورتوں کے نئے شوہر وہ مہر پرانے مسلمان شوہروں کو واپس کریں، اس لیے مسلمان شوہروں کو یہ حکم دیا گیا کہ وہ اپنی ان مطلقہ بیویوں کے نئے شوہروں سے مہر کا مطالبہ کرسکتے ہیں۔ چنانچہ اس آیت کے بعد ایسے صحابہ نے اپنی مشرک بیویوں کو طلاق دے کر الگ کردیا، لیکن اس کے بعد ان سے جن مشرک مردوں نے نکاح کیا، انہوں نے مسلمانوں کو ان کا مہر واپس نہیں کیا۔ اس لیے اگلے فقرے میں یہ حکم دیا گیا ہے کہ جن مسلمانوں کی بیویاں کافر ہونے کی وجہ سے کافروں کے نکاح میں چلی گئیں، اور ان کے نئے شوہروں نے مسلمانوں کو ان کا دیا ہوا مہر نہیں لوٹایا، وہ اپنا حق وصول کرنے کے لیے یہ کرسکتے ہیں کہ اگر کوئی عورت مسلمان ہو کر آئی ہو، اور اس سے کسی مسلمان نے نکاح کیا ہو، تو اس پر جو یہ واجب کیا گیا تھا کہ وہ ان کے پرانے شوہروں کو ان کا دیا ہوا مہر لوٹائے، اب وہ اس کافر شوہر کو دینے کے بجائے اس مسلمان کو دیدے جس کی بیوی کافر ہونے کی بنا پر کسی کافر کے نکاح میں آگئی ہو، اور اس کے نئے شوہر نے اس مسلمان کو مذکورہ قاعدے کے مطابق مہر واپس نہ کیا ہو۔ اس طرح مسلمان کو اس کا حق مل جائے گا، اور کافر لوگ آپس میں ایک دوسرے سے تصفیہ کرلیں گے۔"}