{"tafsir":"1: جب میاں بیوی میں طلاق کے ذریعے علیحدگی ہوجائے تو عورت کو دوسرا نکاح کرنے کے لئے کچھ مدت انتظار کرنا ضروری ہوتا ہے، اس مدت کو عدت کہا جاتا ہے، سورة بقرہ (2: 228) میں گزرچکا ہے کہ جن عورتوں کو طلاق ہوگئی ہو، ان کی عدت یہ ہے کہ طلاق کے بعد ان کو تین ماہواریاں آجائیں، اب اس آیت میں طلاق دینے والوں کو یہ حکم دیا گیا ہے کہ اگر انہیں طلاق دینی ہو تو وہ ایسے وقت طلاق دیں کہ عدت شروع ہونے والی ہو، حضور اکرم ﷺ نے اس کی تشریح یہ فرمائی ہے کہ ایسے وقت طلاق نہ دی جائے جب بیوی کو ماہواری آرہی ہو، بلکہ ایسے طہر یعنی پاکی کی حالت میں طلاق دی جائے جس میں بیوی سے جماع بھی نہ کیا ہو، اس حکم میں دو مصلحتیں خاص طور پر قابل ذکر ہیں، ایک یہ کہ اسلام یہ چاہتا ہے کہ اول تو جب میاں بیوی کا رشتہ ایک مرتبہ قائم ہوجائے تو وہ قائم رہے، اور اگر طلاق کے ذریعے اس کے ٹوٹنے کی نوبت آئے تو وہ بھی اچھی طرح سوچ سمجھ کر شریفانہ طریقہ پر ہو جس میں فریقین میں سے کوئی دوسرے کے لئے ناواجبی تکلیف کا سبب نہ بنے، اگر ماہواری کی حالت میں طلاق دی جائے تو ہوسکتا ہے کہ وہ وقتی نفرت کی وجہ سے دی جارہی ہو، یا اگر ایسی پاکی کی حا لت میں دی جائے جس میں دونوں جماع کرچکے ہوں تب بھی ہوسکتا ہے کہ بیوی کی طرف شوہر کی رغبت کم ہوگئی ہو، اس کے برخلاف اگر ایسے طہر میں طلاق دی جائے جس میں ایک مرتبہ بھی جماع نہ ہوا ہو تو عام طور پر یہ وقت ایسا ہوتا ہے جب بیوی کی طرف شوہر کی رغبت اپنے شباب پر ہوتی ہے، اس کے باوجود اگر وہ طلاق دے رہا ہے تو اس بات کی علامت ہے کہ طلاق کسی وقتی بےرغبتی کا نتیجہ نہیں ہے، دوسری مصلحت یہ ہے کہ اگر ماہواری کے دوران طلاق دی جائے تو عورت کے لئے عدت کا زمانہ بلا وجہ لمبا ہوجاتا ہے، کیونکہ جس ماہواری کے دوران طلاق دی گئی ہے، وہ عدت میں شمار نہیں ہوگی اس لئے عدت اس وقت شروع ہوگی جب عورت اس ماہواری سے پاک ہوجائے، پھر دوبارہ ماہواری آنے کا انتظار کرے، اس سے عورت کو تکلیف ہوسکتی ہے، لہذا حکم یہ دیا گیا ہے کہ طلاق ایسے طہر میں دی جائے جس میں جماع نہ ہوا ہو۔\n یہ اس آیت کی وہ تفسیر ہے جو اکثر مفسرین نے اختیار کی ہے اور اس کی تائید کچھ صحیح احادیث سے بھی ہوتی ہے، بعض مفسرین نے اس کی ایک اور تفسیر کی ہے وہ آیت کا ترجمہ یہ کرتے ہیں کہ انہیں عدت کے لئے طلاق دو ، اور مطلب یہ بتاتے ہیں کہ اللہ تعالیٰ اس بات کی ترغیب دے رہے ہیں کہ انسان جب بیوی کو طلاق دے تو رجعی طلاق یعنی ایسی طلاق دے جس سے عدت کے دوران رجوع کرنا ممکن ہو، گویا عدت تک کے لئے طلاق دی جائے، اس دوران سوچنے سمجھنے کا موقع ہوگا، اور اگر حالات معمول پر آجائیں تو طلاق سے رجوع کرلیا جائے جیسا کہ اگلی آیت میں بیان فرمایا گیا ہے۔\n 2: عدت کے دوران شوہر کے ذمے واجب ہے کہ جس بیوی کو طلاق دی ہے اس کو اپنے گھر میں رہائش فراہم کرے، اور عورت کے ذمے بھی یہ واجب ہے کہ وہ شوہر ہی کے گھر میں عدت گزارے، اور کہیں نہ جائے، البتہ اللہ تعالیٰ نے وہ صورت اس سے مستثنی فرمادی ہے جب عورت کسی کھلی بےحیائی کا ارتکاب کرے، اس کا ایک مطلب تو یہ ہے کہ کسی بدکاری کا ارتکاب کر بیٹھے، اور دوسرا مطلب یہ بھی ہے کہ وہ لڑائی جھگڑے میں بدزبانی کرنے لگے، اس صورت میں بھی اس کا شوہر کے گھر میں رہنا ضروری نہیں ہے۔\n 3: یہ اسی طرف اشارہ ہے کہ بعض اوقات باہمی جھگڑے کی وجہ سے لوگ طلاق دے ڈالتے ہیں، لیکن بعد میں اللہ تعالیٰ دونوں کے درمیان صلح صفائی کرادیتے ہیں، ایسی صورت میں نکاح کا رشتہ دوبارہ قائم ہوسکتا ہے، لیکن یہ اسی وقت ممکن ہوگا جب طلاق رجعی دی گئی ہو، اس لئے اس آیت میں ترغیب یہی دی گئی ہے کہ طلاق دینی بھی ہو تو رجعی طلاق دینی چاہیے، کیونکہ طلاق بائن کے بعد شوہر کے ہاتھ سے رجوع کا اختیار نکل جاتا ہے اور طلاق مغلظہ (تین طلاقوں) کے بعد میاں بیوی دونوں کے ہاتھ سے دوسرا نکاح کرنے کا اختیار بھی ختم ہوجاتا ہے۔","translation":"اے نبی ! جب تم لوگ عورتوں کو طلاق دینے لگو تو انہیں ان کی عدت کے وقت طلاق دو ، (1) اور عدت کو اچھی طرح شمار کرو اور اللہ سے ڈرو جو تمہارا پروردگار ہے، ان عورتوں کو ان کے گھروں سے نہ نکالو، اور نہ وہ خود نکلیں الا یہ کہ وہ کسی کھلی بےحیائی کا ارتکاب کریں، (2) اور یہ اللہ کی (مقرر کی ہوئی) حدود ہیں اور جو کوئی اللہ کی (مقرر کی ہوئی) حدود سے آگے نکلے، اس نے خود اپنی جان پر ظلم کیا، تم نہیں جانتے، شاید اللہ اس کے بعد کوئی نئی بات پیدا کردے۔ (3)"}