{"tafsir":"45: جنگ احد کا واقعہ مختصراً یہ ہے کہ شروع میں مسلمان کافر حملہ آوروں پر غالب آگئے اور کفار کا لشکر پسپا ہونے پر مجبور ہوگیا، آنحضرت ﷺ نے جنگ شروع ہونے سے پہلے پچاس تیر انداز صحابہ کا ایک دستہ میدان جنگ کے ایک عقبی ٹیلے پر متعین فرمایا تھا، تاکہ دشمن پیچھے سے حملہ نہ کرسکے، جب دشمن پسپا ہوا اور میدان جنگ خالی ہوگیا تو صحابہ نے اس کا چھوڑا ہوا ساز و سامان مال غنیمت کے طور پر اکھٹا کرنا شروع کردیا، تیر اندازوں کے اس دستے نے جب یہ دیکھا کہ دشمن بھاگ چکا ہے تو انہوں نے سمجھا کہ اب ہماری ذمہ داری پوری ہوچکی ہے اور ہمیں مال غنیمت جمع کرنے میں حصہ لینا چاہیے، ان کے امیر حضرت عبداللہ بن جبیر ؓ اور ان کے چند ساتھیوں نے ٹیلہ چھوڑنے کی مخالفت کی، مگر ان میں سے اکثر نے وہاں ٹھہرنے کو بےمقصد سمجھ کر ٹیلہ چھوڑدیا، دشمن نے جب دور سے دیکھا کہ ٹیلہ خالی ہوگیا ہے اور مسلمان مال غنیمت جمع کرنے میں مشغول ہوگئے ہیں تو انہوں نے موقع پاکر ٹیلے پر حملہ کردیا، حضرت عبداللہ بن جبیر ؓ اور ان کے چند ساتھیوں نے اپنی بساط کے مطابق ڈٹ کر مقابلہ کیا، مگر سب شہید ہوگئے اور دشمن اس ٹیلے سے اتر کر ان بیخبر مسلمانوں پر حملہ آور ہوگیا جو مال غنیمت جمع کرنے میں مصروف تھے، یہ حملہ اس قدر غیر متوقع اور ناگہانی تھا کہ مسلمانوں کے پاؤں اکھڑنے لگے، اسی دوران کسی نے یہ افواہ اڑادی کہ آنحضرت ﷺ شہید ہوگئے ہیں، اس افواہ سے بہت سے مسلمانوں کے حوصلے جواب دے گئے، ان میں سے بعض میدان چھوڑ گئے، بعض جنگ سے کنارہ کش ہو کر ایک طرف کھڑے رہ گئے، البتہ آنحضرت ﷺ کے جاں نثار صحابہ کی ایک جماعت آپ کے ارد گرد مقابلہ کرتی رہی، کفار کا نرغہ اتنا سخت تھا کہ اس کشمکش میں آنحضرت ﷺ کا مبارک دانت شہید ہوگیا اور چہرہ مبارک لہو لہان ہوگیا، بعد میں جب صحابہ کو پتہ چلا کہ آپ کی شہادت کی خبر غلط تھی اور ان کے حواس بجا ہوئے تو ان میں سے بیشتر میدان میں لوٹ آئے، اور پھر کفار کو بھاگنا پڑا ؛ لیکن اس درمیانی عرصے میں ستر صحابہ کرام ؓ شہید ہوچکے تھے، ظاہر ہے کہ اس واقعے سے تمام مسلمانوں کو شدید صدمہ ہوا، قرآن کریم ان آیتوں میں انہیں تسلی بھی دے رہا ہے کہ یہ زمانے کے نشیب و فراز ہیں جن سے مایوں اور دل شکستہ نہ ہونا چاہیے، اور اس طرف بھی متوجہ کررہا ہے کہ یہ شکست کچھ غلطیوں کا نتیجہ تھی جس سے سبق لینے کی ضرورت ہے۔","translation":"(مسلمانو) تم نہ تو کمزور پڑو، اور نہ غمگین رہو، اگر تم واقعی مومن رہو تو تم ہی سربلند ہوگے۔ (45)"}