{"tafsir":"3: اس آیت کو سمجھنے کے لئے پہلے اس حقیقت کا احساس ضروری ہے کہ اس کائنات کی بیشمار چیزیں ایسی ہیں جو انسان کی سمجھ سے بالاتر ہیں، اسی طرح اللہ تعالیٰ کا وجود اور اس کی وحدانیت تو ایک ایسی حقیقت ہے جو ہر انسان اپنی عقل سے معلوم کرسکتا ہے، لیکن اس کی ذات اور صفات کی تفصیلات انسان کی محدود عقل سے ماورا ہیں، قرآن کریم نے جہاں اللہ تعالیٰ کی ان صفات کا ذکر فرمایا ہے ان سے اللہ تعالیٰ کی قدرت کاملہ اور حکمت بالغہ ظاہر کی گئی ہے، لیکن کوئی شخص ان صفات کی حقیقت اور کنہ کی فلسفیانہ کھوج میں پڑجائے توحیرانی یا گمراہی کے سوا اسے کچھ ہاتھ نہیں آئے گا، کیونکہ وہ اپنی محدود عقل سے اللہ تعالیٰ کی ان لامحدود صفات کا احاطہ کرنے کی کوشش کررہا ہے جو اس کے ادراک سے باہر ہیں، مثلاً قرآن کریم نے کئی مقامات پر فرمایا ہے کہ اللہ تعالیٰ کا ایک عرش ہے اور یہ کہ وہ اس عرش پر مستوی ہوا، اب یہ بات کہ وہ عرش کیسا ہے اس پر اللہ تعالیٰ کے مستوی ہونے کا کیا مطلب ہے ؟ یہ وہ سوالات ہیں جن کا جواب انسان کی عقل اور سمجھ سے بالاتر ہے اور انسان کی زندگی کا کوئی عملی مسئلہ اس پر موقوف بھی نہیں، ایسی آیات جن میں اس قسم کے حقائق بیان کئے گئے ہیں متشابہات کہلاتی ہیں، اسی طرح مختلف سورتوں کے شروع میں جو حروف الگ الگ نازل کئے گئے ہیں (مثلاً اسی صورت کے شروع میں الف لام میم) اور جنہیں حروف مقطعات کہا جاتا ہے وہ بھی متشابہات میں داخل ہیں، ان کے بارے میں قرآن کریم نے اس آیت میں یہ ہدایت دی ہے کہ ان کی کھو دکرید میں پڑنے کے بجائے ان پر اجمالی طور سے ایمان رکھ کر ان کا صحیح مطلب اللہ تعالیٰ کے حوالے کرنا چاہیے اس کے برعکس قرآن کریم کی دوسری آیتیں ایسی ہیں جن کا مطلب واضح ہے اور درحقیقت وہی آیات ہیں جو انسان کے لئے عملی ہدایات فراہم کرتی ہیں انہی آیات کو محکم آیتیں کہا گیا ہے، ایک مومن کو انہی پر خصوصی توجہ دینی چاہیے۔\n متشابہات کے بارے میں صحیح طرز عمل بتلانا یوں بھی ضروری تھا، لیکن اس سورت میں اس وضاحت کی خاص وجہ یہ بھی تھی کہ نجران کے عیسائیوں کا جو وفد آنحضرت ﷺ کی خدمت میں آیا تھا اور جس کا ذکر اوپر کے حاشیہ میں گزرا ہے، اس نے حضرت عیسیٰ ؑ کے خدا یا خدا کا بیٹا ہونے پر ایک دلیل یہ بھی پیش کی تھی کہ خود قرآن نے انہیں کلمۃ اللہ (اللہ کا کلمہ) اور روح من اللہ فرمایا ہے جس سے واضح ہوتا ہے کہ وہ اللہ کی صفت کلام اور اللہ کی روح تھے اس آیت نے اس کا یہ جواب دیا ہے کہ قرآن کریم ہی نے جگہ جگہ صاف لفظوں میں بتایا ہے کہ اللہ تعالیٰ کی کوئی اولاد نہیں ہوسکتی اور حضرت عیسیٰ ؑ کو خدا کا بیٹا یا خدا قرار دینا شرک اور کفر ہے، ان واضح آیتوں کو چھوڑ کر کلمۃ اللہ کے لفظ کو پکڑ بیٹھنا اور اس کی بنیاد پر ایسی تاویلیں کرنا جو قرآن کریم کی محکم آیات کے بالکل برخلاف ہیں، دل کے ٹیڑھ کی علامت ہے، حقیقت میں حضرت عیسیٰ ؑ کو کلمۃ اللہ کہنے کا مطلب یہ ہے کہ وہ باپ کے واسطے کے بغیر اللہ تعالیٰ کے کلمہ کن سے پیدا ہوئے تھے، جیسا کہ قرآن کریم نے اسی سورت کی آیت : 59 میں بیان فرمایا ہے، اور انہیں روح من اللہ اس لئے کہا گیا ہے کہ ان کی روح براہ راست اللہ تعالیٰ نے پیدا فرمائی تھی، اب یہ بات انسان کی سمجھ سے بالاتر ہے کہ کن سے پیدا کرنے کی کیفیت کیا تھی اور براہ راست ان کی روح کس طرح پیدا کی گئی ؟ یہ امور متشابہات میں سے ہیں، اس لئے ان کی کھود کرید بھی منع ہے (کیونکہ یہ باتیں انسان کی سمجھ میں آہی نہیں سکتیں) اور ان کی من مانی تاویل کرکے ان سے خدا کے بیٹے کا تصور برآمد کرنا بھی کج فہمی ہے۔","translation":"(اے رسول) وہی اللہ ہے جس نے تم پر کتاب نازل کی ہے جس کی کچھ آیتیں تو محکم ہیں جن پر کتاب کی اصل بنیاد ہے اور کچھ دوسری آیتیں متشابہ ہیں۔ (3)\n اب جن لوگوں کے دلوں میں ٹیڑھ ہے وہ ان متشابہ آیتوں کے پیچھے پڑے رہتے ہیں تاکہ فتنہ پیدا کریں اور ان آیتوں کی تاویلات تلاش کریں، حالانکہ ان آیتوں کا ٹھیک ٹھیک مطلب اللہ کے سوا کوئی نہیں جانتا، اور جن لوگوں کا علم پختہ ہے وہ یہ کہتے ہیں کہ : ہم اس (مطلب) پر ایمان لاتے ہیں (جو اللہ کو معلوم ہے) سب کچھ ہمارے پروردگار ہی کی طرف سے ہے، اور نصیحت وہی لوگ حاصل کرتے ہیں جو عقل والے ہیں۔"}