{"tafsir":"تشریح : بعض یہودیوں نے مسلمانوں پر یہ اعتراض کیا تھا کہ آپ یہ دعوی کرتے ہیں کہ آپ حضرت ابراہیم ؑ کے پیروکار ہیں حالانکہ آپ اونٹ کا گوشت کھاتے ہیں جو تورات کی رو سے حرام ہے، ان آیات میں اس اعتراض کا جواب یہ دیا گیا ہے کہ اونٹ کا گوشت حضرت ابراہیم ؑ کے دین میں حرام نہیں تھا ؛ بلکہ تورات نازل ہونے سے پہلے بنی اسرائیل کے لئے بھی وہ سب چیزیں حلال تھیں جو آج مسلمانوں کے لئے حلال ہیں ؛ البتہ ہوا یہ تھا کہ حضرت یعقوب ؑ نے اونٹ کا گوشت اپنے اوپر حرام کرلیا تھا جس کی وجہ حضرت ابن عباس ؓ نے یہ بتائی ہے کہ ان کو عرق النساء کی بیماری تھی اور انہوں نے یہ نذر مانی تھی کہ اگر مجھے اس بیماری سے شفا ہوگئی تو میں اپنے کھانے کی سب سے پسندیدہ چیز چھوڑدوں گا، انہیں اونٹ کا گوشت سب سے زیادہ پسند تھا، اس لئے شفا حاصل ہونے پر انہوں نے اسے چھوڑدیا (روح المعانی بحوالہ مستدرک حاکم صحیح) اب قرآن کریم نے یہاں صریح الفاظ میں یہ بات نہیں بتائی کہ آیا اس کے بعد یہ گوشت بنی اسرائیل پر بھی حرام کردیا گیا تھا یا نہیں لیکن سورة نساء (4: 160) میں اللہ تعالیٰ نے فرمایا ہے کہ بنی اسرائیل کی نافرمانیوں کی وجہ سے ان پر بہت سی اچھی چیزیں بھی حرام کردی گئی تھیں اور اسی سورت کی 50 میں گزرچکا ہے کہ حضرت عیسیٰ ؑ نے بنی اسرائیل سے کہا تھا کہ اور جو کتاب مجھ سے پہلے آچکی ہے یعنی تورات میں اس کی تصدیق کرنے والا ہوں اور (اس لئے بھیجا گیا ہوں) تاکہ کچھ چیزیں جو تم پر حرام کی گئی تھیں اب تمہارے لئے حلال کردوں، نیز یہاں تورات نازل ہونے سے پہلے کے الفاظ بھی یہ بتا رہے ہیں کہ اونٹ کا گوشت شاید تورات نازل ہونے کے بعد ان پر حرام کردیا گیا تھا، اب جو چیلنج ان کو دیا گیا ہے کہ اگر تم سچے ہو تو تورات لے کر آؤ اور اس کی تلاوت کرو، اس کا مطلب یہ ہے کہ تورات میں یہ کہیں مذکور نہیں ہے کہ اونٹ کا گوشت حضرت ابراہیم ؑ کے وقت سے حرام چلا آتا ہے، اس کے برعکس یہ حکم صرف بنی اسرائیل کو دیا گیا تھا ؛ چنانچہ اب بھی بائبل کی کتاب احبار میں جو یہودیوں اور عیسائیوں کی نظر میں تورات کا ایک حصہ ہے اونٹ کی حرمت بنی اسرائیل ہی کے لئے بیان ہوئی ہے : تم بنی اسرائیل سے کہو کہ تم ان جانوروں کا گوشت نہ کھانا یعنی اونٹ کو سو وہ تمہارے لئے ناپاک ہے (احبار 11: 1۔ 4) خلاصہ یہ کہ اونٹ کا گوشت اصلاً حلال ہے مگر حضرت یعقوب ؑ کے لئے نذر کی وجہ سے اور بنی اسرائیل کے لئے ان کی نافرمانیوں کی بنا پر حرام کیا گیا تھا، اب امت محمدیہ (علی صاحبہا السلام) میں حضرت ابراہیم ؑ کے زمانے کا اصل حکم لوٹ آیا ہے۔","translation":"تورات کے نازل ہونے سے پہلے کھانے کی تمام چیزیں (جو مسلمانوں کے لیے حلال ہیں) بنی اسرائیل کے لیے (بھی) حلال تھیں، سوائے اس چیز کے جو اسرائیل (یعنی یعقوب ؑ) نے اپنے اوپر حرام کرلی تھی۔ (اے پیغمبر ! یہودیوں سے) کہہ دو کہ : اگر تم سچے ہو تو تورات لے کر آؤ اور اس کی تلاوت کرو۔ (33)"}