{"tafsir":"66: یہ آیتیں اگرچہ عام ہدایتوں پر مشتمل ہیں مگر ایک خاص واقعے میں نازل ہوئی ہیں، خاندان بنو ابیرق کے ایک شخص بشر نے جو ظاہری طور پر مسلمان تھا، ایک صحابی حضرت رفاعہ ؓ کے گھر میں نقب لگا کر کچھ غلہ اور کچھ ہتھیار چرالئے، اور لے جاتے وقت ہوشیاری یہ کی کہ غلے کی بوری کا منہ اس طرح کھولا کہ تھوڑا تھوڑا غلہ راستے میں گرتا جائے یہاں تک کہ ایک یہودی کے گھر کے دروازے پر پہنچ کر بوری کا منہ بند کردیا اور بعد میں چوری کئے ہوئے ہتھیار اسی یہودی کے پاس رکھوادئے، جب چوری کی تفتیش شروع ہوئی تو ایک طرف غلے کے نشانات یہودی کے گھر تک پائے گئے اور دوسری طرف ہتھیار اسی کے پاس سے برآمد ہوئے، اس لئے شروع میں آنحضرت ﷺ کا خیال یہ ہونے لگا کہ یہ چوری اسی یہودی نے کی ہے، یہودی سے پوچھا گیا تو اس نے کہا کہ ہتھیار تو میرے پاس بشر نامی شخص نے رکھوائے تھے، مگر چونکہ وہ اس پر کوئی گواہ پیش نہ کرسکا تھا، اس لئے آپ کا رجحان اس طرف ہونے لگا کہ وہ جان بچانے کے لئے بشر کا نام لے رہا ہے، دوسری طرف بشر کے خاندان بنو ابیرق کے لوگ بھی بشر کی وکالت کرتے ہوئے اس بات پر زور لگا رہے تھے کے سزا بشر کے بجائے یہودی کو دی جائے، ابھی یہ معاملہ چل ہی رہا تھا کہ یہ آیات کریمہ نازل ہوگئیں اور ان کے ذریعے بشر کی دھوکہ بازی کا پردہ چاک کردیا گیا اور یہودی کو بےگناہ قرار دے کر بری کردیا گیا، بشر کو جب راز فاش ہونے کا پتہ لگا تو وہ فرار ہو کر کفار مکہ سے جاملا اور وہاں کفر کی حالت میں بری طرح اس کی موت واقع ہوئی، ان آیات کے ذریعے ایک طرف تو معاملے کی اصل حقیقت آنحضرت ﷺ پر کھول دی گئی، اس کے علاوہ مقدمات کے فیصلے کرنے کے لئے اہم اصول بتادئے گئے ہیں، پہلا اصول یہ کہ تمام فیصلے کتاب اللہ کے احکام کے تابع ہونے چاہئیں، دوسرا اصول یہ کہ اللہ تعالیٰ اپنے پیغمبر ﷺ پر بہت سے ایسے امور کھولتے رہتے ہیں جو صراحۃً قرآن میں مذکور نہیں ہیں، فیصلے ان کی روشنی میں ہونے چاہئیں، آیت کے الفاظ اس طریقے کے مطابق فیصلہ کرو جو اللہ نے تمہیں سمجھادیا ہے، اسی طرف اشارہ کررہے ہیں اور ان سے قرآن کریم کے علاوہ آنحضرت ﷺ کی سنت کی حجیت کا بھی ثبوت ملتا ہے، تیسرا اصول یہ بیان فرمایا گیا ہے کہ جس کسی شخص کے بارے میں یہ معلوم ہو کہ وہ کسی مقدمے میں غلطی پر ہے، اس کی وکالت کرنا جائز نہیں ہے، بنو ابیرق جو بشر کی وکالت کررہی تھی ان کی تنبیہ کی گئی ہے کہ اول تو یہ وکالت جائز نہیں دوسرے اس کا فائدہ ملزم کو زیادہ سے زیادہ دنیا میں پہنچ سکتا ہے آخرت میں تمہاری وکالت اس کو اللہ کے عذاب سے نہیں بچا سکتی۔","translation":"بیشک ہم نے حق پر مشتمل کتاب تم پر اس لیے اتاری ہے تاکہ تم لوگوں کے درمیان اس طریقے کے مطابق فیصلہ کرو جو اللہ نے تم کو سمجھا دیا ہے، اور تم خیانت کرنے والوں کے طرف دار نہ بنو۔ (66)"}