{"tafsir":"48: ان آیتوں میں دو حقیقتیں بیان فرمائی گئی ہیں، ایک یہ کہ اس کائنات میں جو کچھ ہوتا ہے اللہ تعالیٰ کی مشیت اور اس کے حکم سے ہوتا ہے، کسی کو کوئی فائدہ پہنچے تو وہ بھی اللہ کے حکم سے پہنچتا ہے، اور نقصان پہنچے تو وہ بھی اسی کے حکم سے ہوتا ہے، دوسری حقیقت یہ بیان کی گئی ہے کہ کسی کو فائدہ یا نقصان پہنچانے کا حکم اللہ تعالیٰ کب اور کس بناء پر دیتے ہیں، اس کے بارے میں آیت : 79 نے یہ بتایا ہے کہ جہاں تک کسی کو فائدہ پہنچنے کا تعلق ہے اس کا حقیقی سبب صرف اللہ تعالیٰ کا فضل ہوتا ہے، کیونکہ کسی بھی مخلوق کا اللہ تعالیٰ پر کوئی اجارہ نہیں آتا کہ وہ اسے ضرور فائدہ پہنچائے، اور اگر اس فائدہ کا کوئی ظاہری سبب اس شخص کا کوئی عمل نظر آتا بھی ہو تو اس عمل کی توفیق اللہ تعالیٰ ہی کی طرف سے ہوتی ہے، اس لئے وہ اللہ تعالیٰ کا فضل ہی فضل ہے، اور اس شخص کا کوئی ذاتی استحقاق نہیں ہے، دوسری طرف اگر انسان کو کوئی نقصان پہنچے تو اگرچہ وہ بھی اللہ تعالیٰ کے حکم ہی سے ہوتا ہے، لیکن اللہ تعالیٰ یہ حکم اسی وقت فرماتے ہیں جب اس شخص نے اپنے اختیاری عمل سے کوئی غلطی کی ہو، اب منافقین کا معاملہ یہ تھا کہ جب انہیں کوئی فائدہ پہنچتا تو اس کو اللہ تعالیٰ کی طرف منسوب کرتے ؛ لیکن کوئی نقصان ہوجاتا تو اسے آنحضرت ﷺ کے ذمے لگا دیتے تھے، اس آیت کریمہ میں اللہ تعالیٰ فرماتے ہیں کہ یہ لوگ جو نقصان کی ذمہ داری آنحضرت ﷺ پر عائد کررہے ہیں اگر اس سے مراد یہ ہے کہ یہ نقصان آنحضرت کے حکم سے ہوا ہے، تو یہ بات بالکل غلط ہے ؛ کیونکہ اس کائنات میں تمام کام اللہ ہی کے حکم سے ہوتے ہیں کسی اور حکم سے نہیں اور اگر ان کا مطلب یہ ہے کہ (معاذاللہ) آنحضرت ﷺ کی کوئی غلطی اس کا سبب بنی ہے تو یہ بات بھی غلط ہے، ہر انسان کو خود اس کے اپنے کسی عمل کی وجہ سے نقصان پہنچتا ہے، آنحضرت ﷺ کو تو رسول بناکر بھیجا گیا ہے لہذا نہ تو کائنات میں واقع ہونے والے کسی تکوینی واقعے کی ذمہ داری آپ پر عائد ہوتی ہے اور نہ آپ فرائض رسالت میں کسی کوتاہی کے مرتکب ہوسکتے ہیں، جس کا خمیازہ آپ کی امت کو بھگتنا پڑے۔","translation":"تمہیں جو کوئی اچھائی پہنچتی ہے تو وہ محض اللہ کی طرف سے ہوتی ہے اور جو کوئی برائی پہنچتی ہے، تو وہ تمہارے اپنے سبب سے ہوتی ہے، اور (اے پیغمبر) ہم نے تمہیں لوگوں کے پاس رسول بنا کر بھیجا ہے، اور اللہ (اس بات کی) گواہی دینے کے لیے کافی ہے۔ (48)"}