{"tafsir":"66: ان آیات میں اللہ تعالیٰ نے یہودیوں کی ایک اور بدعملی کی طرف اشارہ فرمایا ہے اور وہ یہ کہ جادو ٹونے کے پیچھے لگنا ناجائز تھا، بالخصوص اگر جادو میں شرکیہ کلمات منتر کے طور پر پڑھے جائیں تو ایسا جادو کفر کے مرادف ہے، حضرت سلیمان ؑ کے زمانے میں کچھ شیاطین نے، جن میں انسان اور جنات دونوں شامل ہوسکتے ہیں، بعض یہودیوں کو یہ پٹی پڑھائی کہ حضرت سلیمان ؑ کی سلطنت کا سارا راز جادو میں مضمر ہے اور اگر جادو سیکھ لوگے تو تمہیں بھی حیرت انگیز اقتدار نصیب ہوگا، چنانچہ یہ لوگ جادو سیکھنے اور اس پر عمل کرنے میں لگ گئے ؛ حالانکہ جادو پر عمل کرنا نہ صرف ناجائز تھا ؛ بلکہ اس کی بعض قسمیں کفر تک پہنچتی تھیں، دوسرا غضب یہودیوں نے یہ کیا کہ خود حضرت سلیمان ؑ کو جادو گر قرار دے کر ان کے بارے میں یہ مشہور کردیا کہ انہوں نے آخری عمر میں بتوں کو پوجنا شروع کردیا تھا، ان کے بارے میں یہ جھوٹی داستانیں انہوں نے اپنی مقدس کتابوں میں شامل کردیں جو آج تک بائبل میں درج چلی آتی ہیں ؛ چنانچہ بائبل کی کتاب سلاطین اول 11۔ 1 تا 21 میں ان کے معاذ اللہ مرتد ہونے کا بیان آج بھی موجود ہے، قرآن کریم نے اس آیت میں حضرت سلیمان ؑ پر اس ناپاک بہتان کی تردید فرمائی ہے، اس سے یہ بات بھی واضح ہوجاتی ہے کہ جن لوگوں نے قرآن کریم پر یہ الزام لگایا ہے کہ وہ یہودیوں اور عیسائیوں کی کتابوں سے ماخوذ ہے وہ کتنا غلط الزام ہے، یہاں قرآن کریم صریح الفاظ میں یہود و نصاری کی کتابوں کی تردید کررہا ہے، حقیقت تو یہ ہے کہ آنحضرت ﷺ کے پاس ایسا کوئی ذریعہ نہیں تھا جس سے وہ یہ خود معلوم کرسکتے کہ یہودیوں کی کتابوں میں کیا لکھا ہے، اس بات کا علم آپ ﷺ کو وحی کے سوا کسی اور راستہ سے نہیں ہوسکتا تھا، لہذا یہ آیت بذات خود آپ کے صاحب وحی رسول ہونے کی واضح دلیل ہے کہ آپ نے نہ صرف یہ بتلایا کہ یہودیوں کی کتابوں میں حضرت سلیمان ؑ پر کیا بہتان لگایا گیا ہے ؛ بلکہ اس قدر جم کر اس کی تردید فرمائی ہے۔\n 67: بابل عراق کا مشہورشہر تھا، ایک زمانے میں وہاں جادو کا بڑا چرچا ہوگیا تھا، اور یہودی بھی اس ناجائز کام میں بری طرح ملوث ہوگئے تھے، انبیاء کرام اور دوسرے نیک لوگ انہیں جادو سے منع کرتے تھے تو وہ بات نہ مانتے تھے، اس سے بھی خطرناک بات یہ تھی کہ لوگوں نے جادوگروں کے شعبدوں کو معجزے سمجھ کر انہیں اپنا دینی مقتدا بنالیا تھا، اس موقع پر اللہ تعالیٰ نے اپنے دو فرشتے جن کا نام ہاروت وماروت تھا دنیا میں انسانی شکل میں بھیجے تاکہ وہ لوگوں کو جادو کی حقیقت سے آگاہ کریں اور یہ بتائیں کہ خدائی معجزات سے ان کا کوئی تعلق نہیں ہے، معجزہ براہ راست اللہ تعالیٰ کا فعل ہے جس میں کسی ظاہری سبب کا کوئی دخل نہیں ہوتا، اس کے برعکس جادو کے ذریعے جو کوئی شعبدہ دکھایا جاتا ہے وہ اسی عالم اسباب کا ایک حصہ ہے، یہ بات واضح کرنے کے لئے ان فرشتوں کو جادو کے محتلف طریقے بھی بتانے پڑتے تھے ؛ تاکہ یہ دکھایا جاسکے کہ کس طرح وہ سبب اور مسبب کے رشتے سے منسلک ہیں ؛ لیکن جب وہ ان طریقوں کی تشریح کرتے تو ساتھ ساتھ لوگوں کو متنبہ بھی کردیتے تھے کہ یاد رکھو ! یہ طریقے ہم اس لئے نہیں بتا رہے ہیں کہ تم ان پر عمل شروع کردو ؛ بلکہ اس لئے بتا رہے ہیں کہ تم پر جادو اور معجزے کا فرق واضح ہو اور تم جادو سے پرہیز کرو اس لحاظ سے ہمارا وجود تمہارے لئے ایک امتحان ہے کہ ہماری باتوں کو سمجھ کر تم جادو سے پرہیز کرتے ہو یا ہم سے جادو کے طریقے سیکھ کر ان پر عمل شروع کردیتے ہو، یہ کام انبیاء کے بجائے فرشتوں سے بظاہر اس بنا پر لیا گیا کہ جادو کے فارمولے بتانا خواہ وہ صحیح مقصد سے کیوں نہ ہو، انبیائے کرام کو زیب نہیں دیتا تھا، اس کے برعکس فرشتے چونکہ غیر مکلف ہوتے ہیں اس لئے ان سے بہت سے تکوینی کام لئے جاسکتے ہیں بہر حال نافرمان لوگوں نے ان فرشتوں کی طرف سے کہی ہوئی باتوں کو تو نظر انداز کردیا اور ان کے بتائے ہوئے فارمولوں کو جادو کرنے میں استعمال کیا اور وہ بھی ایسے گھناؤنے مقاصد کے لئے جو ویسے بھی حرام تھے مثلاً میاں بیوی میں پھوٹ ڈال کر نوبت طلاق تک پہنچا دینا۔\n 68: یہاں سے جملۂ معترضہ کے طور پر ایک اور اصولی غلطی پر متنبہ کیا جارہا ہے اور وہ یہ کہ جادو پر ایمان رکھنے والے یہ سمجھتے تھے کہ جادو میں بذات خود ایسی تاثیر موجود ہے جس سے مطلوبہ نتیجہ خود بخود اللہ کے حکم کے بغیر بھی برآمد ہوجاتا ہے، گویا اللہ چاہے یا نہ چاہے وہ نتیجہ پیدا ہو کر رہے گا، یہ عقیدہ بذات خود کفر تھا، اس لئے واضح کردیا گیا کہ دنیا کے دوسرے اسباب کی طرح جادو بھی محض ایک سبب ہے اور دنیا میں کوئی سبب بھی اپنا سبب یا نتیجہ اس وقت تک ظاہر نہیں کرسکتا جب تک اللہ کی مشیت اس کے ساتھ متعلق نہ ہو، کائنات کی کسی چیز میں بذات خود نہ کسی کو نفع پہنچانے کی طاقت ہے نہ نقصان پہنچانے کی، لہذا اگر کوئی ظالم کسی پر ظلم کرنا چاہتا ہے تو وہ اللہ کی قدرت اور مشیت کے بغیر کچھ نہیں کرسکتا، البتہ چونکہ یہ دنیا ایک امتحان کی جگہ ہے، اس لئے یہاں اللہ کی سنت یہ ہے کہ جب کوئی شخص اللہ کی نافرمانی کرتے ہوئے کوئی گناہ کرنا چاہتا ہے یا کسی پر ظلم کرنا چاہتا ہے تو اگر اللہ تعالیٰ تکوینی مصلحت کے مطابق سمجھتا ہے تو اپنی مشیت سے وہ کام کرا دیتا ہے، اسی کے نتیجے میں ظالم کو گناہ اور مظلوم کو ثواب ملتا ہے، ورنہ اگر اللہ اسے کام کی قدرت ہی نہ دے تو امتحان کیسے ہو ؟ لہذا جتنے گناہ کے کام دنیا میں ہوتے ہیں وہ اللہ تعالیٰ ہی کی قدرت اور مشیت سے ہوتے ہیں، اگرچہ اس کی رضا مندی ان کو حاصل نہیں ہوتی اور اللہ تعالیٰ کی مشیت اور اس کی رضا مندی میں فرق یہی ہے کہ مشیت اچھے برے ہر کام سے متعلق ہوسکتی ہے، مگر رضامندی صرف جائز اور ثواب کے کاموں سے مخصوص ہے۔\n 69: اس آیت کے شروع میں تو یہ کہا گیا ہے کہ وہ حقیقت جانتے ہیں کہ جو مشرکانہ جادو کا خریدار ہوگا اس کا آخرت میں کوئی حصہ نہیں لیکن آیت کے آخری حصہ میں فرمایا ہے کہ کاش وہ علم رکھتے جس کا مطلب یہ ہے کہ انہیں اس حقیقت کا علم نہیں ہے، بظاہر دونوں باتیں متضاد لگتی ہیں لیکن درحققیت اس انداز بیان سے یہ عظیم سبق دیا گیا ہے کہ نرا علم جس پر عمل نہ ہو حقیقت میں علم کہلانے کا مستحق نہیں بلکہ وہ کالعدم ہے ؛ لہذا اگر وہ یہ بات جانتے تو ہیں مگر ان کا عمل اس کے برخلاف ہے تو وہ علم کس کام کا ؟ کاش کہ وہ حقیقی علم رکھتے تو اس پر ان کا عمل بھی ہوتا۔","translation":"اور یہ (بنی اسرائیل) ان (منتروں) کے پیچھے لگ گئے جو سلیمان ؑ کی سلطنت کے زمانے میں شیاطین پڑھا کرتے تھے۔ اور سلیمان ؑ نے کوئی کفر نہیں کیا تھا، البہ شیاطین لوگوں کو جادو کی تعلیم دے کر کفر کا ارتکاب کرتے تھے۔ (66) نیز (یہ بنی اسرائیل) اس چیز کے پیچھے لگ گئے جو شہر بابل میں ہاروت اور ماروت نامی دو فرشتوں پر نازل کی گئی تھی۔ (67) یہ دو فرشتے کسی کو اس وقت تک کوئی تعلیم نہیں دیتے تھے جب تک اس سے یہ نہ کہہ دیں گے کہ : ہم محض آزمائش کے لیے (بھیجے گئے) ہیں، لہذا تم (جادو کے پیچھے لگ کر) کفر اختیار نہ کرنا۔ پھر بھی یہ لوگ ان سے وہ چیزیں سیکھتے تھے جس کے ذریعے مرد اور اس کی بیوی میں جدائی پیدا کردیں۔ (ویسے یہ واضح رہے کہ) وہ اس کے ذریعے کسی کو اللہ کی مشیت کے بغیر کوئی نقصان نہیں پہنچا سکتے تھے۔ (68) (مگر) وہ ایسی باتیں سیکھتے تھے جو ان کے لیے نقصان دہ تھیں اور فائدہ مند نہ تھیں۔ اور وہ یہ بھی خوب جانتے تھے کہ جو شخص ان چیزوں کا خریدار بنے گا، آخرت میں اس کا کوئی حصہ نہیں ہوگا۔ اور حقیقت یہ ہے کہ وہ چیز بہت بری تھی جس کے بدلے انہوں نے اپنی جانیں بیچ ڈالیں۔ کاش کہ ان کو (اس بات کا حقیقی) علم ہوتا۔ (69)"}