{"text":"80: یہاں سے حضرت ابراہیم ؑ کے کچھ حالات و واقعات شروع ہورہے ہیں اور پچھلی آیتوں سے ان واقعات کا دو طرح گہرا تعلق ہے، ایک بات تو یہ ہے کہ یہودی عیسائی اور عرب کے بت پرست یعنی تینوں گروہ جن کا ذکر اوپر آیا ہے حضرت ابراہیم ؑ کو اپنا پیشوا مانتے تھے، مگر ہر گروہ یہ دعوی کرتا تھا کہ وہ اسی کے مذہب کے حامی تھے، لہذا ضروری تھا کہ حضرت ابراہیم ؑ کے بارے میں صحیح صورت حال واضح کی جائے، قرآن کریم نے یہاں یہ بتلایا ہے کہ ان کا تینوں گروہوں کے باطل عقائد سے کوئی تعلق نہیں تھا، ان کی ساری زندگی توحید کی تبلیغ میں خرچ ہوئی اور انہیں اس راستے میں بڑی بڑی آزمائشوں سے گزرنا پڑا جن میں وہ پورے اترے، دوسری بات یہ ہے کہ حضرت ابراہیم ؑ کے دوبیٹے تھے، حضرت اسحاق ؑ اور حضرت اسماعیل ؑ ، حضرت اسحاق ؑ ہی کے بیٹے حضرت یعقوب ؑ تھے جن کا دوسرا نام اسرائیل تھا، نبی کریم ﷺ سے پہلے نبوت کا سلسلہ انہی کی اولاد یعنی بنی اسرائیل میں چلا آرہا تھا، جس کی بنا پر وہ یہ سمجھتے تھے کہ دنیا بھر کی پیشوائی کا حق صرف انہی کو حاصل ہے، کسی اور نسل میں کوئی ایسا نبی نہیں آسکتا جو ان کے لئے واجب الاتباع ہو، قرآن کریم نے یہاں یہ غلط فہمی دور کرتے ہوئے یہ واضح فرمایا ہے کہ دینی پیشوائی کا منصب کسی خاندان کی لازمی میراث نہیں ہے اور یہ بات خود حضرت ابراہیم ؑ سے صریح لفظوں میں کہہ دی گئی تھی انہیں جب اللہ تعالیٰ نے مختلف طریقوں سے آزمالیا اور یہ ثابت ہوگیا کہ وہ اللہ تعالیٰ کے ہر حکم پر بڑی سے بڑی قربانی کے لئے ہمیشہ تیار ہیں، تب اللہ تعالیٰ نے انہیں دنیا بھر کی پیشوائی کا منصب دینے کا اعلان فرمایا، اسی موقع پر جب انہوں نے اپنی اولاد کے بارے میں پوچھا تو صاف طور پر بتلادیا گیا کہ ان میں جو لوگ ظالم ہوں گے یعنی اللہ تعالیٰ کی نافرمانی کرکے اپنی جانوں پر ظلم کریں گے وہ اس منصب کے حق دار نہیں ہوں گے بنی اسرائیل کو صدیوں آزمانے کے بعد ثابت یہ ہوا کہ وہ اس لائق نہیں ہیں کہ قیامت تک پوری انسانیت کی دینی پیشوائی ان کو دی جائے اس لئے نبی آخرالزمان ﷺ اب حضرت ابراہیم ؑ کے دوسرے صاحبزادے یعنی حضرت اسماعیل ؑ کی اولاد میں بھیجے جارہے ہیں جن کے لئے حضرت ابراہیم ؑ نے دعا کی تھی کہ وہ اہل مکہ میں سے بھیجے جائیں۔ اب چونکہ دینی پیشوائی منتقل کی جارہی ہے اس لئے اب قبلہ بھی اس بیت اللہ کو بنایا جانے والا ہے جو حضرت ابراہیم ؑ اور ان کے صاحبزادے حضرت اسماعیل ؑ نے تعمیر کیا تھا اس مناسبت سے آگے تعمیر کعبہ کا واقعہ بھی بیان فرمایا گیا ہے یہاں سے آیت نمبر 152 تک جو سلسلہ کلام آرہا ہے اس کو اس پس منظر میں سمجھنا چاہیے۔"}