{"text":"90: یعنی جس طرح ہم نے اس آخری زمانے میں دوسری جہتوں کو چھوڑ کر کعبہ کی سمت کو قبلہ بننے کا شرف عطا فرمایا اور تمہیں اسے دل وجان سے قبول کرنے کی ہدایت دی، اسی طرح ہم نے تم کو دوسری امتوں کے مقابلے میں سب سے زیادہ معتدل اور متوازن امت بنایا ہے (تفسیر کبیر) چنانچہ اس امت کی شریعت میں ایسے مناسب احکام رکھے گئے ہیں جو قیام قیامت تک انسانیت کی صحیح رہنمائی کرسکیں، معتدل امت کی یہ خصوصیت بھی اس آیت میں بیان فرمائی گئی ہے کہ اس امت کو قیامت کے دن انبیاء کرام کے گواہ کے طور پر پیش کیا جائے گا، اس کی تفصیل صحیح بخاری کی ایک حدیث میں یہ بیان ہوئی ہے کہ جب پچھلے انبیاء کرام کی امتوں میں سے کافر لوگ صاف انکار کردیں گے کہ ہمارے پاس کوئی نبی نہیں آیا تھا تو امت محمدیہ کے لوگ انبیائے کرام کے حق میں گواہی دیں گے کہ انہوں نے رسالت کا حق ادا کرتے ہوئے اپنی اپنی امتوں کو پوری طرح اللہ تعالیٰ کا پیغام پہنچادیا تھا اور اگرچہ ہم خود اس موقع پر موجود نہیں تھے ؛ لیکن ہمارے نبی کریم ﷺ محمد مصطفیٰ ﷺ نے وحی سے باخبر ہو کر ہم کو یہ بات بتلادی تھی اور ہمیں ان کی بات پر اپنے ذاتی مشاہدے سے زیادہ اعتماد ہے۔\n دوسری طرف رسول کریم ﷺ اپنی امت کی اس بات کی تصدیق فرمائیں گے، نیز مفسرین نے امت محمدیہ کے گواہ ہونے کے یہ معنی بھی کئے ہیں کہ شہادت سے مراد حق کی دعوت و تبلیغ ہے اور یہ امت پوری انسانیت کو اسی طرح حق کا پیغام پہنچائے گی جس طرح آنحضرت ﷺ نے ان کو پہنچایا تھا۔ باتیں دونوں اپنی اپنی جگہ درست ہیں اور ان میں کوئی تعارض بھی نہیں۔\n 91: مطلب یہ ہے کہ پہلے کچھ عرصے کے لئے بیت المقدس کو قبلہ بنانے کا جو حکم ہم نے دیا تھا اس کا مقصد یہ امتحان لینا تھا کہ کون قبلے کی اصل حقیقت کو سمجھ کر اللہ کے حکم کی تعمیل کرتا ہے اور کون ہے جو کسی ایک قبلے کو بذات خود ہمیشہ کے لئے مقدس مان کر اللہ کے بجائے اسی کی عبادت شروع کردیتا ہے، قبلے کی تبدیلی سے یہی واضح کرنا مقصود تھا کہ عبادت بیت اللہ کی نہیں اللہ کی کرنی ہے، ورنہ اس میں اور بت پرستی میں کیا فرق رہ جاتا ہے ؟ اگلے جملے میں اللہ تعالیٰ نے یہ بھی واضح فرمادیا کہ جو لوگ صدیوں سے بیت اللہ کو قبلہ مانتے چلے آرہے تھے ان کے لئے اچانک بیت المقدس کی طرف رخ موڑ دینا کوئی آسان بات نہ تھی ؛ کیونکہ صدیوں سے دلوں پر حکمرانی کرنے والے اعتقادات کو یکایک بدل لینا بڑا مشکل ہوتا ہے ؛ لیکن جن لوگوں کو اللہ نے یہ سمجھ عطا فرمائی کہ کسی بھی چیز میں کوئی ذاتی تقدس نہیں اور اصل تقدس اللہ تعالیٰ کے حکم کو حاصل ہے ان کو نئے قبلے کی طرف رخ کرنے میں ذرا بھی دقت پیش نہیں آئی ؛ کیونکہ وہ سمجھ رہے تھے کہ ہم پہلے بھی اللہ کے بندے اور اس کے تابع فرمان تھے اور آج بھی اسی کے حکم پر ایسا کررہے ہیں۔\n 92: اس سلسلہ کلام میں اس جملے کا ایک مطلب تو حضرت حسن بصری ؒ نے یہ بیان فرمایا ہے کہ اگرچہ نئے قبلے کو اختیار کرلینا مشکل تھا ؛ لیکن جن لوگوں نے اپنی قوت ایمانی کا مظاہرہ کرتے ہوئے، اسے بےچون وچرا مان لیا اللہ تعالیٰ ان کے اس ایمانی جذبے کو ضائع نہیں کرے گا ؛ بلکہ انہیں اس کا عظیم اجر ملے گا (تفسیر کبیر) دوسرے یہ جملہ ایک سوال کا جواب بھی ہے جو بعض صحابہ کے دل میں پیدا ہوا تھا اور وہ یہ کہ جو مسلمان اس وقت انتقال فرماگئے تھے جب قبلہ بیت المقدس تھا تو کہیں ایسا تو نہیں کہ ان کی وہ نمازیں جو انہوں نے بیت المقدس کی طرف رخ کرکے پڑھی تھیں قبلے کی تبدیلی کے بعد ضائع اور کالعدم ہوجائیں ؟ آیت نے جواب دے دیا کہ نہیں چونکہ انہوں نے اپنے ایمانی جذبے کے تحت وہ نمازیں اللہ ہی کے حکم کی تعمیل میں پڑھی تھیں اس لئے وہ نمازیں ضائع نہیں ہوں گی۔"}