{"text":"100: حضرت ابراہیم ؑ نے کعبے کی تعمیر کے وقت دو دعائیں کی تھیں، ایک یہ کہ ہماری نسل سے ایسی امت پیدا فرمائیے جو آپ کی مکمل فرمانبردار ہو، اور دوسری یہ کہ ان میں ایک رسول بھیجئے (دیکھئے پیچھے آیات 128۔ 129) اللہ تعالیٰ نے پہلی دعا اس طرح قبول فرمائی کہ امت محمدیہ (علی صاحبہا السلام) کو معتدل امت قرار دے کر پیدا فرمایا (دیکھئے آیت 143) اب اللہ تعالیٰ فرماتے ہیں کہ جس طرح ہم نے حضرت ابراہیم ؑ کی دعا قبول کرتے ہوئے تم پر یہ انعام فرمایا کہ تمہیں معتدل امت بناکر آئندہ ہمیشہ کے لئے انسانیت کی رہنمائی تمہیں عطا کردی، جس کی ایک اہم علامت یہ بھی ہے کہ ہمیشہ کے لئے کعبے کو قبلہ بنادیا گیا ہے، اسی طرح ہم نے حضرت ابراہیم ؑ کی دوسری دعا قبول کرتے ہوئے رسول اکرم ﷺ کو تمہارے درمیان بھیج دیا ہے، جو انہی خصوصیات اور فرائض منصبی کے حامل ہیں جو حضرت ابراہیم ؑ نے ان کے لئے مانگے تھے، ان میں سے پہلا فریضہ تلاوت آیات ہے، اس سے معلوم ہوا کہ قرآن کریم کی آیات کو تلاوت کرنا بذات خود ایک مقصد اور ایک نیکی ہے، خواہ تلاوت آیات بغیر سمجھے کی جائے، کیونکہ قرآن کے معنی کی تعلیم آگے ایک مستقل فریضے کے طور پر بیان کی گئی ہے، دوسرا مقصد قرآن کریم کی تعلیم ہے، اس سے یہ بات واضح ہوتی ہے کہ آنحضرت ﷺ کی تعلیم کے بغیر قرآن کریم کو ٹھیک ٹھیک سمجھنا ممکن نہیں ہے، اور یہ کہ صرف ترجمہ پڑھ لینے سے قرآن کریم کی صحیح سمجھ حاصل نہیں ہوسکتی کیونکہ اہل عرب عربی زبان سے خوب واقف تھے، انہیں ترجمہ سکھانے کے لئے کسی استاذ کی ضرورت نہیں تھی، تیسرے آپ کا فریضہ یہ بتایا گیا ہے کہ آپ حکمت کی تعلیم دیں، اس سے معلوم ہوا کہ حکمت و دانائی اور عقلمندی وہی ہے جو آنحضرت ﷺ نے تلقین فرمائی، اس سے نہ صرف آپ کی احادیث کا حجت ہونا معلوم ہوتا ہے بلکہ یہ بھی واضح ہوتا ہے کہ اگر آپ کا کوئی حکم کسی کو اپنی عقل کے لحاظ سے حکمت کے خلاف محسوس ہو تو اعتبار اس کی عقل کا نہیں بلکہ آنحضرت ﷺ کی سکھائی ہوئی حکمت کا ہے، چوتھا فریضہ یہ بتایا گیا ہے کہ آپ لوگوں کو پاکیزہ بنائیں اس سے مراد آپ کی عملی تربیت ہے، جس کے ذریعے آپ نے صحابہ کرام کے اخلاق اور باطنی صفات کو گندے جذبات سے پاک کرکے انہیں اعلی درجے کی خصوصیات سے آراستہ فرمایا، اس سے معلوم ہوا کہ قرآن وسنت کا صرف کتابی علم بھی انسان کی اصلاح کے لئے کافی نہیں ہے، جب تک اس نے اس علم کو اپنی زندگی میں نافذ کرنے کی عملی تربیت نہ لی ہو، آنحضرت ﷺ نے صحابہ کو اپنی صحبت سے سرفراز فرما کر ان کی تربیت فرمائی، پھر صحابہ نے تابعین کی اور تابعین نے تبع تابعین کی اسی طرح تربیت کی، اور یہ سلسلہ صدیوں سے اسی طرح چلا آتا ہے، باطنی اخلاق کی اسی تربیت کا علم علم احسان یا تزکیہ کہلاتا ہے اور تصوف بھی در حقیقت اسی علم کا نام تھا اگرچہ بعض نااہلوں نے اس میں غلط خیالات کی ملاوٹ کرکے بعض مرتبہ اسے خراب بھی کردیا ؛ لیکن اس کی اصل یہی تزکیہ ہے جس کا ذکر قرآن کریم نے یہاں فرمایا ہے، اور ہر دور میں تصوف کی اصل حقیقت کو سمجھ کر اس پر عمل کرنے والے ہمیشہ موجود رہے ہیں۔"}