{"text":"(2) یعنی اس کتاب کی ہر بات کسی شک وشبہ کے بغیر درست ہے، انسان کی لکھی ہوئی کسی کتاب کو سوفیصد شک سے بالاتر نہیں سمجھا جاسکتا، کیونکہ انسان کتنا ہی بڑا عالم ہو اس کا علم محدود ہوتا ہے اور اکثر اس کی کتاب اس کے ذاتی گمان پر مبنی ہوتی ہے ؛ لیکن چونکہ یہ کتاب اللہ تعالیٰ کی ہے جس کا علم لامحدود بھی ہے اور سوفیصد یقینی بھی، اس لئے اس میں کسی شک کی گنجائش نہیں، کسی کو شک ہو تو یہ اس کی ناسمجھی کی وجہ سے ہوگا کتاب کی کوئی بات شبہ والی نہیں۔\n (3) اگرچہ قرآن کریم نے صحیح راستہ ہر ایک کو دکھایا ہے خواہ وہ مومن ہو یا کافر اس لئے اس معنی کے لحاظ سے اس کی ہدایت سب کے لئے ہے لیکن نتیجے کے اعتبار سے دیکھاجائے تو اس ہدایت کا فائدہ انہی کو پہنچتا ہے جو اس کی بات کو مان کر اس کے تمام احکام اور تعلیمات پر عمل کریں، اس لئے فرمایا گیا کہ ہدایت ہے پرہیزگاروں کے لئے جو بےدیکھی چیزوں پر ایمان لاتے ہیں، پرہیز گاری اور ڈر رکھنے کا مطلب یہ ہے کہ انسان یہ بات ہمیشہ پیش نظر رکھے کہ اسے ایک دن اللہ کے حضور اپنے تمام اعمال کا جواب دینا ہے لہذا مجھے کوئی کام ایسا نہ کرنا چاہیے جو اس کی ناراضی کا باعث ہو اسی خوف اور دھیان کا نام تقوی ہے۔ ”بےدیکھی چیزوں“ کے لئے قرآن کریم نے ”غیب“ کا لفظ استعمال فرمایا ہے اس سے مراد وہ چیزیں ہیں جو آنکھوں سے دکھائی نہیں دیتیں، نہ ہاتھ سے چھوکر یا ناک سے سونگھ کر انہیں محسوس کیا جاسکتا ہے، بلکہ وہ صرف اور صرف اللہ تعالیٰ کی وحی کے ذریعے معلوم ہوتی ہیں، یعنی یا تو قرآن کریم میں ان کا ذکر ہے یا آنحضرت ﷺ نے وحی کے ذریعے وہ باتیں معلوم کرکے ہمیں بتائی ہیں، مثلاً اللہ تعالیٰ کی صفات، جنت و دوزخ کے حالات، فرشتے وغیرہ، اس آیت میں اللہ تعالیٰ کے ان متقی بندوں کی تعریف کی جارہی ہے جو غیب کی چیزوں کو بغیر دیکھے صرف اللہ تعالیٰ اور اس کے رسول ﷺ کے ارشادات پر یقین کرکے دل سے مانتے ہیں جو انہوں نے آنکھوں سے نہیں دیکھیں، یہ دنیا چونکہ امتحان کی جگہ ہے، اس لئے اگر یہ چیزیں آنکھوں سے نظر آجاتیں اور پھر کوئی شخص ان پر ایمان لاتا تو کوئی امتحان نہ ہوتا، اللہ تعالیٰ نے ان چیزوں کو انسان کی نگاہ سے پوشیدہ رکھا ہے لیکن ان کے وجود کے بیشمار دلائل مہیا فرمادئے ہیں کہ جب کوئی شخص ذرا انصاف سے غور کرے گا تو ان باتوں پر ایمان لے آئے گا اور امتحان میں کامیاب ہوگا۔ قرآن کریم نے بھی وہ دلائل بیان فرمائے ہیں جو انشاء اللہ آگے آتے رہیں گے ضرورت صرف اس بات کی ہے کہ قرآن کریم کو حق طلبی کے جذبے سے غیرجانبدار ہو کر پڑھا جائے اور یہ خیال دل میں رکھا جائے کہ یہ معاملہ ایسا نہیں ہے کہ اس میں لاپروائی برتی جائے۔ یہ انسان کی ہمیشہ کی زندگی کی بہتری اور تباہی کا معاملہ ہے۔ لہٰذا یہ ڈر دل میں ہونا چاہیے کہ کہیں میری نفسانی خواہشات قرآن کریم کے دلائل ٹھیک ٹھیک سمجھنے میں رکاوٹ نہ بن جائیں اس لئے مجھے اس کی دی ہوئی ہدایت کو تلاش حق کے جذبے سے پڑھنا چاہیے، اور پہلے سے دل میں جمے ہوئے خیالات سے ذہن کو خالی کرکے پڑھنا چاہیے تاکہ مجھے واقعی ہدایت نصیب ہو۔ ”یہ ہدایت ہے ڈرنے والوں کے لئے“ کا ایک مطلب یہ بھی ہے۔"}