{"tafsir":"163: یہاں سے آیت نمبر : 260 تک دو مضمون ایک ساتھ بیان ہوئے ہیں، بنیادی مقصد جہاد کی ترغیب دینا ہے لیکن بعض منافقین اور کمزور طبیعت کے لوگ جہاد میں جانے سے اس لئے کتراتے تھے کہ انہیں موت کا خوف تھا، اس لئے دوسرا مضمون ساتھ ساتھ بیان ہوا ہے جس کا حاصل یہ ہے کہ موت اور زندگی اللہ تعالیٰ کے ہاتھ میں ہے وہ چاہے تو جنگ کے بغیر بھی موت دیدے اور چاہے تو شدید جنگ کے درمیان بھی انسانوں کی حفاظت کرلے ؛ بلکہ اس کی قدرت میں یہ بھی ہے کہ وہ مرنے کے بعد بھی انسانوں کو زندہ کردے، اس قدرت کا عمومی مظاہرہ تو آخرت میں ہوگا لیکن اللہ تعالیٰ نے اس دنیا میں بھی چند ایسے نمونے دنیا کو دکھادئیے ہیں جن میں بعض لوگوں کو مرنے کے بعد بھی زندہ کیا گیا ہے، اس کی ایک مثال اس آیت 243 میں دی گئی ہے، ایک اشارہ آیت نمبر : 253 میں حضرت عیسیٰ ؑ کی طرف کیا گیا ہے جن کے ہاتھوں اللہ تعالیٰ نے کئی مردوں کو زندہ کیا تیسرا حوالہ حضرت ابراہیم ؑ اور نمرود کے مکالمے (آیت نمبر : 258) میں اللہ تعالیٰ کے موت اور زندگی دینے سے متعلق ہے، چوتھا واقعہ آیت نمبر : 259 میں حضرت عزیر ؑ کا بیان فرمایا گیا ہے اور اس سے اگلی آیت (نمبر 260) میں پانچواں واقعہ حضرت ابراہیم ؑ کا ہے جس میں انہوں نے اللہ تعالیٰ سے عرض کیا تھا کہ اللہ تعالیٰ مردوں کو کیسے زندہ کرتے ہیں۔\n زیر نظر آیت (243) میں جو واقعہ بیان ہوا ہے اس کی تفصیل قرآن کریم نے بیان نہیں فرمائی۔ صرف اتنا بتایا ہے کہ کسی زمانے میں کوئی قوم جو ہزاروں کی تعداد میں تھی، موت سے بچنے کے لیے اپنے گھروں سے نکل کھڑی ہوئی تھی، مگر اللہ تعالیٰ نے انہیں موت دے دی، اور پھر زندہ کر کے یہ دکھا دیا کہ اگر موت سے بچنے کے لیے کوئی شخص اللہ تعالیٰ کے حکم کی خلاف ورزی کرتے ہوئے کوئی تدبیر اختیار کرے تو ضروری نہیں کہ موت سے بچ ہی جائے، اللہ تعالیٰ اسے پھر بھی موت کے گھاٹ اتار سکتا ہے۔ یہ لوگ کون تھے ؟ کس زمانے میں تھے ؟ وہ موت کا خوف کیا تھا جس کی بنا پر یہ بھاگ کھڑے ہوئے تھے ؟ یہ تفصیل قرآن کریم نے بیان نہیں فرمائی، کیونکہ قرآن کریم کوئی تاریخ کی کتاب نہیں ہے، اس میں جو واقعات بیان ہوتے ہیں، وہ کوئی سبق دینے کے لیے ہوتے ہیں، لہذا اکثر ان کا صرف اتنا حصہ بیان کیا جاتا ہے جس سے وہ سبق مل جائے۔ اور اس واقعے سے مذکورہ بالا سبق لینے کے لیے اتنی بات کافی ہے جو یہاں بیان ہوئی ہے۔ البتہ جس انداز سے قرآن کریم نے اس واقعے کی طرف اشارہ کیا ہے اس سے یہ اندازہ ہوتا ہے کہ یہ قصہ اس وقت لوگوں میں مشہور و معروف تھا۔ آیت کے شروع میں یہ الفاظ کہ : ”کیا تمہیں ان لوگوں کا حال معلوم نہیں ہوا ؟“ اس قصے کی شہرت پر دلالت کر رہے ہیں۔ چنانچہ حافظ ابن جریر طبری ؒ نے یہاں حضرت عبداللہ بن عباس اور بعض تابعین سے کئی روایتیں نقل کی ہیں جن سے معلوم ہوتا ہے کہ یہ واقعہ بنو اسرائیل کے لوگوں کا ہے جو ہزاروں کی تعداد میں ہونے کے باوجود یا تو کسی دشمن کے مقابلے سے کترا کر اپنا گھر بار چھوڑ گئے تھے یا طاعون کی وبا سے گھبرا کر نکل کھڑے ہوئے تھے۔ جب یہ اس جگہ پہنچے جسے وہ پناہ گاہ سمجھتے تھے تو اللہ کے حکم سے موت نے وہیں ان کو آلیا۔ بعد میں جب وہ بوسیدہ ہڈیوں میں تبدیل ہوگئے تو حضرت حزقیل ؑ کا وہاں سے گذر ہوا اور اللہ تعالیٰ نے ان کو حکم دیا کہ وہ ان ہڈیوں سے خطاب کریں، اور ان کے خطاب کے بعد وہ ہڈیاں پھر سے انسانی شکل میں زندہ ہو کر کھڑی ہوگئیں۔ حضرت حزقیل ؑ کا یہ قصہ موجودہ بائبل میں بھی مذکور ہے (دیکھئے : حزقی ایل 1:37 تا 15) اس لیے کچھ بعید نہیں ہے کہ یہ واقعہ مدینہ منورہ کے یہودیوں کے ذریعے مشہور ہوگیا ہو۔\n واقعے کی یہ تفصیلات مستند ہوں یا نہ ہوں، لیکن اتنی بات قرآن کریم کے صاف اور صریح الفاظ سے واضح ہے کہ ان لوگوں کو حقیقی طور پر موت کے بعد زندہ کیا گیا تھا۔ ہمارے زمانے کے بعض مصنفین نے مردوں کے زندہ ہونے کو بعید از قیاس سمجھتے ہوئے اس آیت میں یہ تاویل کی ہے کہ یہاں موت سے مراد سیاسی اور اخلاقی موت ہے، اور دوبارہ زندہ ہونے سے مراد سیاسی غلبہ ہے۔ لیکن حقیقت یہ ہے کہ تاویل قرآن کریم کے صریح الفاظ سے میل نہیں کھاتی۔ اور عربیت اور قرآن کریم کے اسلوب سے بھی بہت بعید ہے سیدھی سی بات یہ ہے کہ اگر اللہ تعالیٰ کی قدرت پر ایمان ہے تو اس قسم کے واقعات میں تعجب کی کیا بات ہے جس کی بنا پر یہ دور از کار تاویلیں کی جائیں ؟ بالخصوص یہاں سے آیت 260 تک جو سلسلہ کلام چل رہا ہے۔ اور جس کی تفصیل اوپر بیان ہوئی ہے، اس کی روشنی میں یہاں موت اور زندگی سے حقیقی معنی مراد ہونا ہی قرین قیاس ہے۔","translation":"کیا تمہیں ان لوگوں کا حال معلوم نہیں ہوا جو موت سے بچنے کے لیے اپنے گھروں سے نکل آئے تھے، اور وہ ہزاروں کی تعداد میں تھے ؟ چنانچہ اللہ نے ان سے کہا : مرجاؤ، پھر انہیں زندہ کیا۔ (163) حقیقت یہ ہے کہ اللہ لوگوں پر بہت فضل فرمانے والا ہے، لیکن اکثر لوگ شکر ادا نہیں کرتے۔"}