{"tafsir":"176: اس سوال و جواب کے ذریعے اللہ تعالیٰ نے یہ بات صاف کردی کہ حضرت ابراہیم ؑ کی یہ فرمائش خدانخواستہ کسی شک کی وجہ سے نہیں تھی، انہیں اللہ تعالیٰ کی قدرت کاملہ پر پورا یقین تھا ؛ لیکن آنکھوں سے دیکھنے کی بات ہی کچھ اور ہوتی ہے، اس سے نہ صرف مزید اطمینان حاصل ہوتا ہے، بلکہ اس کے بعد انسان دوسروں سے یہ کہہ سکتا ہے کہ جو کچھ کہہ رہا ہوں دلائل سے اس کا علم حاصل کرنے کے علاوہ آنکھوں سے دیکھ رہا ہوں۔\n 177: یعنی اگرچہ اللہ تعالیٰ کی قدرت کاملہ ہر وقت مردے کو زندہ کرنے کا مشاہدہ کر اسکتی ہے، مگر اس کی حکمت کا تقاضا یہ ہے کہ ہر ایک کو یہ مشاہدہ نہ کرایا جائے۔ اور بات دراصل یہ ہے کہ یہ دنیا چونکہ امتحان کی جگہ ہے، اس لیے یہاں اصل قیمت ایمان بالغیب کی ہے، اور انسان سے مطلوب یہ ہے کہ وہ ان حقائق پر آنکھوں سے دیکھے بغیر دلائل کی بنیاد پر ایمان لائے۔ البتہ انبیائے کرام کا معاملہ عام لوگوں سے مختلف ہے۔ وہ جب غیب کے حقائق پر غیر متزلزل ایمان لا کر یہ ثابت کرچکے ہوتے ہیں کہ ان کا ایمان نہ کسی شک کی گنجائش رکھتا ہے اور نہ وہ آنکھ کے کسی مشاہدے پر موقوف ہے تو ان کے ایمان بالغیب کا امتحان اسی دنیا میں پورا ہوجاتا ہے۔ پھر انہیں حکمت خداوندی کے تحت بعض غیبی حقائق آنکھوں سے بھی دکھا دئیے جاتے ہیں، تاکہ ان کے علم و اطمینان کا معیار عام لوگوں سے زیادہ ہو، اور وہ ڈنکے کی چوٹ یہ کہہ سکیں کہ وہ جس بات کی دعوت دے رہے ہیں اس کی حقانیت انہوں نے آنکھوں سے بھی دیکھ رکھی ہے۔\n بعض وہ لوگ جو خلاف عادت باتوں کا اعتراف کرتے ہوئے ہچکچاتے ہیں، انہوں نے اس آیت میں بھی ایسی کھینچ تان کی ہے جس سے یہ نہ ماننا پڑے کہ وہ پرندے واقعۃً مر کر زندہ ہوگئے تھے۔ لیکن قرآن کریم کا پورا سیاق اور جو الفاظ استعمال کیے گئے ہیں ان کا اسلوب ایسی تاویلات کی تردید کرتا ہے۔ جو شخص عربی زبان کے محاورات اور اسالیب سے واقف ہو وہ ان آیات کا اس کے سوا کوئی مطلب نہیں نکالے گا جو ترجمے میں بیان کیا گیا ہے۔","translation":"اور (اس وقت کا تذکرہ سنو) جب ابراہیم نے کہا تھا کہ میرے پروردگار مجھے دکھایے کہ آپ مردوں کو کیسے زندہ کرتے ہیں ؟ اللہ نے کہا : کیا تمہیں یقین نہیں ؟ کہنے لگے : یقین کیوں نہ ہوتا ؟ مگر (یہ خواہش اس لیے کی ہے) تاکہ میرے دل کو پورا اطمینان حاصل ہوجائے۔ (176) اللہ نے کہا : اچھا تو چار پرندے لو، اور انہیں اپنے سے مانوس کرلو، پھر (ان کو ذبح کر کے) ان کا ایک ایک حصہ ہر پہاڑ پر رکھ دو ، پھر ان کو بلاؤ، وہ چاروں تمہارے پاس دوڑے چلے آئیں گے۔ (177) اور جان رکھو کہ اللہ پوری طرح صاحب اقتدار بھی ہے، اعلی درجے کی حکمت والا بھی۔"}