{"text":"(24) عہد سے مراد اکثر مفسرین نے وہ عہد الست لیا ہے جس کا ذکر سورة اعراف (7: 172) میں ہے، یعنی اللہ تعالیٰ نے انسانوں کو پیدا کرنے سے بہت پہلے آنے والی تمام روحوں کو جمع کرکے ان سے پوچھا تھا کہ کیا میں تمہارا پروردگار نہیں ہوں، سب نے اللہ تعالیٰ کے پروردگار ہونے کا اقرار کرکے یہ عہد کیا تھا کہ وہ اللہ تعالیٰ کی اطاعت کریں گے، پھر اس آیت میں عہد کو پختہ کرنے سے مراد بظاہر یہ ہے کہ ہر دور میں اللہ تعالیٰ کے رسول آتے رہے جو اس عہد کو یاد دلاکر اللہ تعالیٰ کے خالق ومالک ہونے پر دلائل قائم کرتے رہے۔\n اس عہد کی ایک اور تشریح بھی ممکن ہے اور وہ یہ کہ اس سے مراد وہ عملی اور خاموش عہد (tacit covenant) ہے جو ہر انسان پیدا ہوتے ہی اپنے خالق ومالک سے کرتا ہے یہ ایسا ہی ہے جیسے ہر شخص جو کسی ملک میں پیدا ہوتا ہے وہ اس ملک کا شہری ہونے کے ناطے یہ خاموش عہد کرتا ہے کہ وہ اس ملک کے قوانین کا پابند ہوگا خواہ زبان سے اس نے کچھ نہ کہا ہو لیکن اس کا کسی ملک میں پیدا ہونا ہی اس عہد کے قائم مقام ہے، اسی طرح کائنات میں جو شخص بھی پیدا ہوتا ہے وہ خود بخود اس عہد کا پابند ہوجاتا ہے کہ وہ اپنے پیدا کرنے والے کی ہدایات کے مطابق زندگی گزارے گا۔ اس عہد کے لئے زبان سے کچھ کہنے کی ضرورت نہیں ہے۔ غالباً اسی وجہ سے اگلی آٰیت میں باری تعالیٰ نے فوراً یہ ارشاد فرمایا کہ ”تم اللہ تعالیٰ کے ساتھ کفر کا طرز عمل آخر کیسے اختیار کرلیتے ہو، حالانکہ تم بےجان تھے، اسی نے تمہیں زندگی بخشی“ یعنی اگر ذرا غور کرو تو تنہا یہ بات کہ کسی نے تمہیں پیدا کیا ہے، تمہاری طرف سے یہ عہد و پیمان ہے کہ تمہارے لئے ان کی نعمتوں کا اعتراف اور اس کے بتائے ہوئے طریقے پر چلنا لازمی ہوگا۔ ورنہ یہ کونسی عقل اور کونسا انصاف ہے کہ پیدا تو اللہ تعالیٰ کرے، اور فرمانبرداری اس کے بجائے کسی اور کی کی جائے، پھر اس خاموش عہد کو مزید پختہ کرنے سے مراد یہ ہے کہ اللہ تعالیٰ اپنے پیغمبروں کے ذریعے متواتر تمہیں اس عہد کی یاد دہانی کراتا رہا ہے اور ان پیغمبروں نے وہ مضبوط دلائل تمہارے سامنے پیش کئے ہیں جن سے یہ عہد مزید پختہ ہوگیا ہے کہ انسان کو ہر معاملے میں اللہ تعالیٰ کی اطاعت کرنی ہے۔\n 25 اس سے مراد رشتہ داروں کے وہ حقوق پامال کرنا ہے جنہیں صلہ رحمی کہا جاتا ہے یہاں اللہ تعالیٰ نے ان کافروں کی تین صفات بیان کی ہیں، ایک یہ کہ وہ اللہ سے کیا ہوا عہد توڑتے ہیں دوسرے یہ کہ وہ رشتہ داروں کے حقوق پامال کرتے ہیں اور تیسرے یہ کہ زمین میں فساد مچاتے ہیں، ان میں سے پہلی چیز اللہ تعالیٰ کے حقوق سے متعلق ہے یعنی وہ اللہ تعالیٰ کے بارے میں وہ عقیدہ رکھتے ہیں جو رکھنا چاہیے اور نہ اس کی وہ عبادت کرتے ہیں جو ان پر فرض ہے، دوسری اور تیسری چیز کا تعلق حقوق العباد سے ہے، اللہ تعالیٰ نے مختلف رشتوں کے جو حقوق مقرر فرمائے ہیں، ان کی ٹھیک ٹھیک ادائیگی سے ہی ایک پاکیزہ معاشرہ وجود میں آتا ہے، اگر ان رشتوں کو کاٹ کر باپ، بیٹے، بھائی بھائی، شوہر اور بیوی ایک دوسرے کے حقوق پامال کرنا شروع کردیں تو وہ خاندانی نظام تباہ ہوجاتا ہے جس پر ایک صحت مند تمدن کی بنیاد قائم ہوتی ہے، لہذا اس کا لازمی نتیجہ زمین میں فساد کی صورت میں نکلتا ہے اسی لئے قرآن کریم نے رشتوں کو کاٹنے اور زمین میں فساد مچانے کو سورة محمد (26: 22) میں بھی ایک ساتھ ملاکر ذکر فرمایا ہے . آیت فھل عسیتم ان تولیتم ان تفسدوا فی الارض وتقطعوا ارحامکم۔"}