{"text":"184:\" سود \" یا \" رباء \" ہر اس زیادہ رقم کو کہا جاتا ہے جو کسی قرض پر طے کرکے وصول کی جائے، مشرکین کا کہنا تھا کہ جس طرح ہم کوئی سامان فروخت کرکے نفع کماتے ہیں اور اس کو شریعت نے حلال قرار دیا ہے، اسی طرح اگر قرض دے کر کوئی نفع کمائیں تو کیا حرج ہے ؟ ان کے اس اعتراض کا جواب تو یہ تھا کہ سامان تجارت کا تو مقصد ہی یہ ہے کہ اسے بیچ کر نفع کمایا جائے، لیکن نقدی اس کام کے لئے نہیں بنائی گئی کہ اسے سامان تجارت بناکر اس سے نفع کمایا جائے، وہ تو ایک تبادلے کا ذریعہ ہے ؛ تاکہ اس کے ذریعہ اشیائے ضرورت خریدی اور بیچی جاسکیں، نقدی کا نقدی سے تبادلہ کرکے اسے بذات خود نفع کمانے کا ذریعہ بنالیا جائے تو اس سے بیشمار مفاسد پیدا ہوتے ہیں، لیکن اللہ تعالیٰ نے یہاں بیع اور سود کے درمیان فرق کی تفصیل بیان کرنے کے بجائے ایک حاکمانہ جواب دیا ہے کہ جب اللہ تعالیٰ نے بیع کو حلال اور سود کو حرام قرار دے دیا ہے تو ایک بندے کا کام یہ نہیں ہے کہ وہ اللہ تعالیٰ سے اس حکم کی حکمت اور اس کا فلسفہ پوچھتا پھرے اور گویا عملاً یہ کہے کہ جب تک مجھے اس کا فلسفہ سمجھ میں نہیں آجائے گا میں اس حکم پر عمل نہیں کروں گا، واقعہ یہ ہے کہ اللہ تعالیٰ کے ہر حکم میں یقیناً کوئی نہ کوئی حکمت ضرور ہوتی ہے ؛ لیکن ضروری نہیں کہ وہ ہر شخص کی سمجھ میں بھی آجائے، لہذا اگر اللہ تعالیٰ پر ایمان ہے تو پہلے اس کے ہر حکم پر سرتسلیم خم کرنا چاہیے، اس کے بعد اگر کوئی شخص اپنے مزید اطمینان کے لئے حکمت اور فلسفہ سمجھنے کی کوشش کرے تو کوئی حرج نہیں ؛ لیکن اس پر اللہ تعالیٰ کے حکم کی تعمیل کو موقوف رکھنا ایک مومن کا طرز عمل نہیں۔\n 185: مطلب یہ ہے کہ جن لوگوں نے سود کی حرمت نازل ہونے سے پہلے لوگوں سے سود وصول کیا ہے، چونکہ اس وقت تک سود کے حرام ہونے کا اعلان نہیں ہوا تھا اس لئے وہ پچھلے معاملات معاف ہیں، اور ان کے ذریعے جو رقمیں وصول کی گئی ہیں وہ واپس کرنے کی ضرورت نہیں، البتہ حرمت کے اعلان کے وقت جو سود کسی پر واجب الادا ہو وہ لینا جائز نہیں ہوگا ؛ بلکہ اسے چھوڑنا ہوگا جیسا کہ آیت نمبر 278 میں حکم دیا گیا ہے۔\n 186: یعنی جن لوگوں نے حرمت سودی کو تسلیم نہ کیا اور وہی اعتراض کرتے رہے کہ بیع اور سود میں کوئی فرق نہیں، وہ کافر ہونے کی وجہ سے ابدی عذاب کے مستحق ہوں گے۔ سود کے موضوع پر مزید تفصیل کے لیے دیکھئے ان آیات کے تحت معارف القرآن اور مسئلہ سود از حضرت مولانا مفتی محمد شفیع صاحب ؒ اور میرا مذکورہ بالا فیصلہ۔"}