{"tafsir":"36 : جب آدم ؑ کو اپنی غلطی کا احساس ہوا تو وہ پریشان ہوگئے لیکن سمجھ میں نہیں آرہا تھا کہ اللہ تعالیٰ سے کن الفاظ میں معافی مانگیں، اس لئے زبان سے کچھ نکل نہیں رہا تھا، اللہ تعالیٰ نے جو دلوں کے حال سے بھی خوب واقف ہے اور رحیم وکریم بھی ہے ان کی اس کیفیت کے پیش نظر خود ہی ان کو توبہ کے الفاظ سکھائے جو سورة اعراف میں مذکور ہیں : قَالَا رَبَّنَا ظَلَمْنَا اَنْفُسَنَا وَاِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُوْنَنَّ مِنَ الْخَاسِرِیْنَ (آیت نمبر : 23) اے ہمارے پروردگار ہم اپنی جانوں پر ظلم کر گزرے ہیں اور اگر آپ نے ہمیں معاف نہ فرمایا اور ہم پر رحم نہ کیا تو ہم برباد ہوجائیں گے۔\n اس طرح اللہ تعالیٰ نے زمین پر بھیجنے سے پہلے انسان کو یہ تعلیم دے دی کہ جب کبھی نفسانی خواہشات یا شیطان کے بہکاوے میں آکر اس سے کوئی گناہ سرزد ہوجائے تو اسے فوراً اللہ تعالیٰ سے توبہ کرنی چاہیے اور اگرچہ توبہ کے لئے کوئی خاص الفاظ لازمی نہیں ہیں بلکہ ہر وہ جملہ جس میں اپنے کئے پر ندامت اور آئندہ گناہ نہ کرنے کا ارادہ شامل ہو، اس کے ذریعہ توبہ ممکن ہے لیکن چونکہ یہ الفاظ خود اللہ تعالیٰ کے سکھائے ہوئے ہیں اس لئے ان الفاظ میں توبہ کرنے سے قبولیت کی زیادہ امید ہے۔\n یہاں یہ بات بھی سمجھنے کی ہے کہ جیسا کہ پیچھے آٰیت 30 سے واضح ہوتا ہے اللہ تعالیٰ نے شروع ہی سے آدم ؑ کو زمین پر اپنا نائب بنا کر بھیجنے کے لئے پیدا فرمایا تھا لیکن زمین پر بھیجنے سے پہلے انہیں جنت میں رکھنے اور اس کے بعد کے واقعات کا تکوینی مقصد بظاہر یہ تھا کہ ایک طرف حضرت آدم ؑ جنت کی نعمتوں کا خود تجربہ کرکے دیکھ لیں کہ ان کی اصل منزل کیا ہے اور زمین پر پہنچنے کے بعد اس منزل کے حصول میں کس قسم کی رکاوٹیں پیش آسکتی ہیں اور ان سے نجات پانے کا کیا طریقہ ہوگا ؟ چونکہ فرشتوں کے مقابلے میں انسان کا امتیاز ہی یہ تھا کہ اس میں اچھائی اور برائی دونوں کی صلاحیت رکھی گئی تھی اس لئے ضروری تھا کہ اسے زمین پر بھیجنے سے پہلے ایسے تجربے سے گزارا جائے پیغمبر چونکہ معصوم ہوتے ہیں اور ان سے کوئی بڑا گناہ سرزد نہیں ہوسکتا اس لئے حضرت آدم ؑ کی یہ غلطی درحقیقت اجتہادی غلطی (Bonafide Mistake تھی یعنی سوچ کی یہ غلطی کہ اللہ تعالیٰ کے حکم کو شیطان کے بہکانے سے ایک خاص وقت تک محدود سمجھ لیا، ورنہ اللہ تعالیٰ کی کھلی نافرمانی کا ہرگز ان سے تصور نہیں کیا جاسکتا تاہم چونکہ یہ قصور بھی ایک پیغمبر کے شایان شان نہ تھا اس لئے اسے بعض آیات میں گناہ یا حکم عدولی سے تعبیر کیا گیا ہے اور اس پر توبہ کی تلقین فرمائی گئی ہے۔ ساتھ ہی زیر نظر آیت میں یہ واضح کردیا گیا ہے کہ اللہ تعالیٰ نے ان کی توبہ قبول فرمالی اور اس طرح اس عیسائی عقیدہ کی تردید فرمادی گئی جس کا کہنا یہ ہے کہ آدم ؑ کا یہ گناہ ہمیشہ کے لئے انسان کی سرشت میں داخل ہوگیا تھا جس کے نتیجے میں ہر بچہ ماں کے پیٹ سے گناہگار پیدا ہوتا ہے اور اس مشکل کے حل کے لئے اللہ تعالیٰ کو اپنا بیٹا دنیا میں بھیج کر اسے قربان کرنا پڑا تاکہ وہ ساری دنیا کے لئے کفارہ بن سکے، قرآن کریم نے دوٹوک الفاظ میں اعلان فرمادیا کہ اللہ تعالیٰ نے ان کی توبہ قبول فرمالی تھی اس لئے نہ وہ گناہ باقی رہا تھا نہ اس کے اولاد آدم کی طرف منتقل ہونے کا سوال ہے کیونکہ اللہ تعالیٰ کے قانون عدل میں ایک شخص کے گناہ کا بوجھ دوسرے کے سر پر نہیں ڈالا جاتا۔","translation":"پھر آدم نے اپنے پروردگار سے (توبہ کے) کچھ الفاظ سیکھ لیے (جن کے ذریعے انہوں نے توبہ مانگی) چنانچہ اللہ نے ان کی توبہ قبول کرلی (36) بیشک وہ بہت معاف کرنے والا، بڑا مہربان ہے"}