{"text":"49: جب حضرت موسیٰ ؑ تورات لے کر آئے تو بنی اسرائیل نے دیکھا کہ اس کے بعض احکام بہت سخت ہیں، اس لئے اس سے بچنے کے بہانے تلاش کرنے شروع کردئے، پہلے تو انہوں نے کہا کہ اللہ تعالیٰ ہم سے خود کہے کہ تورات پر عمل کرنا ضروری ہے، مطالبہ اگرچہ نامعقول تھا مگر ان پر حجت تمام کرنے کے لئے ان میں سے ستر آدمی منتخب کرکے حضرت موسیٰ ؑ کے ساتھ کوہ طور پر بھیجے گئے (اعراف، 7: 155) جن کو اللہ تعالیٰ نے براہ راست تورات پر عمل کا حکم دیا، مگر جب یہ واپس لوٹے تو انہوں نے اپنی قوم کے سامنے تصدیق تو کی کہ اللہ تعالیٰ نے تورات پر عمل کا حکم دیا ہے ؛ لیکن ایک بات اپنی طرف سے بڑھادی کہ اللہ تعالیٰ نے یہ بھی فرمایا ہے کہ جتنا تم سے ہوسکے اتنا عمل کرلینا ؛ لیکن جو نہ ہوسکے وہ ہم معاف کردیں گے ؛ چنانچہ تورات کے جس حکم میں بھی انہیں کچھ مشکل نظر آتی وہ یہ بہانہ تراش لیتے کہ یہ حکم بھی اسی چھوٹ میں داخل ہے، اس موقع پر اللہ تعالیٰ نے کوہ طور ان کے سروں پر بلند کردیا کہ تورات کے تمام احکام کو تسلیم کرو، جب انہیں یہ اندیشہ ہوا کہ کہیں پہاڑ ان پر گرانہ دیا جائے تب ان لوگوں نے تورات کو ماننے اور اس پر عمل کرنے کا عہد کیا۔ اس آیت میں اسی واقعے کی طرف اشارہ ہے کوہ طور کو ان کے سروں پر بلند کرنے کی یہ صورت بھی ممکن ہے کہ پہاڑ کو اپنی جگہ سے ہٹاکر ان کے سروں پر معلق کردیا گیا ہو، جیسا کہ حافظ ابن جریر ؒ نے متعدد تابعین سے نقل کیا ہے اور ظاہر ہے کہ اللہ تعالیٰ کی قدرت سے یہ کچھ بھی بعید نہیں ہے اور یہ بھی ممکن ہے کہ کوئی اور ایسی صورت پیدا فرمادی گئی ہو کہ ان لوگوں کو ایسا محسوس ہوا ہو کہ پہاڑ ان پر آگرے گا مثلا کوئی زلزلہ آگیا ہو جس سے انہیں ایسا لگا کہ پہاڑ گرنے والا ہے چنانچہ سورة اعراف (آیت 171) میں اس واقعے کے بارے میں الفاظ یہ ہیں واذنتقنا الجبل فوقھم کانہ ظلۃ وظنوا انہ واقع بھم اس میں لفظ ”نتق“ استعمال ہوا ہے جس کے معنی لغت میں زور زور سے ہلانے کے آتے ہیں (دیکھئے قاموس اور مفردات القرآن) لہٰذا آیت کا یہ ترجمہ بھی ممکن ہے کہ ”جب ہم نے پہاڑ کو ان کے اوپر زور سے اس طرح ہلایا کہ ان کو گمان ہوا کہ وہ ان پر گرپڑے گا یہاں یہ بات واضح رہے کہ کسی شخص کو ایمان قبول کرنے پر تو زبردستی مجبور نہیں کیا جاسکتا لیکن جب ایک شخص ایمان لے آئے تو اسے نافرمانی پر سزا بھی دی جاسکتی ہے اور ڈرا دھمکا کر حکم ماننے پر آمادہ بھی کیا جاسکتا ہے بنی اسرائیل چونکہ ایمان پہلے ہی لاچکے تھے اس لئے ان کو اللہ کے عذاب سے ڈرا کر فرمانبرداری پر آمادہ کیا گیا۔"}