{"text":"سورة توبہ \n تعارف \n یہ بھی مدنی سورت ہے، اور حضور نبی کریم ﷺ کی حیات طیبہ کے آخری دور میں نازل ہوئی ہے۔ اپنے مضامین کے اعتبار سے یہ پچھلی سورت یعنی سورة انفال کا تکملہ ہے۔ غالبا اسی لیے عام سورتوں کے برخلاف اس سورت کے شروع میں بسم اللہ الرحمن الرحیم نہ نازل ہوئی، نہ لکھی گئی۔ اور اس کی تلاوت کا بھی قاعدہ یہ ہے کہ جو شخص پیچھے سورة انفال سے تلاوت کرتا چلا آرہا ہو، اسے یہاں بسم اللہ نہیں پڑھنی چاہیے، البتہ اگر کوئی شخص اسی سورت سے تلاوت شروع کر رہا ہو تو اس کو بسم اللہ پڑھنی چاہیے۔ اور بعض لوگوں نے اس سورت کے شروع میں بسم اللہ کے بجائے کچھ اور جملے پڑھنے کے لیے بنا رکھے ہیں، وہ بےبنیاد ہیں۔ اوپر جو طریقہ لکھا گیا ہے، وہی سلف صالحین کا طریقہ رہا ہے۔\n یہ سورت فتح مکہ کے بعد نازل ہوئی تھی۔ عرب کے بہت سے قبائل اس انتظار میں تھے کہ آنحضرت ﷺ کے ساتھ کفار قریش کی جنگ کا انجام کیا ہوتا ہے ،۔ جب قریش نے حدیبیہ والا معاہدہ توڑ دیا تو آنحضرت ﷺ نے مکہ مکرمہ پر حملہ کیا، اور کسی خاص خونریزی کے بغیر اسے فتح کرلیا۔ اس موقع پر کفار کی کمر ٹوٹ چکی تھی، البتہ آخری تدبیر کے طور پر قبیلہ ہوازن نے ایک بڑا لشکر مسلمانوں سے مقابلے کے لیے جمع کیا جس سے حنین کی وادی میں آخری بڑی جنگ ہوئی، اور شروع میں معمولی ہزیمت کے بعد مسلمانوں کو اس میں بھی فتح ہوئی۔ اس جنگ کے بعض واقعات بھی اس سورت میں بیان ہوئے ہیں۔ اب عرب کے جو قبائل قریش کی وجہ سے اسلام قبول کرنے سے ڈرتے تھے، یا ان کی جنگوں کے آخری انجام کے منتظر تھے، ان کے دل سے اسلام کے خلاف ہر رکاوٹ دور ہوگئی اور وہ جوق در جوق مدینہ منورہ آکر مسلمان ہوئے، اور اسی طرح جزیرہ عرب کے بیشتر علاقے پر اسلام کا پرچم لہرانے لگا۔ اس موقع پر اللہ تعالیٰ کی طرف سے جزیرہ عرب کو اسلام اور مسلمانوں کا بنیادی مرکز قرار دے دیا گیا۔ اصل منشا تو یہی تھی کہ پورے جزیرہ عرب میں کوئی بھی غیر مسلم مستقل باشندے کی حیثیت میں باقی نہ رہے، جیسا کہ آنحضرت ﷺ نے اس خواہش کا اظہار فرمایا کہ جزیرہ عرب میں دو دین باقی نہ رہنے پائیں۔ (موطا امام مالک، کتاب الجامع و مسند احمد ج : 6 ص : 572) لیکن اس مقصد کو حاصل کرنے کے لیے تدریج کا طریقہ اختیار فرمایا گیا۔ سب سے پہلا ہدف یہ مقرر فرمایا گیا کہ جزیرہ عرب کو بت پرستوں سے خالی کرایا جائے۔ چنانچہ جو بچے کھچے بت پرست عرب میں رہ گئے تھے، اور جنہوں نے بیس سال سے زیادہ مدت تک مسلمانوں کو وحشیانہ مظالم کا نشانہ بنایا تھا، ان کو اس سورت کے شروع میں مختلف مدتوں کی مہلت دی گئی جس میں اگر وہ اسلام قبول نہ کریں تو انہیں جزیرہ عرب چھوڑنے، ورنہ جنگ کا سامنا کرنے کے احکام دئیے گئے ہیں، اور مسجد حرام کو بت پرستی کی ہر نشانی سے پاک کرنے کا اعلان کیا گیا ہے۔ اس ہدف کے پورا ہونے کے بعد جزیرہ عرب کی مکمل صفائی کا دوسرا مرحلہ یہود و نصاری کو وہاں سے نکالنے کا تھا۔ آنحضرت ﷺ کی حیات طیبہ میں یہ مرحلہ مکمل نہیں ہوسکا تھا، لیکن آپ نے اس کی وصیت فرما دی تھی، جیسا کہ آیت نمبر 29 کے تحت اس کی وضاحت آنے والی ہے۔\n اس سے پہلے روم کے بادشاہ نے مسلمانوں کی بڑھتی ہوئی طاقت کو دیکھ کر ان پر حملہ کرنے کے لیے ایک بڑی فوج جمع کی۔ آنحضرت ﷺ پیش قدمی کر کے اس کے مقابلے کے لیے تبوک تک تشریف لے گئے۔ اس سورت کا بہت بڑا حصہ اس مہم کے مختلف پہلوؤں پر روشنی ڈالتا ہے۔ منافقین کی معاندانہ کاروائیاں مسلسل جاری تھی، اس سورت میں ان کی بدعنوانیوں کو بھی طشت ازبام کیا گیا ہے۔\n اس سورت کو سورة توبہ بھی کہا جاتا ہے، اور سورة برائت بھی۔ برائت اس لیے کہ اس کے شروع میں مشرکین سے برائت اور دستبرداری کا اعلان کیا گیا ہے، اور توبہ اس لیے کہ اس میں بعض ان صحابہ کرام کی توبہ قبول ہونے کا ذکر ہے جنہوں نے تبوک کی مہم میں حصہ نہیں لیا تھا، اور بعد میں اپنی اس غلطی پر توبہ کی تھی۔\n ان آیتوں کو اچھی طرح سمجھنے کے لئے وہ پس منظر جاننا ضروری ہے جو اس سورت کے تعارف میں اوپر بیان کیا گیا ہے، جزیرہ عرب کو اسلام کا مرکز بنانے کے لئے اللہ تعالیٰ نے یہ حکم نازل فرمایا کہ کچھ عرصے کی مہلت کے بعد کوئی بت پرست مستقل طور پر جزیرہ عرب میں نہیں رہ سکتا، چنانچہ ان آیات میں ان بچے کھچے مشرکین سے دستبرداری کا اعلان کیا گیا ہے جو ابھی تک اسلام نہیں لائے تھے، اگرچہ یہ مشرکین وہ تھے جنہوں نے مسلمانوں کو ستانے میں کوئی کسر نہیں چھوڑی تھی، اور ان پر وحشیانہ ظلم ڈھائے تھے، لیکن جزیرہ عرب سے نکلنے کے لئے مختلف مہلتیں دی گئی ہیں جن کی تفصیل ان آیتوں میں آئی ہے،\n ان مشرکین کی چار قسمیں تھیں :\n (الف) پہلی قسم ان مشرکین کی تھی جن کے ساتھ مسلمانوں نے جنگ بندی کا معاہدہ نہیں کیا ہوا تھا، ایسے مشرکین کو چار مہینے کی مہلت دی گئی کہ ان چار مہینوں میں وہ اگر اسلام لانا چاہتے ہیں تو اسلام لے آئیں، اور اگر جزیرہ عرب سے باہر کہیں جانا چاہیں تو اس کا انتظام کرلیں، اگر یہ دونوں کام نہ کرسکیں تو ان کے خلاف ابھی سے اعلان کردیا گیا ہے کہ ان کو جنگ کا سامنا کرنا ہوگا۔\n (ترمذی، کتاب الحج، حدیث نمبر : 871)۔\n (ب) دوسری قسم ان مشرکین کی تھی جن کے ساتھ جنگ بندی کا معاہدہ تو تھا لیکن اس کی کوئی مدت متعین نہیں تھی، ان کے بارے میں بھی اعلان کردیا گیا کہ اب وہ معاہدہ چار مہینے تک جاری رہے گا، اس دوران ان کو بھی وہی کام کرنے ہوں گے جن کا ذکر پہلی قسم کے بارے میں کیا گیا، سورة توبہ کی پہلی اور دوسری آیت ان دو قسموں سے متعلق ہے۔\n (ج) تیسری قسم ان مشرکین کی تھی جن کے ساتھ آنحضرت ﷺ نے معاہدہ تو کیا تھا ؛ لیکن انہوں نے بد عہدی کی، اور وہ معاہدہ توڑدیا، جیسے کفار قریش کے ساتھ حدیبیہ میں معاہدہ ہوا تھا ؛ لیکن انہوں نے اس کی خلاف ورزی کی، اور اسی کی بنا پر آنحضرت ﷺ نے مکہ مکرمہ پر حملہ کرکے اسے فتح کرلیا تھا، ان لوگوں کو کوئی مزید مہلت تو نہیں دی گئی ؛ لیکن چونکہ دست برداری کا یہ اعلان حج کے موقع پر کیا گیا تھا جو خود حرمت والے مہینے میں ہوتا ہے، اور اس کے بعد محرم کا مہینہ بھی حرمت والا ہے، اور اس میں جنگ کرنا جائز نہیں ہے، اس لئے ان کو محرم کے آخر تک مہلت مل گئی، انہی کے بارے میں آیت نمبر : 5 میں یہ فرمایا گیا ہے کہ حرمت والے مہینوں کے گزر جانے کے بعد اگر یہ، نہ ایمان لائیں اور نہ جزیرہ عرب سے باہر جائیں تو ان کو قتل کردیا جائے گا۔\n (د) چوتھی قسم ان مشرکین کی تھی جن کے ساتھ کسی خاص مدت تک کے لئے مسلمانوں نے جنگ بندی کا معاہدہ کر رکھا تھا، اور انہوں نے کوئی بد عہدی بھی نہیں کی تھی ایسے لوگوں کے بارے میں آیت نمبر : 4 میں یہ حکم دیا گیا ہے کہ ان کے معاہدے کی جتنی بھی مدت باقی ہے اس کو پورا کیا جائے، اور اس پوری مدت میں ان کے ساتھ کسی قسم کا تعرض نہ کیا جائے، مثلاً قبیلہ کنانہ کے دوچھوٹے قبیلے بنو ضمر اور بنو مدلج کے ساتھ آپ کا ایسا ہی معاہدہ تھا، اور ان کی طرف سے کوئی بد عہدی سامنے نہیں آئی تھی، ان کے معاہدہ کی مدت ختم ہونے میں اس وقت نو مہینے باقی تھے ؛ چنانچہ ان کو نو مہینے کی مہلت دی گئی۔\n ان چاروں قسم کے اعلانات کو براءت یا دستبرداری کے اعلانات کہا جاتا ہے۔"}