{"tafsir":"82: ان آیات میں منافقین کے ایک نہایت شریر گروہ کا بیان ہے جنہوں نے ایک خطرناک سازش کے تحت ایک عمارت مسجد کے نام سے بنائی تھی۔ اس واقعے کی تفصیل یہ ہے کہ مدینہ منورہ کے قبیلے خزرج میں ابو عامر نام کا ایک شخص تھا جو عیسائی ہوگیا تھا، اور اس نے رہبانیت اور درویشی کی زندگی اختیار کرلی تھی۔ مدینہ منورہ کے لوگ آنحضرت ﷺ کے تشریف لانے سے پہلے اس کی بڑی عزت کرتے تھے۔ آنحضرت ﷺ مدینہ منورہ تشریف لائے تو آپ نے اسے بھی دین حق کی دعوت دی، لیکن اس نے حق کو قبول کرنے کے بجائے آنحضرت ﷺ کو اپنا حریف سمجھ لیا، اور آپ کی دشمنی پر کمر باندھ لی۔ جنگ بدر سے لے کر جنگ حنین تک کفار مکہ سے جتنی جنگیں ہوئی، ان سب میں یہ مسلمانوں کے خلاف دشمنوں کی مدد اور تائید کرتا رہا۔ جب جنگ حنین میں بھی مسلمانوں کو فتح ہوئی تو یہ شام چلا گیا، اور وہاں سے مدینہ منورہ کے منافقین کو خط لکھا کہ میں شام میں یہ کوشش کر رہا ہوں کہ روم کا بادشاہ مدینہ منورہ پر چڑھائی کر کے مسلمانوں کو ختم کر ڈالے۔ لیکن اس کام کے لیے ضروری ہے کہ تم لوگ اپنا ایک محاذ ایسا بناؤ کہ جب روم کا بادشاہ حملہ کرے تو تم اندر سے اس کی مدد کرسکو۔ اسی نے یہ مشورہ بھی دیا کہ تم ایک عمارت مسجد کے نام سے بناؤ جو بغاوت کے مرکز کے طور پر استعمال ہو اس میں خفیہ طور سے ہتھیار بھی جمع کرو۔ اور آپس میں مشورے بھی یہیں کیا کرو، اور میری طرف سے کوئی ایلچی آئے تو اسے بھی یہاں ٹھہراؤ، چنانچہ ان منافقین نے قبا کے علاقے میں یہ عمارت بنائی اور آنحضرت ﷺ سے درخواست کی کہ بہت سے کمزور لوگوں کو مسجد قبا دور پڑتی ہے، اس لیے ان کی آسانی کی خاطر ہم نے یہ مسجد تعمیر کی ہے۔ آپ کسی وقت یہاں تشریف لاکر نماز پڑھیں، تاکہ اسے برکت حاصل ہو۔ آنحضرت ﷺ اس وقت تبوک جانے کی تیاری میں مصروف تھے، اس لیے آپ نے فرمایا کہ ابھی تو میں تبوک جا رہا ہوں، واپسی پر اگر اللہ تعالیٰ نے چاہا تو میں وہاں آکر نماز پڑھ لوں گا۔ لیکن جب آپ تبوک سے واپس تشریف لائے تو مدینہ منورہ سے کچھ پہلے ذو اوان کے مقام پر یہ آیتیں نازل ہوئیں جن میں آپ پر اس نام نہاد مسجد کی حقیقت کھول دی گئی۔ اور اس میں نماز پڑھنے سے منع فرما دیا گیا۔ اس موقع پر آپ نے وہیں سے دو صحابیوں مالک بن دخشم اور معن بن عدی ؓ کو بھیجا کہ وہ اس عمارت کو تباہ کردیں، چنانچہ ان حضرات نے اس کو جلا کر خاک کردیا۔ (تفسیر ابن جریر)","translation":"اور کچھ وہ لوگ ہیں جنہوں نے ایک مسجد اس کام کے لیے بنائی ہے کہ (مسلمانوں کو) نقصان پہنچائیں، کافرانہ باتیں کریں، مومنوں میں پھوٹ ڈالیں اور اس شخص کو ایک اڈہ فراہم کریں جس کی پہلے سے اللہ اور اس کے رسول کے ساتھ جنگ ہے۔ (82) اور یہ قسمیں ضرور کھا لیں گے کہ بھلائی کے سوا ہماری کوئی اور نیت نہیں ہے، لیکن اللہ اس بات کی گواہی دیتا ہے کہ وہ قطعی جھوٹے ہیں۔"}