{"tafsir":"86: قرآن کریم نے یہاں جو لفظ استعمال کیا ہے وہ السائحون ہے اس لفظ کے اصل معنی تو سیاحت کرنے والے کے ہیں۔ لیکن آنحضرت ﷺ نے اس کی تفسیر روزہ رکھنے سے فرمائی ہے اور یہی تفسیر متعدد صحابہ اور تابعین سے بھی منقول ہے (تفسیر ابن جریر) بظاہر روزے کو سیاحت اس لیے فرمایا گیا ہے کہ جس طرح سفر میں انسان کے کھانے پینے اور سونے جاگنے کے معمولات قائم نہیں رہتے، اسی طرح روزے میں بھی ان معمولات میں فرق آجاتا ہے۔ واللہ اعلم۔\n 87: قرآن کریم نے بہت سے مواقع پر ”اللہ کی قائم کی ہوئی حدود“ اور ان کی حفاظت کا ذکر فرمایا ہے۔ یہ بڑی معنی خیز اصطلاح ہے۔ اور اس کا پس منظر یہ ہے کہ اللہ تعالیٰ نے جتنے احکام دئیے ہیں۔ وہ کچھ حدود کے پابند ہیں۔ ان حدود میں رہ کر ان کو انجام دیا جائے تو وہ درست اور نیک کام ہیں۔ اور اگر حدود سے نکل جائیں تو وہی کام ناپسندیدہ اور بعض اوقات گناہ میں تبدیل ہوجاتے ہیں۔ مثلاً اللہ تعالیٰ کی عبادت بہت ثواب کا کام ہے، لیکن اگر کوئی شخص عبادت میں اتنا منہمک ہوجائے کہ اللہ تعالیٰ نے بندوں کے جو حقوق رکھے ہیں، ان کو پامال کرنے لگے، تو وہ عبادت بھی ناجائز ہوجاتی ہے۔ تہجد کی نماز بڑی عظیم فضیلت کی چیز ہے، لیکن اگر کوئی شخص یہ نمازیں اس طرح پڑھے جس سے سونے والوں کی نیند میں خلل آئے تو یہ ناجائز ہے۔ والدین کی خدمت سے بڑھ کر کوئی نفلی عبادت نہیں ہے، لیکن اگر کوئی شخص اس کی وجہ سے بیوی بچوں کے حقوق پامال کرنے لگے تو یہ گناہ ہے۔ غالباً یہی وجہ ہے کہ اس آیت کریمہ میں بہت سی نیکیوں کا بیان کرنے کے بعد آخر میں حدود کی حفاظت کا ذکر فرمایا گیا ہے۔ کہ یہ حضرت تمام نیکیاں ان حدود میں رہ کر انجام دیتے ہیں جو ان کاموں کے لیے اللہ تعالیٰ نے مقرر کر رکھی ہیں۔ ان حدود کی تعلیم آنحضرت ﷺ نے اپنے قول اور فعل سے دی ہے اور ان کو سیکھنے کا بہترین طریقہ اس کے سوا کوئی اور نہیں ہے کہ انسان کسی اللہ والے کی صحبت میں رہے، اور اس کے طرز عمل کو دیکھ دیکھ کر ان حدود کو سمجھنے اور اپنی زندگی میں ان کو اتارنے کی کوشش کرے۔","translation":"(جنہوں نے یہ کامیاب سودا کیا ہے وہ کون ہیں ؟) توبہ کرنے والے ! اللہ کی بندگی کرنے والے ! اس کی حمد کرنے والے ! روزے رکھنے والے ! (86) رکوع میں جھکنے والے ! سجدے گزرنے والے ! نیکی کی تلقین کرنے والے، اور برائی سے روکنے والے، اور اللہ کی قائم کی ہوئی حدوں کی حفاظت کرنے والے، (87) (اے پیغمبر) ایسے مومنوں کو خوشخبری دے دو۔"}