{"text":"25: اس سے اوپر کی اٹھائیس آیات عرب کے بت پرستوں کے بارے میں تھیں۔ اور یہاں سے وہ آیات شروع ہورہی ہیں جو غزوہ تبوک کے بارے میں نازل ہوئی ہیں (الدر المثور بحوالہ مجاہد ج :4 ص : 153) اس کا مطلب یہ ہے کہ یہ آیتیں اوپر کی اٹھائیس آیتوں سے پہلے نازل ہوئی تھیں۔ کیونکہ غزوہ تبوک اعلان براءت سے پہلے پیش آیا ہے اور اس کا واقعہ انشاء اللہ آگے قدرے تفصیل کے ساتھ آئے گا۔ چونکہ یہ غزوہ روم کی سلطنت کے ماتحت زندگی گزار رہی تھی۔ اور دونوں کو قرآن کریم نے اہل کتاب کا نام دیا ہے، اس لیے ان سے جنگ کرنے کا حکم دینے کے ساتھ ان کے عقائد اور اعمال کی کچھ خرابیاں ان آیات میں بیان فرمائی گئی ہیں۔ یہاں یہ بات بھی قابل ذکر ہے کہ اگرچہ ان آیات کا نزول شروع کی اٹھائیس آیتوں سے پہلے ہوا تھا۔ مگر ان کو موجودہ ترتیب میں ان اٹھائیس آیتوں کے بعد رکھا گیا ہے۔ شاید اس میں یہ اشارہ ہے کہ جزیرہ عرب کے بت پرستی سے پاک ہونے کے بعد مسلمانوں کو باہر کے اہل کتاب سے سابقہ پیش آنے والا ہے۔ نیز بت پرستوں کے لیے تو جزیرہ عرب میں مستقل رہائش ممنوع کردی گئی تھی۔ لیکن اہل کتاب کے لیے یہ گنجائش رکھی گئی تھی کہ وہ اسلامی ریاست کے غیر مسلم شہری کی حیثیت میں جزیہ ادا کر کے رہ سکتے ہیں۔ یہ رعایت آنحضرت ﷺ کی حیات طیبہ میں تو برقرار رہی، لیکن آپ نے وفات سے پہلے یہ وصیت فرمائی تھی کہ یہود اور نصاریٰ کو جزیرہ عرب سے نکال دو (صحیح بخاری، کتاب الجہاد، حدیث نمبر 3053) چنانچہ بعد میں حضرت عمر ؓ نے اس وصیت پر عمل فرمایا۔ لیکن یہ حکم صرف جزیرہ عرب کے ساتھ مخصوص تھا۔ جزیرہ عرب کے باہر جہاں کہیں اسلامی حکومت قائم ہو، وہاں اب بھی نہ صرف اہل کتاب، بلکہ دوسرے تمام غیر مسلم اسلامی ریاست کے شہری کی حیثیت سے رہ سکتے ہیں، جہاں انہیں اپنے مذہب پر عمل کی آزادی ہے۔ بشرطیکہ وہ ملکی قوانین کی پابندی کریں۔ یہاں اگرچہ ذکر صرف اہل کتاب کا ہے، لیکن جو وہ بیان کی گئی ہے کہ وہ دین حق کو اپنا دین نہیں بناتے، وہ چونکہ تمام غیر مسلموں میں پائی جاتی ہے، اس لیے جزیر عرب سے باہر یہ حکم باجماع امت تمام غیر مسلموں کو شامل ہے۔ واللہ سبحانہ اعلم۔\n 26: بظاہر تو اہل کتاب اللہ پر ایمان رکھنے کا دعویٰ کرتے تھے، لیکن چونکہ انہوں نے اس ایمان کے ساتھ اللہ تعالیٰ کے بارے میں بہت سے غلط عقائد گھڑ رکھے تھے، جن میں سے بعض کا بیان اگلی آیت میں آرہا ہے، اس لیے ان کا یہ ایمان کالعدم قرار دے کر یہ فرمایا گیا کہ وہ اللہ پر ایمان نہیں رکھتے۔\n 27: ”جزیہ“ ایک ٹیکس ہے جو مسلمان ریاست کے ان غیر مسلم شہریوں سے لیا جاتا ہے جو لڑنے کی صلاحیت رکھتے ہوں، چنانچہ عورتوں، بچوں، بوڑھوں اور تارک الدنیا مذہبی پیشواؤں سے جزیہ نہیں لیا جاتا۔ یہ درحقیقت ان کے پر امن طریقے سے اسلامی ریاست میں رہنے اور اسلامی ریاست کے دفاع میں شریک نہ ہونے کا ٹیکس ہے جس کے عوض اسلامی حکومت ان کی جان ومال کی ذمہ داری لیتی ہے (روح المعانی)۔ اس کی ایک حکمت یہ بھی ہے کہ غیر مسلموں سے مسلمانوں کی طرح زکوٰۃ وصول نہیں کی جاتی، لیکن وہ ریاست کے تمام شہری حقوق میں برابر کے شریک ہوتے ہیں اس لیے بھی ان پر یہ خاص نوعیت کا ٹیکس عائد کیا گیا ہے۔ اور احادیث میں مسلمان حکمرانوں کو یہ تاکید کی گئی ہے کہ وہ غیر مسلم باشندوں کے حقوق کا پورا خیال رکھیں اور ان پر اتنا ٹیکس عائد نہ کریں جو ان کی طاقت سے زیادہ ہو۔ چنانچہ اسلامی تاریخ کے تقریبا ہر دور میں جزیہ کی شرح بہت معمولی رہی ہے۔ اور آیت کریمہ میں جو یہ فرمایا گیا ہے کہ : وہ خوار ہو کر اپنے ہاتھ سے جزیہ ادا کریں۔ اس کی تفسیر امام شافعی ؒ سے یہ منقول ہے کہ وہ اسلامی ریاست کے قوانین کے تابع ہو کر رہنا منظور کرلیں (روح المعانی ج 10 ص 379)"}