{"text":"36: یہاں سے غزوہ تبوک کے مختلف پہلووں کا بیان شروع ہورہا ہے جو اس سورت کے تقریبا آخر تک چلا گیا ہے اس غزوے کا واقعہ مختصراً یہ ہے کہ جب آنحضرت ﷺ فتح مکہ اور غزوہ حنین کے سفر سے واپس مدینہ منورہ تشریف لائے تو کچھ عرصہ بعد شام سے آنے والے کچھ سودا گروں نے مسلمانوں کو بتایا کہ رومی سلطنت کا بادشاہ ہرقل مدینہ منورہ پر ایک زور دار حملہ کرنے کی تیاریاں کر رہا ہے۔ جس کے لیے اس نے ایک بڑا لشکر شام اور عرب کی سرحد پر جمع کرلیا ہے، اور اپنے فوجیوں کو سال بھر کی تنخواہ پیشگی دے دی ہے۔ صحابہ کرام اگرچہ اب تک بہت سی جنگیں لڑ چکے تھے، مگر وہ سب جزیرہ عرب کے اندر تھیں، یہ پہلا موقع تھا کہ دنیا کی مانی ہوئی ایک بڑی طاقت سے مقابلہ پیش آرہا تھا۔ لیکن آنحضرت ﷺ نے فیصلہ فرمایا کہ ہرقل کے حملے کا انتظار کیے بغیر خود پیش قدمی کی جائے، اور خود وہاں پہنچ کر مقابلہ کیا جائے۔ چنانچہ آپ نے مدینہ منورہ کے تمام مسلمانوں کو اس جنگ میں شریک ہونے کے لیے تیاری کا حکم دیا۔ مسلمانوں کے لیے یہ بہت بڑی آزمائش تھی۔ اول تو دس سال کی متواتر جنگوں کے بعد یہ پہلا موقع تھا کہ فتح مکہ کے بعد سکون کے کچھ لمحات میسر آئے تھے۔ دوسرے جس وقت اس جنگ کے لیے روانہ ہونا تھا۔ وہ ایسا وقت تھا کہ مدینہ منورہ کے نخلستانوں میں کھجوریں پک رہی تھیں۔ انہی کھجوروں پر اہل مدینہ کی سال بھر کی معیشت کا دار و مدار تھا۔ ایسی حالت میں باغات کو چھوڑ کر جانا نہایت مشکل تھا۔ تیسرے یہ عرب میں گرمی کا سخت ترین موسم تھا جس میں آسمان سے آگ برستی اور زمین سے شعلے نکلتے محسوس ہوتے ہیں۔ چوتھے تبوک کا سفر بہت لمبا تھا، اور تقریبا آٹھ سو میل کا یہ پورا راستہ لق ودق صحراؤں پر مشتمل تھا۔ پانچویں سفر کے لیے سواریاں کم تھیں۔ چھٹے اس سفر کا مقصد رومی سلطنت سے ٹکر لینا تھا جو اس وقت نہ صرف یہ کہ دنیا کی سب سے بڑی طاقت تھی، بلکہ اس کے طریقہ جنگ سے بھی اہل عرب پوری طرح مانوس نہیں تھے۔ غرض ہر اعتبار سے یہ انتہائی مشقت، جان و مال اور جذبات کی قربانی کا جہاد تھا جس کے لیے آنحضرت ﷺ تیس ہزار صحابہ کرام کے لشکر کے ساتھ تبوک روانہ ہوئے۔ اللہ تعالیٰ نے ہرقل اور اس کے لشکر پر آپ کی اس جرأت مندانہ پیش قدمی کا ایسا رعب طاری فرما دیا کہ وہ سب واپس چلے گئے اور مقابلے کی نوبت ہی نہیں آئی۔ مذکورہ بالا مشکل حالات کے باوجود صحابہ کرام کی بھاری اکثریت ماتھے پر بل لائے بغیر جاں نثاری کے جذبے سے اس مہم میں شریک ہوئی۔ البتہ کچھ صحابہ ایسے بھی تھے جنہیں یہ سفر بھاری معلوم ہوا، اور شروع میں انہیں کچھ تردد رہا، لیکن آخر کار وہ لشکر میں شامل ہوگئے۔ اور چند ایسے بھی تھے جو اس تردد کی وجہ سے آخر تک فیصلہ نہ کرسکے، اور سفر میں شرکت سے محروم رہے۔ دوسری طرف وہ منافقین تھے جو ظاہری طور پر تو مسلمان ہوگئے تھے لیکن اندر سے مسلمان نہیں تھے۔ ایسی سخت مہم میں مسلمانوں کا ساتھ دینا ان کے لیے ممکن ہی نہیں تھا، اس لیے وہ مختلف حیلوں بہانوں سے مدینہ منورہ میں رک گئے اور ساتھ نہیں گئے۔ اس سورت کی آنے والی آیات میں ان سب قسم کے لوگوں کا ذکر آیا ہے، اور ان کے طرز عممل پر تبصرہ فرمایا گیا ہے۔ آیت نمبر 38 میں جن لوگوں کو ملامت کی گئی ہے ان سے مراد منافقین بھی ہوسکتے ہیں۔ اس صورت میں ”اے لوگو ! جو ایمان لائے ہو“ ان کے ظاہری دعوی کے مطابق فرمایا گیا ہے اور یہ بھی ممکن ہے کہ یہ خطاب ان صحابہ کرام سے ہو جن کے دل میں تردد پیدا ہوا تھا۔ البتہ آیت نمبر 42 سے تمام تر بیان منافقین ہی کا ہے۔"}