{"tafsir":"48: فقیر اور مسکین ملتے جلتے لفظ ہیں۔ لغت کے اعتبار سے بعض لوگوں نے دونوں میں یہ فرق بیان کیا ہے کہ مسکین وہ ہے جس کے پاس کچھ نہ ہو۔ اور فقیر وہ ہے جس کے پاس کچھ ہو، مگر ضرورت سے کم ہو۔ اور بعض حضرات نے فرق اس کے برعکس بیان کیا ہے۔ لیکن زکوٰۃ کے حکم میں دونوں برابر ہیں۔ اور حکم یہ ہے کہ جس شخص کے پاس ساڑھے باون تولہ چاندی یا اس کی قیمت کا بنیادی ضرورت سے زیادہ سامان موجود نہ ہو، اس کے لیے زکوٰۃ لینا جائز ہے۔ تفصیل کے لیے فقہ کی کتابیں دیکھی جائیں۔\n 49: اسلامی حکومت کا ایک اہم کام یہ ہے کہ وہ مسلمانوں کے اموال ظاہرہ کی زکوٰۃ جمع کر کے مستحقین میں تقسیم کرے۔ اس غرض کے لیے جو اہل کار مقرر کیے جائیں، ان کی تنخواہ یا وظیفہ بھی زکوٰۃ سے دیا جاسکتا ہے۔\n 50: اس سے مراد وہ نو مسلم ہیں جو ضرورت مند ہوں، اور اس بات کی ضرورت محسوس کی جائے کہ ان کو اسلام پر جمے رکھنے کے لیے ان کی دلداری کی جانی چاہیے۔ اصطلاح میں ایسے لوگوں کو مؤلفۃ القلوب کہا جاتا ہے۔\n 51: جس زمانے میں غلامی کا رواج تھا اس دور میں بعض غلاموں کے آقا ان سے یہ کہہ دیتے تھے کہ اگر تم اتنی رقم لا کر ہمیں دے دو تو تم آزاد ہو۔ ایسے غلاموں کو بھی آزادی حاصل کرنے کے لیے زکوٰۃ کا مال دیا جاسکتا تھا۔\n 52: اس سے مراد وہ مقروض لوگ ہیں جن پر اتنا قرضہ ہو کہ ان کے اثاثے قرضے کی ادائیگی کے لیے کافی نہ ہوں، یا اگر وہ اپنے سارے اثاثے قرض میں دے دیں تو ان کے پاس نصاب، یعنی ساڑھے باون تولہ چاندی کے برابر مال باقی نہ رہے۔\n 53: اللہ کے راستے، کا لفظ قرآن کریم میں اکثر جہاد کے لیے استعمال ہوا ہے لہذا اس سے مراد وہ شخص ہے جو جہاد پر جانا چاہتا ہو۔ لیکن اس کے پاس سواری وغیرہ نہ ہو۔ بعض دوسرے حاجت مند لوگوں کو بھی فقہاء نے اس حکم میں شامل کیا ہے۔ مثلاً جس شخص پر حج فرض ہوچکا ہو۔ لیکن اب اس کے پاس اتنے پیسے نہ رہے ہوں کہ وہ حج کرسکے۔\n 54: مسافر، سے مراد وہ شخص ہے جس کے پاس چاہے اپنے وطن میں نصاب کے برابر مال موجود ہو، لیکن سفر میں اس کے پاس اتنے پیسے نہ رہے ہوں جن سے وہ اپنی سفر کی ضروریات پوری کر کے واپس وطن جاسکے۔ واضح رہے کہ زکوٰۃ کے یہ آٹھ مصارف جو یہاں قرآن کریم نے ذکر کیے ہیں۔ ان کی بہت مختصر تشریح اوپر کی گئی ہے۔ عمل کے وقت کسی عالم سے سمجھ کر زکوٰۃ خرچ کرنی چاہیے۔ کیونکہ ان تمام مصارف میں شرعی احکام کی تفصیلات ہیں جن کے ذکر کا یہاں موقع نہیں ہے۔","translation":"صدقات تو دراصل حق ہے فقیروں کا، مسکینوں کا (48) اور ان اہلکاروں کا جو صدقات کی وصولی پر مقرر ہوتے ہیں۔ (49) اور ان کا جن کی دلداری مقصود ہے۔ (50) نیز انہیں غلاموں کو آزاد کرنے میں (51) اور قرض داروں کے قرضے ادا کرنے میں (52) اور اللہ کے راستے میں (53) اور مسافروں کی مدد میں (54) خرچ کیا جائے۔ یہ ایک فریضہ ہے اللہ کی طرف سے اور اللہ علم کا بھی مالک ہے، حکمت کا بھی مالک۔"}