{"tafsir":"7: آیت نمبر 7 سے لے کر آیت نمبر 16 تک اتنی بات تو واضح ہے کہ اس میں کفار قریش کا ذکر ہے، اور ان کی بد عہدی کا ذکر کیا گیا ہے اور مسلمانوں کو تاکید کی گئی ہے کہ ان کے قول وقرار پر بھروسہ نہ کریں، اور اگر وہ بد عہدی کریں تو ان کے ساتھ جنگ کی جائے۔ لیکن اس معاملے میں مفسرین کی آراء مختلف ہیں کہ یہ آیات کب نازل ہوئی تھیں۔ مفسرین کی ایک جماعت کا کہنا ہے کہ یہ آیتیں فتح مکہ سے پہلے اس وقت نازل ہوئی تھیں جب کفار قریش کے ساتھ مسلمانوں نے حدیبیہ میں جو معاہدہ کیا تھا وہ باقی تھا۔ اور ان آیتوں میں یہ پیشینگوئی کی گئی ہے کہ یہ لوگ اپنے معاہدے پر قائم نہیں رہیں گے لہذا اگر وہ عہد شکنی کریں تو ان کے ساتھ جنگ کرو اور اگر وہ دوبارہ عہد کریں تو اب ان کی باتوں کا اعتبار نہ کیا جائے۔ کیونکہ وہ زبان سے کچھ کہتے ہیں اور ان کے دل میں کچھ اور ہوتا ہے اور جب تم ان سے جنگ کرو گے تو اللہ تعالیٰ تمہاری مدد کرکے انہیں رسوا کرے گا اور ان مسلمانوں کے دل ٹھنڈے ہوں گے جو ان کے مظالم کا شکار رہے ہیں۔ اس تفسیر کے مطابق یہ آیتیں براءت کے اس اعلان سے پہلے کی ہیں جو آیت نمبر 1 سے آیت نمبر 6 تک بیان کیا گیا ہے، اور جو فتح مکہ کے ایک سال دو ماہ کے بعد سن 9 ھ کے حج کے موقع پر کیا گیا تھا۔\n مفسرین کی دوسری جماعت کا کہنا یہ ہے کہ یہ آیتیں براءت کے اعلان سے پہلے کی نہیں ہیں۔ بلکہ آیت نمبر 1 سے براءت کے اعلان کا جو مضمون چلا آرہا ہے یہ اسی کا حصہ ہیں اور ان میں براءت کے اعلان کی وجہ بیان کی گئی ہے کہ یہ لوگ پہلے ہی معاہدہ توڑ چکے ہیں۔ اور اب ان سے کوئی امید نہیں ہے کہ اگر ان سے کوئی نیا معاہدہ کریں تو اس کی پابندی کریں گے۔ کیونکہ ان مسلمانوں سے جو دشمنی ہے اس کی وجہ سے یہ نہ کسی رشتہ داری کا لحاظ کرتے ہیں، نہ کسی معاہدے کا۔ چونکہ فتح مکہ کے موقع پر اور اس کے بعد قریش کے بہت سے لوگ نئے نئے مسلمان ہوئے تھے اور ان کی کفار قریش کے ساتھ رشتہ داریاں تھیں اس لیے ان کے دل میں قریش کے بارے میں کوئی نرم گوشہ ہوسکتا تھا۔ ان آیات نے انہیں متنبہ کیا ہے کہ وہ ان لوگون کی باتوں سے دھوکا نہ کھائیں۔ اور دل میں یہ عزم رکھیں کہ اگر ان سے لڑنا پڑا تو وہ پوری قوت سے ان کا مقابلہ کریں گے۔ راقم کو یہ تفسیر دلائل کی وجہ سے زیادہ راجح معلوم ہوتی ہے۔ اول تو اس لیے کہ آیت نمبر 7 سے 16 تک کا نظم قرآن ایک ہی سلسلہ کلام نظر آتا ہے اور آیت نمبر 7 کے بارے میں یہ تصور نظم کے اعتبار سے مشکل لگتا ہے کہ وہ پہلی چھ آیتوں سے نزول میں بہت مقدم ہو۔ دوسرے حضرت علی نے اعلان کے وقت قرآن کریم کی جو آیات لوگوں کو سنائیں۔ ان کی تعداد روایات میں کم سے کم دس اور زیادہ سے زیادہ چالیس آئی ہے۔ (دیکھئے الدر المنثور ج :4 ص :112 و نظم الدرر للبقاعی ج : 8 ص 366) اور نسائی (کتاب الحج، باب الخطبۃ یوم الترویہ حدیث نمبر 2993) کی ایک روایت میں جو یہ آیا ہے کہ انہوں نے اسے ختم تک پڑھا، اس کا مطلب یہ ہے کہ جتنی آیات دے کر انہیں بھیجا گیا تھا ان کے ختم تک پڑھا۔ تیسرے حافظ ابن جریر طبری، علامہ سیوطی، علامہ بقاعی، قاضی ابو السعود اور بڑے جلیل القدر محدثین اور مفسرین نے ان آیات کو براءت ہی کا ایک حصہ اور اس کی توجیہ و تعلیل قرار دیا ہے۔\n 8: اس سے مراد مشرکین وہ چوتھی قسم ہے جس کا ذکر اوپر حاشیہ نمبر 1 (د) میں آیا ہے ان کو ان کے معاہدے کی مدت پوری ہونے تک مہلت دی گئی تھی۔ اور روایات سے معلوم ہوتا ہے کہ مدت میں اس وقت نو مہینے باقی تھے اور مطلب یہ ہے کہ اس مدت کے دوران اگر وہ سیدھے چلتے رہیں تو تم بھی ان کے ساتھ سیدھے چلو اور اگر وہ بھی عہد شکنی کریں تو پھر اس مدت کے انتظار کی بھی ضرورت نہیں ہے (تفسیر ابن جریر ج 10 ص 82)","translation":"ان مشرکین سے اللہ اور اس کے رسول کے ساتھ کوئی معاہدہ کیسے باقی رہ سکتا ہے ؟ (7) البتہ جن لوگوں سے تم نے مسجد حرام کے قریب معاہدہ کیا ہے، جب تک وہ تمہارے ساتھ سیدھے رہیں، تم بھی ان کے ساتھ سیدھے رہو۔ (8) بیشک اللہ متقی لوگوں کو پسند کرتا ہے۔"}