{"tafsir":"62: منافقین کا یہ وطیرہ تھا کہ وہ اپنی مجلسوں میں کافرانہ باتیں کہتے رہتے تھے لیکن جب ان سے پوچھا جاتا تو وہ صاف انکار کردیتے اور قسم کھالیتے کہ ہم نے یہ بات نہیں کہی، مثلاً ایک مرتبہ منافقین کے سردار عبداللہ بن ابی نے آنحضرت ﷺ اور مسلمانوں کے بارے میں ایک انتہائی گستاخانہ بات کہی تھی جسے نقل کرنا بھی مشکل ہے اور اس کے بعد کہا کہ جب ہم مدینہ پہنچیں گے تو ہم میں سے باعزت لوگ ذلیلوں کو نکال باہر کریں گے، اس کا ذکر خود قرآن کریم نے سورة منافقون (28) میں فرمایا ہے، لیکن جب اس سے پوچھا گیا تو مکر گیا اور قسمیں کھانے لگا کہ میں نے یہ نہیں کہا تھا (روح المعانی بحوالہ ابن جریر ابن المنذر وغیرہ)۔\n 63: مراد یہ ہے کہ اگرچہ دل سے تو وہ کبھی اسلام نہیں لائے تھے، لیکن کم از کم زبان سے اسلام کا اقرار کرتے تھے۔ اس بات کے بعد انہوں نے زبان سے بھی کفر اختیار کرلیا۔\n 64: یہ کسی ایسے واقعے کی طرف اشارہ ہے جس میں منافقین نے کوئی خفیہ سازش کی تھی مگر اس میں کامیاب نہیں ہوسکے۔ ایسے کئی واقعات عہد رسالت میں پیش آئے ہیں، مثلا ایک واقعہ تو اوپر بیان کیا گیا ہے کہ عبداللہ بن ابی نے یہ ناپاک ارادہ ظاہر کیا تھا کہ ہم مسلمانوں کو مدینہ منورہ سے نکال دیں گے۔ ظاہر ہے کہ وہ اپنی اس ڈینگ کو عملی جامہ پہنانے پر قادر نہیں ہوئے۔ دوسرے ایک واقعہ غزوہ تبوک سے آنحضرت ﷺ کی واپسی کے وقت پیش آیا تھا کہ منافقین نے بارہ آدمیوں کو نقاب پہنا کر اس بات پر تعینات کیا تھا کہ وہ ایک گھاٹی میں چھپ کر بیٹھیں، اور جب آنحضرت ﷺ وہاں سے گذریں تو آپ پر حملہ کردیں۔ اس وقت حضرت حذیفہ بن یمان نے انہیں دیکھ لیا، اور آنحضرت ﷺ کو اطلاع کردی۔ آپ نے ان کو زور سے آواز دی تو ان پر ایسا رعب طاری ہوا کہ وہ بھاگ گئے۔ آپ نے بعد میں حضرت حذیفہ کو بتایا کہ وہ منافق لوگ تھے (روح المعانی بحوالہ دلائل النبوۃ بیہقی)\n 65: آنحضرت ﷺ کی تشریف آوری سے مدینہ منورہ کے باشندوں میں پہلے کے مقابلے میں عام خوش حالی آئی تھی جس سے یہ منافقین بھی فائدہ اٹھا رہے تھے۔ پہلے ان کی معاشی حالت خستہ تھی۔ مگر آپ کی تشریف آوری کے بعد ان میں سے اکثر لوگ خاصے مال دار ہوگئے تھے۔ آیت کریمہ یہ کہہ رہی ہے کہ شرافت کا تقاضا تو یہ تھا کہ وہ اس خوشحالی پر اللہ تعالیٰ اور رسول کریم ﷺ کے شکر گزار ہوتے لیکن انہوں نے اس احسان کا بدلہ یہ دیا کہ آپ کے خلاف سازشیں شروع کرو۔","translation":"یہ لوگ اللہ کی قسمیں کھا جاتے ہیں کہ انہوں نے فلاں بات نہیں کہی، حالانکہ انہوں نے کفر کی بات کہی ہے، (62) اور اپنے اسلام لانے کے بعد انہوں نے کفر اختیار کیا ہے۔ (63) انہوں نے وہ کام کرنے کا ارادہ کرلیا تھا جس میں یہ کامیابی حاصل نہ کرسکے۔ (64) اور انہوں نے صرف اس بات کا بدلہ دیا کہ اللہ اور اس کے رسول نے انہیں اپنے فضل سے مال دار بنادیا ہے۔ (65) اب اگر یہ توبہ کرلیں تو ان کے حق میں بہتر ہوگا، اور اگر یہ منہ موڑیں گے تو اللہ ان کو دنیا اور آخرت میں دردناک عذاب دے گا، اور روئے زمین پر ان کا نہ کوئی یار ہوگا نہ مددگار۔"}