{"tafsir":"51: سورة انفال کی ان آخری آیات میں میراث کے کچھ وہ احکام بیان فرمائے گئے ہیں جو مسلمانوں کی مکہ مکرمہ سے ہجرت کے نتیجے میں پیدا ہوئے تھے، اللہ تعالیٰ نے یہ اصول شروع سے طے فرمادیا تھا کہ مسلمان اور کافر آپس میں ایک دوسرے کے وراث نہیں ہوسکتے، اب صورت حال یہ تھی کہ جو صحابہ کرام مکہ مکرمہ سے ہجرت کرکے مدینہ منورہ آگئے تھے، ان میں سے بہت سے ایسے تھے کہ ان کے رشتہ دار جو ان کے وارث ہوسکتے تھے، سب مکہ مکرمہ میں رہ گئے تھے، ان میں سے اکثر وہ تھے جو کافر تھے اور مسلمان ہی نہیں ہوئے تھے، وہ مسلمانوں کے اس لئے وارث نہیں ہوسکتے تھے کہ ان کے درمیان کفر اور ایمان کا فاصلہ حائل تھا ؛ چنانچہ ان آیات نے واضح طور پر بتادیا کہ وہ نہ مسلمانوں کے وارث ہوسکتے ہیں اور نہ مسلمان ان کے وارث ہوسکتے ہیں اور مہاجرین کے کچھ ایسے رشتہ دار بھی تھے جو مسلمان تو ہوگئے تھے ؛ لیکن انہوں نے مدینہ منورہ کی طرف ہجرت نہیں کی تھی، ان کے بارے میں بھی اس آیت نے یہ حکم دیا ہے کہ مہاجر مسلمانوں کا ان سے بھی وراثت کا کوئی رشتہ نہیں ہوسکتا اس کی ایک وجہ یہ تھی کہ اس وقت تمام مسلمانوں کے ذمے فرض تھا کہ وہ مکہ مکرمہ سے ہجرت کریں، اور انہوں نے ہجرت نہ کرکے اس فریضے کو ابھی تک ادا نہیں کیا تھا اور دوسری وجہ یہ تھی کہ مہاجر مسلمان مدینہ منورہ میں تھے جو دارالاسلام تھا، اور وہ حضرات مکہ مکرمہ میں تھے جو اس وقت دارالحرب تھا، اور دونوں کے درمیان بڑی رکاوٹیں حائل تھیں، بہر صورت مہاجر مسلمانوں کے جو رشتہ دار مکہ مکرمہ میں رہ گئے تھے، چاہے وہ مسلمان ہوں یا غیر مسلم ان کے ساتھ مہاجرین کا وراثت کا رشتہ ٹوٹ چکا تھا، جس کا نتیجہ یہ تھا کہ اگر ان کا کوئی رشتہ دار مکہ مکرمہ میں فوت ہوتا تو اس کے ترکے میں ان مہاجرین کا کوئی حصہ نہیں ہوتا تھا اور اگر ان مہاجرین میں سے کوئی مدینہ منورہ میں فوت ہوتا تو اس کی میراث میں اس کے مکی رشتہ داروں کا کوئی حصہ نہیں ہوتا تھا، دوسری طرف جو مہاجرین مدینہ منورہ آکر آباد ہوئے تھے ان کو انصار مدینہ نے اپنے گھروں میں ٹھہرایا تھا، آنحضرت ﷺ نے ہر مہاجر صحابی کا کسی انصاری صحابی سے بھائی چارہ قائم کردیا تھا جسے مؤاخات کہا جاتا ہے، اس آیت کریمہ نے یہ حکم دیا کہ اب مہاجرین کے وارث ان کے مکی رشتہ داروں کے بجائے وہ انصاری صحابہ کرام ہوں گے جن کے ساتھ ان کی مؤاخات قائم کی گئی ہے۔\n 52:: یعنی جن مسلمانوں نے ابھی تک ہجرت نہیں کی، اگرچہ وہ مہاجرین کے وارث نہیں ہیں، لیکن چونکہ بہر حال مسلمان ہیں، اس لئے اگر کافروں کے خلاف مسلمانوں سے کوئی مدد مانگیں تو مہاجر مسلمانوں پر واجب ہے کہ ان کی مدد کریں، البتہ ایک صورت ایسی بیان کی گئی ہے جس میں اس طرح کی مدد کرنا مہاجر مسلمانوں کے لئے جائز نہیں ہے، اور وہ یہ کہ جن کافروں کے خلاف وہ مدد مانگ رہے ہیں ان سے مہاجر مسلمانوں کا کوئی جنگ بندی کا معاہدہ ہوچکا ہو، ایسی صورت میں اگر وہ اپنے مسلمان بھائیوں کا ساتھ دیتے ہوئے ان کے خلاف کوئی کاروائی کریں تو یہ بد عہدی ہوگی، اس لئے ایسی مدد کو ناجائز قرار دیا گیا ہے، اس سے زیادہ اندازہ لگایا جاسکتا ہے کہ غیر مسلموں کے ساتھ جب کوئی معاہدہ ہوجائے تو اپنے مسلمان بھائیوں کی مدد کے لئے بھی اس کی خلاف ورزی کو اسلام نے جائز نہیں رکھا ؛ چنانچہ صلح حدیبیہ کے موقع پر کئی واقعات ایسے پیش آئے کہ کفار کے ہاتھوں پسے ہوئے مسلمانوں نے آنحضرت ﷺ سے کفار قریش کے خلاف مدد مانگی اور مسلمانوں کا دل بےتاب تھا کہ انکی مدد کریں، مگر چونکہ قریش کے لوگوں سے معاہدہ ہوچکا تھا، اس لئے ان کے صبر وضبط کا بہت کڑا امتحان پیش آیا، اور آنحضرت ﷺ کے حکم کے تحت وہ اس امتحان میں ثابت قدم رہے۔","translation":"جو لوگ ایمان لائے ہیں اور انہوں نے ہجرت کی ہے اور اپنے مالوں اور جانوں سے اللہ کے راستے میں جہاد کیا ہے، وہ اور جنہوں نے ان کو (مدینہ میں) آباد کیا اور ان کی مدد کی، یہ سب لوگ آپس میں ایک دوسرے کے ولی وارث ہیں۔ اور جو لوگ ایمان لے آئے ہیں، (مگر) انہوں نے ہجرت نہیں کی، جب تک وہ ہجرت نہ کرلیں (اے مسلمانو) تمہارا ان سے وراثت کا کوئی رشتہ نہیں ہے۔ (51) ہاں اگر دین کی وجہ سے وہ تم سے کوئی مدد مانگیں تو تم پر ان کی مدد واجب ہے سوائے اس صورت کے جبکہ وہ مدد کسی ایسی قوم کے خلاف ہو جس کے ساتھ تمہارا کوئی معاہدہ ہے۔ (52) اور جو کچھ تم کرتے ہو اللہ اسے اچھی طرح دیکھتا ہے۔"}