{"text":"13: جب وہ صاحب جن کا نام بعض روایتوں میں ”تملیخا“ بتایا گیا ہے کھانا لینے کے لیے شہر پہنچے، اور دکان دار کو وہ سکہ پیش کیا جو تین سو سال پرانا تھا، اور اس پر پرانے بادشاہ کی علامتیں تھیں وہ دکان دار بڑا حیران ہوا، اور ان کو لے کر اس وقت کے بادشاہ کے پاس پہنچا۔ یہ بادشاہ نیک تھا، اور اس نے یہ قصہ سن رکھا تھا کہ کچھ نوجوان دقیانوس کے ظلم سے تنگ آ کر کہیں غائب ہوگئے تھے۔ اس نے معاملے کی مزید تحقیق کی تو پتہ چل گیا کہ یہ وہی نوجوان ہیں۔ اس پر بادشاہ نے ان کا خوب اکرام کیا، لیکن یہ حضرات دوبارہ اسی غار میں چلے گئے اور وہیں پر اللہ تعالیٰ نے انہیں وفات دے دی۔\n 14: ان اصحاب کہف کا اتنی لمبی مدت تک سوتے رہنا اور پھر زندہ جاگ اٹھنا اللہ تعالیٰ کی قدرت کاملہ کی واضح دلیل تھی، اور اس واقعے کو دیکھ کر ہر شخص بآسانی اس نتیجے تک پہنچ سکتا تھا کہ جو ذات اتنے عرصے تک سونے کے بعد ان نوجوانوں کو زندہ اٹھاسکتی ہے، یقینا وہ اس بات پر بھی قادر ہے کہ تمام انسانوں کو مرنے کے بعد دوبارہ زندہ کردے۔ بعض روایات میں ہے کہ اس وقت کا بادشاہ تو قیامت اور آخرت پر ایمان رکھتا تھا، لیکن کچھ لوگ آخرت کے بارے میں شکوک و شبہات کا اظہار کر رہے تھے، اور بادشاہ نے یہ دعا کی تھی کہ اللہ تعالیٰ ان کو کوئی ایسا واقعہ دکھا دے جس سے آخرت پر ان کا ایمان مضبوط ہوجائے۔ اللہ تعالیٰ نے اسی وقت ان نوجوانوں کو جگا کر اپنی قدرت کا یہ کرشمہ دکھا دیا۔\n 15: جیسا کہ پیچھے عرض کیا گیا، یہ حضرات جاگنے کے بعد جلد ہی اسی غار میں وفات پاگئے تھے۔ اب اللہ تعالیٰ کی قدرت کا یہ کرشمہ سامنے آیا کہ جن نوجوانوں کو کبھی اس شہر میں اپنی جان کے لالے پڑے ہوئے تھے، اب اسی شہر میں ان کی ایسی عزت ہوئی کہ لوگ ان کی یاد گار میں کوئی عمارت بنانے کی فکر میں پڑگئے۔ اور آخر کار جن لوگوں کو اقتدار حاصل تھا، انہوں نے یہ طے کیا کہ جس غار میں ان کی وفات ہوئی ہے اس پر ایک مسجد بنادیں۔ واضح رہے کہ عمان کے پاس جو غار دریافت ہوا ہے اس میں کھدائی کرنے سے غار کے اوپر بنی ہوئی ایک مسجد بھی بر آمد ہوئی ہے۔ یہاں یہ بھی واضح رہنا چاہیے کہ ان کی وفات کی جگہ پر مسجد بنانے کی یہ تجویز اس زمانے کے اصحاب اقتدار نے دی تھی، قرآن کریم نے اس تجویز کی تائید نہیں فرمائی۔ لہذا اس آیت سے مقبرے بنانے یا قبروں کو عبادت گاہ میں تبدیل کرنے کا کوئی جواز نہیں نکلتا۔ بلکہ آنحضرت ﷺ نے کئی احادیث میں اس عمل سے منع فرمایا ہے۔\n 16: روایات سے ایسا معلوم ہوتا ہے کہ جب ان حضرات کی یادگار تعمیر کرنے کی تجویز آئی تو لوگوں نے یہ بھی سوچا کہ ان کے صحیح صحیح نام اور ان کا نسب اور مذہب وغیرہ بھی اس یادگار پر لکھا جائے لیکن چونکہ کسی کو ان کے پورے حالات معلوم نہیں تھے۔ اس لیے پھر لوگوں نے کہا کہ ان کے ٹھیک ٹھیک حالات تو اللہ تعالیٰ ہی بہتر جانتا ہے۔ لیکن ہم ان کے نسب وغیرہ کی تحقیق میں پڑے بغیر ہی ان کی یاد گار بنا دیتے ہیں۔"}