{"tafsir":"33: یہاں سے آیت نمبر 82 تک اللہ تعالیٰ نے حضرت موسیٰ ؑ کا وہ واقعہ بیان فرمایا ہے جو حضرت خضر ؑ کے ساتھ پیش آیا۔ حضور سرور دو عالم ﷺ نے اس واقعے کی تفصیل ایک طویل حدیث میں بیان فرمائی ہے جو صحیح بخاری میں کئی سندوں سے منقول ہے۔ اس حدیث کا خلاصہ یہ ہے کہ ایک مرتبہ حضرت موسیٰ ؑ سے کسی نے یہ سوال کیا کہ اس وقت روئے زمین پر سب سے بڑا عالم کون ہے ؟ چونکہ ہر پیغمبر اپنے وقت میں دین کا سب سے بڑا عالم ہوتا ہے۔ اس لیے حضرت موسیٰ ؑ نے جواب میں یہی فرما دیا ہے کہ میں ہی سب سے بڑا عالم ہوں۔ اللہ تعالیٰ کو یہ بات پسند نہیں آئی اور حضرت موسیٰ ؑ کو یہ ہدایت دی گئی کہ اس سوال کا صحیح جواب یہ تھا کہ اللہ تعالیٰ ہی بہتر جانتے ہیں کہ سب سے بڑا عالم کون ہے۔ نیز اللہ تعالیٰ نے چاہا کہ حضرت موسیٰ ؑ کو علم کے کچھ ایسے گوشوں سے روشناس کرائیں جو ان کی واقفیت کے دائرے سے باہر تھے۔ چنانچہ انہیں حکم دیا کہ وہ حضرت خضر ؑ کے پاس جائیں۔ ان کو پتہ یہ بتایا گیا کہ جہاں دو دریا ملتے ہیں۔ وہاں تک سفر کریں، اور اپنے ساتھ ایک مچھلی لے جائیں۔ ایک موقع ایسا آئے گا کہ وہ مچھلی گم ہوجائے گی۔ بس اسی جگہ انہیں حضرت خضر ؑ مل جائیں گے۔ چنانچہ حضرت موسیٰ ؑ اپنے نوجوان شاگرد حضرت یوشع ؑ کو ساتھ لے کر اس سفر پر روانہ ہوئے۔ جو بعد میں خود پیغمبر بننے والے تھے۔ آگے کا واقعہ خود قرآن کریم میں آرہا ہے۔ البتہ یہاں اتنا سمجھ لینا چاہیے کہ حضرت موسیٰ ؑ کو جو یہ سفر کرایا گیا۔ اس کا ایک مقصد تو یہ ادب سکھانا تھا کہ اپنے آپ کو سب سے بڑا عالم کہنا کسی کو بھی زیب نہیں دیتا۔ علم تو ایک ناپید کنارا سمندر ہے اور کچھ نہیں کہا جاسکتا کہ کونسا علم کس کے پاس زیادہ ہے۔ اور دوسرا مقصد یہ تھا کہ حضرت موسیٰ ؑ خود آنکھوں سے اس بات کی ایک جھلک دیکھ لیں کہ اللہ تعالیٰ اپنی حکمت اور علم سے اس کائنات کا نظام کس طرح چلا رہا ہے۔ اس کائنات میں بہت سے ایسے واقعات روز مرہ انسان کے سامنے آتے رہتے ہیں جن کا مقصد اس کی سمجھ میں نہیں آتا، حالانکہ کوئی واقعہ تو اللہ تعالیٰ کی کسی نہ کسی حکمت کے بغیر نہیں ہوتا۔ انسان کی نظر چونکہ محدود ہے، اس لیے وہ اس حکمت کو بسا اوقات نہیں سمجھتا، لیکن جس قادر مطلق کے ہاتھ میں پوری کائنات کی باگ ڈور ہے، وہی جانتا ہے کہ کس وقت کیا واقعہ پیش آنا چاہیے۔ اس بات کی مزید وضاحت انشاء اللہ اسی واقعے کے آخر میں آئے گی (دیکھئے ذیل میں حاشیہ نمبر 41)","translation":"اور (اس وقت کا ذکر سنو) جب موسیٰ نے اپنے نوجوان (شاگرد) سے کہا تھا کہ : میں اس وقت تک اپنا سفر جاری رکھوں گا جب تک دو سمندروں کے سنگھم پر نہ پہنچ جاؤں، ورنہ برسوں چلتا رہوں گا۔ (33)"}