{"tafsir":"41: حضرت موسیٰ ؑ کو حضرت خضر ؑ سے ملوانے اور یہ واقعات دکھانے کا اصل مقصد ایک اہم حقیقت کا مشاہدہ کرانا تھا اور اسی حقیقت کو واضح کرنے کے لئے قرآن کریم نے یہ واقعہ ہمارے لئے بیان فرمایا ہے، اسلامی شریعت کی رو سے کسی کے لئے یہ بالکل جائز نہیں ہے کہ وہ کسی دوسرے کی ملکیت میں اسکی اجازت کے بغیر کوئی تصرف کرے، خاص طور پر اس کی تو ہرگز اجازت نہیں دی جاسکتی کے اس کی ملکیت کو کوئی نقصان پہنچادے، چاہے وہ نقصان خود مالک کے فائدے کی نیت ہی سے پہنچایا گیا ہو لیکن حضرت خضر ؑ نے کشتی والوں کی اجازت کے بغیر اس کا تختہ نکال دیا، اسی طرح کسی بےگناہ کو قتل کرنا شریعت میں انتہائی سنگین جرم ہے خاص طور پر کسی نابالغ لڑکے کو قتل کرنا تو حالت جنگ میں بھی جائز نہیں ہے، یہاں تک کہ اگر یہ معلوم ہو کہ یہ لڑکا بڑا ہو کر کوئی فساد مچائے گا، تب بھی اس وقت اسے قتل کرنے کا کوئی جواز نہیں بنتا، اس لئے حضرت موسیٰ ؑ ان پر خاموش نہیں رہ سکے، سوال یہ پیدا ہوتا ہے کہ حضرت خضر ؑ نے شریعت کے بالکل خلاف یہ کام کیسے کئے، اس سوال کا جواب جاننے کے لئے پہلے یہ سمجھنا ضروری ہے کہ اس کائنات میں جتنے واقعات ہوتے ہیں چاہے وہ ہماری نظر میں اچھے معلوم ہوتے ہوں یا برے ان کا تعلق ایک ایسے جہاں سے ہے جو ہماری آنکھوں سے پوشیدہ ہے، اور جسے اصطلاح میں عالم تکوین کہا جاتا ہے جو براہ راست اللہ تعالیٰ کی حکمت اور اس کے تکوینی احکام کے ذریعے کنٹرول ہورہا ہے، کس شخص کو کتنے عرصے زندہ رہنا ہے ؟ اور کب اس کی موت واقع ہوگی، وہ کتنے عرصے صحت مند رہے گا اور کب بیمار ہوجائے گا، اسے کب کونسا روز گار نصیب ہوگا ؟ اور اس کے ذریعے وہ کتنی روزی کماسکے گا ؟ اس قسم کے سارے معاملات اللہ تعالیٰ براہ راست طے فرماتے ہیں اور ان فیصلوں کو نافذ کرنے کے لئے اللہ تعالیٰ نے کچھ کارندے مقرر فرما رکھے ہیں جو ہماری نگاہوں سے پوشیدہ رہ کر اللہ تعالیٰ کے ان تکوینی احکام کی تعمیل کرتے ہیں، مثلاً جب اللہ تعالیٰ نے یہ طے فرمالیا کہ فلاں شخص کی موت کا وقت آگیا ہے تو اللہ تعالیٰ کی طرف سے موت کا فرشتہ اس شخص کی روح قبض کرنے کے لئے پہنچ جاتا ہے، جب وہ اللہ تعالیٰ کے تکوینی حکم کی تعمیل میں کسی کی موت واقع کررہا ہوتا ہے تو وہ کسی جرم کا ارتکاب نہیں کرتا ؛ بلکہ اللہ تعالیٰ کے حکم کی تعمیل کرتا ہے، کسی انسان کو یہ حق نہیں پہنچتا کہ وہ کسی دوسرے کی جان لے، لیکن جس فرشتے کو اللہ تعالیٰ نے اسی کام پر مقرر فرمایا ہے اس کے لئے یہ کوئی جرم نہیں۔ اللہ تعالیٰ کے تکوینی احکام کو نافذ کرنے کے لئے عام طور سے فرشتے مقرر ہوتے ہیں ؛ لیکن اللہ تعالیٰ جس کو چاہیں یہ فریضہ سونپ سکتے ہیں، حضرت خضر ؑ اگرچہ انسان تھے ؛ لیکن اللہ تعالیٰ نے ان کو فرشتوں کی طرح عالم تکوین کا پیغمبر بنادیا تھا، انہوں نے جو کچھ کیا اللہ تعالیٰ کے تکوینی حکم کے ذریعے کیا، لہذا جس طرح موت کے فرشتے پر یہ اعتراض نہیں کیا جاسکتا کہ اس نے ایک بےگناہ کی جان لے کر گناہ کا ارتکاب کیا ہے، کیونکہ وہ اللہ تعالیٰ کی طرف سے اسی بات کے لئے مامور تھا، اسی طرح حضرت خضر ؑ بھی اس کشتی کو عیب لگانے اور اس لڑکے کو قتل کرنے پر اللہ تعالیٰ کی طرف سے تکوینی طور پر مامور تھے، اس لئے ان کا یہ عمل کوئی جرم نہیں تھا، البتہ ہم لوگ دنیا میں رہتے ہوئے شریعت کے احکام کے پابند ہیں اور ہمیں عالم تکوین کا نہ علم عطا کیا گیا ہے اور نہ اس عالم سے متعلق ہمیں کوئی ذمہ داری سونپی گئی ہے، اس لئے ہم انہی احکام کے مکلف ہیں جو اس جیتی جاگتی زندگی میں ہمیں آنکھوں سے نظر آتے ہیں، چنانچہ حضرت موسیٰ ؑ جو اسی جیتی جاگتی دنیا کے پیغمبر تھے، اور جو شریعت ان کو دی گئی تھی، اسی کے پابند تھے، اس لئے وہ نہ حضرت خضر ؑ کی ان باتوں پر خاموش رہ سکے اور نہ آئندہ ان کے ساتھ چل سکے، ان تین واقعات کے بعد وہ سمجھ گئے کہ ان صاحب کا دائرے کار میرے دائرہ کار سے بالکل الگ ہے اور میں ان کے ساتھ نہیں چل سکتا، البتہ اس طرح انہیں یہ حقیقت کھلی آنکھوں دکھادی گئی کہ اس کائنات میں جو کچھ ہورہا ہے اس کے پیچھے اللہ تعالیٰ کی لا محدود حکمت کار فرما ہے، اگر ہمیں کسی واقعہ کی وجہ سمجھ میں نہ آئے تو اسکی بنا پر اللہ تعالیٰ کے فیصلے پر کسی اعتراض کی کوئی گنجائش نہیں ہے کیونکہ جس عالم تکوین میں اس کی حکمت واضح ہوسکتی ہے وہ ہماری نگاہوں سے پوشیدہ ہے، روز مرہ کی زندگی میں ہمیں بہت سے منظر ایسے نظر آتے ہیں جن پر ہمارا دل دکھتا ہے بہت سے انسانوں کی مظلومیت کو دیکھ کر بعض اوقات دل میں شکوک و شبہات پیدا ہونے لگتے ہیں، حضرت خضر ؑ کے ذریعے عالم تکوین کی ایک جھلک دکھا کر ایک مومن کے لئے ایسے شکوک و شبہات کا خاتمہ کردیا گیا ہے، البتہ یہ یاد رکھنا چاہیے کہ یہ عالم تکوین اور اس کے کارندے ہماری آنکھوں سے پوشیدہ ہیں، حضرت خضر ؑ بھی اس طرح پوشیدہ تھے، لیکن حضرت موسیٰ ؑ کو عالم تکوین کی ایک جھلک دکھانے کے لئے وحی کے ذریعے ان کا پتہ بتادیا گیا، اب جبکہ وحی کا دروازہ بند ہوچکا ہے کسی کے لئے ممکن نہیں ہے کہ وہ یقینی طور پر تکوین کے کسی کارندے تک رسائی حاصل کرسکے، اور نہ نظر آنے والی دنیا میں کوئی شخص یہ دعوی کرسکتا ہے کہ وہ تکوین کا کارندہ ہے، اور اسے تکوینی اختیارات حاصل ہیں، لہذا جن لوگوں نے حضرت خضر ؑ کے واقعے کی بنیاد پر شریعت کے ظاہری احکام کی خلاف ورزی کو جائز قرار دینے کی کوشش کی ہے انہوں نے سراسر گمراہی پھیلائی ہے، مثلاً بعض نام نہاد درویشوں کا تصوف وغیرہ کے نام لے کر یہ کہنا کہ شریعت کے احکام ظاہر بیں لوگوں کے لئے ہیں، اور ہم ان سے مستثنی ہیں، پر لے درجے کی گمراہی ہے، آج کسی کے پاس کوئی ذریعہ نہیں ہے جس سے وہ شریعت کے احکام سے مستثنی ہوسکے۔","translation":"رہی یہ دیوار، تو وہ اس شہر میں رہنے والے دو یتیم لڑکوں کی تھی، اور اس کے نیچے ان کا ایک خزانہ گڑا ہوا تھا، اور ان دونوں کا باپ ایک نیک آدمی تھا۔ اس لیے آپ کے پروردگار نے یہ چاہا کہ یہ دونوں لڑکے اپنی جوانی کی عمر کو پہنچیں، اور اپنا خزانہ نکال لیں۔ یہ سب کچھ آپ کے رب کی رحمت کی بنا پر ہوا ہے، اور میں نے کوئی کام اپنی رائے سے نہیں کیا۔ یہ تھا مقصد ان باتوں کا جن پر آپ سے صبر نہیں ہوسکا۔ (41)"}