{"text":"3: ان حضرات کے واقعے کا خلاصہ قرآن کریم کے بیان کے مطابق یہ ہے کہ یہ کچھ نوجوان تھے جو ایک مشرک بادشاہ کے عہد حکومت میں توحید کے قائل تھے۔ بادشاہ نے ان کو توحید پر ایمان رکھنے کی بنا پر پریشان کیا تو یہ حضرات شہر سے نکل کر ایک غار میں چھپ گئے تھے۔ وہاں اللہ تعالیٰ نے ان پر گہری نیند طاری فرمادی، اور یہ تین سو نو سال تک اسی غار میں پڑے سوتے رہے۔ اللہ تعالیٰ نے اس نیند کے دوران اپنی قدرت کاملہ سے ان کی زندگی کو بھی سلامت رکھا، اور ان کے جسم بھی گلنے سڑنے سے محفوظ رہے، تین سو نو سال بعد ان کی آنکھ کھلی تو انہیں اندازہ نہیں تھا کہ وہ اتنی لمبی مدت تک سوتے رہے ہیں۔ لہذا ان کو بھوک محسوس ہوئی تو اپنے میں سے ایک صاحب کو کچھ کھانا خرید کر لانے کے لیے شہر بھیجا، اور یہ ہدایت کی کہ احتیاط کے ساتھ شہر میں جائیں، تاکہ ظالم بادشاہ کو پتہ نہ چل سکے۔ اللہ تعالیٰ کا کرنا ایسا ہوا کہ اس تین سو سال کے عرصے میں وہ ظالم بادشاہ مرکھپ گیا تھا، اور ایک نیک اور صحیح العقیدہ شخص بادشاہ بن چکا تھا۔ یہ صاحب جب شہر میں پہنچے تو کھانا خریدنے کے لیے وہی پرانا سکہ پیش کیا جو تین سو سال پہلے اس ملک میں چلا کرتا تھا، دکان دار نے وہ پرانا سکہ دیکھا تو اس طرح یہ بات سامنے آئی کہ یہ حضرات صدیوں تک سوتے رہے تھے۔ بادشاہ کو پتہ چلا تو اس نے ان لوگوں کو بڑی عزت اور اکرام کے ساتھ اپنے پاس بلایا، اور بالآخر جب ان حضرات کی وفات ہوئی تو ان کی یادگار میں ایک مسجد تعمیر کی۔ عیسائیوں کے یہاں یہ واقعہ ”سات سونے والوں“ (Seven Sleepers) کے نام سے مشہور ہے۔ معروف مورخ ایڈورڈ گبن نے اپنی مشہور کتاب ”زوال و سقوط سلطنت روم“ میں بیان کیا ہے کہ وہ ظالم بادشاہ ڈوسیس تھا جو حضرت عیسیٰ ؑ کے پیرؤوں پر ظلم ڈھانے میں بہت مشہور ہے۔ اور یہ واقعہ ترکی کے شہر افسس میں پیش آیا تھا۔ جس بادشاہ کے زمانے میں یہ حضرت بیدار ہوئے۔ گبن کے بیان کے مطابق وہ تھیوڈوسیس تھا۔ مسلمان مورخین اور مفسرین نے بھی اس سے ملتی جلتی تفصیلات بیان فرمائی ہیں اور ظالم بادشاہ کا نام دقیانوس ذکر کیا ہے۔ ہمارے دور کے بعض محققین کا کہنا ہے کہ یہ واقعہ اردن کے شہر عمان کے قریب پیش آیا تھا جہاں ایک غار میں کچھ لاشیں اب تک موجود ہیں۔ یہ تحقیق میں نے تفصیل کے ساتھ اپنی کتاب ”جہان دیدہ“ میں بیان کردی ہے۔ لیکن ان میں سے کوئی بات بھی اتنی مستند نہیں ہے کہ اس پر بھروسہ کیا جاسکے۔ قرآن کریم کا اسلوب یہ ہے کہ وہ کسی واقعے کی اتنی ہی تفصیل بیان فرماتا ہے جو فائدہ مند ہو۔ اس سے زیادہ تفصیلات میں پڑنے کی کوئی ضرورت نہیں ہے۔ ان حضرات کو ”اصحاب الکہف“ (غار والے) کہنے کی وجہ تو ظاہر ہے کہ انہوں نے غار میں پناہ لی تھی۔ لیکن ان کو ”رقیم والے“ کیوں کہتے ہیں ؟ اس کے بارے میں مفسرین کی رائیں مختلف ہیں۔ بعض حضرات کا کہنا یہ ہے کہ ”رقیم“ اس غار کے نیچے والی وادی کا نام ہے۔ بعض کہتے ہیں کہ ”رقیم“ تختی پر لکھے ہوئے کتبے کو کہتے ہیں۔ اور ان حضرات کے انتقال کے بعد ان کے نام ایک تختی پر کتبے کی صورت میں لکھوا دئیے گئے تھے۔ اس لیے ان کو ”اصحاب الرقیم“ بھی کہا جاتا ہے۔ تیسرے بعض حضرات کا خیال ہے کہ یہ اس پہاڑ کا نام ہے جس پر وہ غار واقع تھا۔ واللہ سبحانہ اعلم۔\n 4: جن لوگوں نے آنحضرت ﷺ سے ان نوجوانوں کے بارے میں سوال کیا تھا، انہوں نے یہ بھی کہا تھا کہ ان کا واقعہ بڑا عجیب ہے۔ اس آیت میں انہی کے حوالے سے فرمایا جا رہا ہے کہ اللہ تعالیٰ کی قدرت کے پیش نظر یہ واقعہ کوئی بہت عجیب نہیں ہے، کیونکہ اس کی قدرت کے کرشمے تو بیشمار ہیں۔"}