{"text":"22: پیچھے بنی اسرائیل کی اس نافرمانی کا ذکر تھا کہ جہاد کا حکم آجانے کے باوجود اس سے جان چراتے رہے، اب بتانا یہ مقصود ہے کہ ایک بامقصد جہاد میں کسی کی جان لینا تو نہ صرف جائز بلکہ واجب ہے ؛ لیکن ناحق کسی کو قتل کرنا بڑا زبردست گناہ ہے، بنی اسرائیل نے جہاد سے تو جان چرائی ؛ لیکن بہت سے بےگنا ہوں کو قتل کرنے میں کوئی باک محسوس نہیں کیا، اس سلسلے میں وہ واقعہ بیان کیا جارہا ہے جو اس دنیا میں سب سے پہلے قتل کی واردات پر مشتمل ہے، اس واقعے میں قرآن کریم نے تو صرف اتنا بتایا ہے کہ آدم ؑ کے دو بیٹوں نے کچھ قربانی پیش کی تھی ایک کی قربانی قبول ہوئی دوسرے کی نہ ہوئی اس پر دوسرے کو غصہ آگیا اور اس نے اپنے بھائی کو قتل کرڈالا ؛ لیکن اس قربانی کا کیا پس منظر تھا قرآن کریم نے اس کی تفصیل نہیں بتائی، البتہ مفسرین نے حضرت عبداللہ بن مسعود ؓ اور کچھ دوسرے صحابہ کرام کے حوالے سے ایک واقعہ تفصیل سے بیان کیا ہے جس کا خلاصہ یہ ہے کہ حضرت آدم ؑ کے دو بیٹے تھے جن میں سے ایک کا نام قابیل تھا اور ایک کا ہابیل، اس وقت چونکہ دنیا کی آبادی صرف حضرت آدم ؑ کی اولاد پر مشتمل تھی اس لئے ان کی اہلیہ کے ہر حمل میں دو جڑواں بچے پیدا ہوتے تھے ایک لڑکا اور ایک لڑکی، ان دونوں کے درمیان تو نکاح حرام تھا ؛ لیکن ایک حمل میں پیدا ہونے والے لڑکے کا نکاح دوسرے حمل سے پیدا ہونے والی لڑکی سے ہوسکتا تھا، قابیل کے ساتھ جو لڑکی پیدا ہوئی وہ بڑی خوبصورت تھی ؛ لیکن جڑواں بہن ہونے کی وجہ سے اس کے ساتھ قابیل کا نکاح جائز نہ تھا، اس کے باوجود اس کا اصرار تھا کہ اسی سے نکاح کرے، ہابیل کے لئے وہ لڑکی حرام نہ تھی اس لئے وہ اس کے ساتھ نکاح کرنا چاہتا تھا، جب دنوں کا یہ اختلاف بڑھا تو فیصلہ اس طرح قرار پایا کہ دونوں کچھ قربانی اللہ تعالیٰ کے حضور پیش کریں جس کی قربانی اللہ تعالیٰ نے قبول فرمالی اس کا دعوی برحق سمجھاجائے گا ؛ چنانچہ دونوں نے قربانی پیش کی، روایات میں ہے کہ ہابیل نے ایک دنبہ قربان کیا اور قابیل نے کچھ زرعی پیداوار پیش کی، اس وقت قربانی کے قبول ہونے کی علامت یہ تھی کہ آسمان سے ایک آگ آکر قربانی کو کھاجاتی تھی، ہابیل کی قربانی کو آگ نے کھالیا اور اس طرح اس کی قربانی واضح طور پر قبول ہوگئی اور قابیل کی قربانی وہیں پڑی رہ گئی، جس کا مطلب یہ تھا کہ وہ قبول نہیں ہوئی، اس پر بجائے اس کے کہ قابیل حق کو قبول کرلیتا حسد میں مبتلا ہو کر اپنے بھائی کو قتل کرنے کے لئے تیار ہوگیا۔"}