{"text":"26: پیچھے جہاں انسانی جان کی حرمت کا ذکر تھا وہاں یہ اشارہ بھی کردیا گیا تھا کہ جو لوگ زمین میں فساد مچاتے ہیں ان کی جان کو یہ حرمت حاصل نہیں ہے، اب ان کی مفصل سزا بیان کی جارہی ہے، مفسرین اور فقہاء کا اس بات پر تقریباً اتفاق ہے کہ اس آیت میں ان لوگوں سے مراد وہ ڈاکو ہیں جو اسلحے کے زور پر لوگوں کو لوٹتے ہیں، ان کے بارے میں یہ جو کہا گیا ہے کہ وہ اللہ اور اس کے رسول سے لڑائی کرتے ہیں، اس کا مطلب یہ ہے کہ وہ ان قوانین کی بےحرمتی کرتے ہیں اور ان کا لوگوں سے لڑنا گویا اللہ اور اس کے رسول سے لڑنا ہے، ان لوگوں کے لئے اس آیت میں چار سزائیں بیان کی گئی ہیں، ان سزاؤں کی تشریح امام ابوحنیفہ ؒ نے یہ فرمائی ہے کہ اگر ان لوگوں نے کسی کو قتل کیا ہو مگر مال لوٹنے کی نوبت نہ آئی ہو تو انہیں قتل کیا جائے گا، مگر یہ قتل کرنا حد شرعی کے طور پر ہوگا قصاص کے طور پر نہیں، جس کا نتیجہ یہ ہوگا کہ اگر مقتول کو وارث معاف بھی کرنا چاہیں تو ان کی معافی نہیں ہوگی، اور اگر ڈاکوؤں نے کسی کو قتل بھی کیا ہو اور مال بھی لوٹا ہو تو انہیں سولی پر لٹکا کر ہلاک کیا جائے گا، اور اگر مال لوٹا ہو اور کسی کو قتل نہ کیا ہو تو ان کا دایاں ہاتھ اور بایاں پاؤں کاٹا جائے گا، اور اگر انہوں نے لوگوں کو صرف ڈرایا دھمکایا ہو، نہ مال لوٹنے کی نوبت آئی ہو، نہ کسی کو قتل کرنے کی، تو امام ابوحنیفہ ؒ نے أَوْ يُنْفَوْا مِنَ الْأَرْضِ ، کی تشریح یہ کی ہے کہ انہیں قید خانے میں بند کردیا جائے گا، یہ تشریح : حضرت عمر ؓ کی طرف بھی منسوب ہے، دوسرے فقہاء نے اس کا مطلب یہ لیا ہے کہ انہیں جلا وطن کردیا جائے گا۔ یہاں یہ یاد رکھنا چاہیے کہ قرآن کریم نے ان جرائم کی سزائیں اصولی طور پر بیان فرمائی ہیں نبی کریم ﷺ نے احادیث میں تفصیل بیان فرمائی ہے کہ ان سخت سزاؤں پر عمل درآمد کے لئے کیا شرائط ہیں، فقہ کی کتابوں میں یہ ساری تفصیل آئی ہے، یہ شرائط اتنی کڑی ہیں کہ کسی مقدمے میں ان کا پورا ہونا آسان نہیں ؛ کیونکہ مقصد ہی یہ ہے کہ یہ سزائیں کم سے کم جاری ہوں، مگر جب جاری ہوں تو دوسرے مجرموں کے لئے سامان عبرت بن جائیں۔\n 27: یہ قرآنی الفاظ کا لفظی ترجمہ ہے۔ امام ابوحنیفہ ؒ نے ”زمین سے دور کرنے“ کی تشریح یہ کی ہے کہ انہیں قید خانے میں بند کردیا جائے گا۔ یہ تشریح حضرت عمر ؓ کی طرف بھی منسوب ہے۔ دوسرے فقہاء نے اس کا مطلب یہ لیا ہے کہ انہیں جلا وطن کردیا جائے گا۔"}