{"tafsir":"32: یہاں سے آیت نمبر : 50 تک کی آیتیں کچھ خاص واقعات کے پس منظر میں نازل ہوئی ہیں، جن میں کچھ یہودیوں نے اپنے کچھ جھگڑے اس امید پر آنحضرت ﷺ کے پاس لانے کا ارادہ کیا تھا کہ آپ ان کا فیصلہ ان کی خواہش کے مطابق کریں گے، ان میں سے ایک واقعہ تو یہ تھا کہ خیبر کے دو شادی شدہ یہودی مرد و عورت نے زنا کرلیا تھا، جس کی سزا خود تورات میں یہ مقرر تھی کہ ایسے مرد و عورت کو سنگسار کرکے ہلاک کیا جائے، یہ سزا موجودہ تورات میں بھی موجود ہے (دیکھئے استثناء : 22، 23، 24) لیکن یہودیوں نے اس کو چھوڑ کر کوڑوں اور منہ کالا کرنے کی سزا مقرر کر رکھی تھی، شاید وہ یہ چاہتے تھے کہ اس سزا میں بھی کمی ہوجائے اس لئے انہوں نہ یہ سوچا کہ آنحضرت ﷺ کی شریعت میں بہت سے احکام تورات کے احکام کے مقابلے میں نرم ہیں، اس لئے اگر آپ سے فیصلہ کرایا جائے تو شاید آپ کوئی نرم فیصلہ کریں اور یہ مرد و عورت سنگساری کی سزا سے بچ جائیں، اس غرض کے لئے خیبر کے یہودیوں نے مدینہ منورہ میں رہنے والے کچھ یہودیوں کو جن میں سے کچھ منافق بھی تھے، ان مجرموں کے ساتھ آنحضرت ﷺ کی خدمت میں بھیجا، مگر ساتھ ہی انہیں یہ تاکید کی کہ اگر آپ سنگساری کے سوا کوئی اور فیصلہ کریں تو اسے قبول کرلینا اور اگر سنگساری کا فیصلہ کریں تو قبول مت کرنا، چنانچہ یہ لوگ آپ کے پاس آئے، آپ کو اللہ تعالیٰ کی طرف سے بتادیا گیا تھا کہ اس کی سزا سنگساری ہے، جسے سن کر وہ بوکھلاگئے، آپ نے انہی سے پوچھا کہ تورات میں اس کی سزا کیا ہے، شروع میں انہوں نے چھپانے کی کوشش کی مگر آخر میں جب آپ نے ان کے ایک بڑے عالم ابن صوریا کو قسم دی اور حضرت عبداللہ بن سلام ؓ جو پہلے خود یہودی عالم تھے ان کا پول کھول دیا تو وہ مجبور ہوگیا اور اس نے تورات کی وہ آیت پڑھ دی جس میں زنا کی سزا سنگساری بیان کی گئی تھی، اور یہ بھی بتایا کہ تورات کا حکم تو یہی تھا مگر ہم میں سے غریب لوگ یہ جرم کرتے تو یہ سزا ان پر جاری کی جاتی تھی اور کوئی مال دار یا باعزت گھرانے کا آدمی یہ جرم کرتا تو اسے کوڑوں وغیرہ کی سزا دے دیا کرتے تھے، پھر رفتہ رفتہ سبھی کے لئے سنگساری کی سزا کو چھوڑدیا گیا، اس قسم کا ایک دوسرا واقعہ بھی پیش آیا تھا جس کی تفصیل نیچے آیت نمبر 45 کی تشریح : میں آرہی ہے۔\n 33: یعنی یہودیوں کے پیشوا جو جھوٹی بات تورات کی طرف منسوب کر کے بیان کردیتے ہیں، اور وہ ان کی خواہشات کے مطابق ہوتی ہے تو یہ اسے بڑے شوق سے سنتے اور اس پر یقین کرلیتے ہیں، چاہے وہ تورات کے صاف اور صریح احکام کے خلاف ہو اور یہ لوگ جانتے ہوں کہ ان کے پیشواؤں نے رشوت لے کر یہ بات بیان کی ہے۔\n 34: اس سے ان یہودیوں کی طرف اشارہ ہے جو خود تو آنحضرت ﷺ کے پاس نہیں آئے، لیکن ان یہودیوں اور منافقوں کو آپ کے پاس بھیج دیا۔ جو لوگ آئے تھے وہ آنحضرت ﷺ کی بات اس لیے سننے آئے تھے کہ آپ کا موقف سننے کے بعد ان لوگوں کو مطلع کریں جنہوں نے ان کو بھیجا تھا۔\n 35: چونکہ یہ دنیا آزمائش ہی کے لئے بنائی گئی ہے، اس لئے اللہ تعالیٰ کسی ایسے شخص کو زبردستی راہ راست پر لاکر اس کے دل کو پاک نہیں کرتا جو ضد پر اڑا ہوا ہو، یہ پاکیزگی انہی کو عطا ہوتی ہے جو حق کی طلب رکھتے ہوں اور خلوص کے ساتھ اسے قبول کریں۔","translation":"اے پیغمبر ! جو لوگ کفر میں بڑی تیزی دکھا رہے ہیں وہ تمہیں غم میں مبتلا نہ کریں (32) یعنی ایک تو وہ لوگ ہیں جنہوں نے زبان سے تو کہہ دیا ہے کہ ہم ایمان لے آئے ہیں، مگر ان کے دل ایمان نہیں لائے، اور دوسرے وہ لوگ ہیں جنہوں نے (کھلے بندوں) یہودیت کا دین اختیار کرلیا ہے۔ یہ لوگ جھوٹی باتیں کان لگا لگا کر سننے والے ہیں (33) (اور تمہاری باتیں) ان لوگوں کی خاطر سنتے ہیں جو تمہارے پاس نہیں آئے (34) جو (اللہ کی کتاب کے) الفاظ کا موقع محل طے ہوجانے کے بعد بھی ان میں تحریف کرتے ہیں۔ کہتے ہیں کہ اگر تمہیں یہ حکم دیا جائے تو اس کو قبول کرلینا اور اگر یہ حکم نہ دیا جائے تو بچ کر رہنا۔ اور جس شخص کو اللہ فتنے میں ڈالنے کا ارادہ کرلے تو اسے اللہ سے بچانے کے لیے تمہارا کوئی زور ہرگز نہیں چل سکتا۔ یہ وہ لوگ ہیں کہ (ان کی نافرمانی کی وجہ سے) اللہ نے ان کے دلوں کو پاک کرنے کا ارادہ نہیں کیا۔ (35) ان کے لیے دنیا میں رسوائی ہے اور انہی کے لیے آخرت میں زبردست عذاب ہے۔"}