{"tafsir":"1: جو لوگ مرنے کے بعد دوبارہ زندہ ہونے کو ناممکن یا مشکل سمجھتے ہیں، ان سے کہا جارہا ہے کہ خود اپنی تخلیق پر غور کرو کہ اللہ تعالیٰ نے کس حیرت انگیز طریقے پر کتنے مرحلوں سے گزار کر تمہیں پیدا فرمایا تھا۔ تمہارا کوئی وجود نہیں تھا، اللہ تعالیٰ نے تمہیں وجود بخشا، تم میں جان نہیں تھی، اللہ تعالیٰ نے تم میں جان ڈالی۔ جس ذات نے اس حیرت انگیز طریقے سے تمہیں ا سوقت پیدا کیا جب تم کچھ بھی نہیں تھے تو کیا وہ تمہیں مردہ لاش بننے کے بعد دوبارہ زندگی نہیں دے سکتا ؟\n 2: یعنی بعض اوقات تو اس گوشت کے لوتھڑے سے ماں کے پیٹ میں بچے کے اعضاء پورے بن جاتے ہیں اور بعض اوقات پورے نہیں بنتے۔ پھر بعض اوقات اسی نامکمل حالت میں عورت کو اسقاط ہوجاتا ہے اور بعض اوقات بچہ ناقص اعضاء کے ساتھ پیدا ہوتا ہے۔\n 3: یعنی زیادہ بڑھاپے کی حالت میں انسان بچپن کی سی ناسمجھی کی طرف لوٹ جاتا ہے اور جوانی میں اس نے کتنا علم حاصل کیا ہو، اس بڑھاپے میں وہ سب یا اکثر حصہ بھول جاتا ہے۔\n 4: یہ دوبارہ زندگی دینے کی دوسری دلیل ہے، اور وہ یہ کہ زمین جب خشک ہوتی ہے تو اس میں زندگی کے آثار ختم ہوجاتے ہیں، پھر اللہ تعالیٰ بارش برسا کر اس میں زندگی کی نئی لہر دوڑا دیتا ہے، اور اسی بےجان زمین سے پودے اگنے لگتے ہیں۔ جو خدا اس پر قادر ہے، کیا وہ تمہیں دوبارہ زندگی دینے پر قادر نہیں ؟","translation":"اے لوگو ! اگر تمہیں دوبارہ زندہ ہونے کے بارے میں کچھ شک ہے تو (ذرا سوچو کہ) ہم نے تمہیں مٹی سے پیدا کیا۔ (1) پھر نطفے سے، پھر ایک جمے ہوئے خون سے، پھر ایک گوشت کے لوتھڑے سے جو (کبھی) پورا بن جاتا ہے، اور (کبھی) پورا نہیں بنتا (2) تاکہ ہم تمہارے لیے (تمہاری) حقیقت کھول کر بتادیں، اور ہم (تمہیں) ماؤں کے پیٹ میں جب تک چاہتے ہیں، ایک متعین مدت تک ٹھہرائے رکھتے ہیں، پھر تمہیں ایک بچے کی شکل میں باہر لاتے ہیں، پھر (تمہیں پالتے ہیں) تاکہ تم اپنی بھر پور عمر تک پہنچ جاؤ، اور تم میں سے بعض وہ ہیں جو (پہلے ہی) دنیا سے اٹھالیے جاتے ہیں اور تمہی میں سے بعض وہ ہوتے ہیں جن کو بدترین عمر (یعنی انتہائی بڑھاپے) تک لوٹا دیا جاتا ہے، یہاں تک کہ وہ سب کچھ جاننے کے بعد بھی کچھ نہیں جانتے۔ (3) اور تم دیکھتے ہو کہ زمین مرجھائی ہوئی پڑی ہے، پھر جب ہم اس پر پانی برساتے ہیں تو وہ حرکت میں آتی ہے، اس میں بڑھوتری ہوتی ہے، اور وہ ہر قسم کی خوشنما چیزیں اگاتی ہے۔ (4)"}