{"text":"3: اس آیت کے شان نزول میں حافظ ابن جریر اور دوسرے مفسرین نے ایک واقعہ نقل کیا ہے کہ حضرت ولید بن عقبہ کو حضور اقدس ﷺ نے قبیلہ بنومصطلق کے پاس زکوٰۃ وصول کرنے کے لیے بھیجا تھا۔ جب یہ ان کی بستی کے قریب پہنچے تو وہ لوگ آنحضرت ﷺ کے بھیجے ہوئے ایلچی کے استقبال کے لیے بڑی تعداد میں بستی کے باہر جمع ہوگئے۔ ولید بن عقبہ یہ سمجھے کہ یہ لوگ لڑائی کے لیے باہر نکل آئے ہیں۔ بعض روایات میں یہ بھی مذکور ہے کہ ان کے اور بنو مصطلق کے درمیان جاہلیت کے زمانے میں کچھ دشمنی بھی تھی۔ اس لیے حضرت ولید کو یہ خطرہ ہوا کہ وہ لوگ اس پرانی دشمنی کی بناء پر ان سے لڑنے کے لیے نکل آئے ہیں۔ چنانچہ وہ بستی میں داخل ہونے کے بجائے وہیں سے واپس لوٹ گئے، اور جا کر آنحضرت ﷺ سے عرض کیا کہ بنو مصطلق کے لوگوں نے زکوٰۃ دینے سے انکار کردیا ہے، اور وہ لڑائی کے لیے نکلے ہوئے ہیں۔ آنحضرت ﷺ نے حضرت خالد بن ولید ؓ کو مقرر فرمایا کہ واقعے کی تحقیق کے بعد اگر واقعی ان لوگوں کی سرکشی ثابت ہو تو ان سے جہاد کریں۔ بعد میں پتہ چلا کہ وہ لوگ تو استقبال کے لیے جمع ہوئے تھے، اور انہوں نے زکوٰۃ دینے سے انکار نہیں کیا۔ اس پر یہ آیت نازل ہوئی۔ ان روایات کی بناء پر بعض حضرات نے یہ فرمایا ہے کہ آیت میں جو فاسق کا لفظ استعمال ہوا ہے، اس سے مراد ولید بن عقبہ ہیں، پھر اس پر جو اشکال ہوتا ہے کہ ایک صحابی کو فاسق قرار دینا بظاہر عدالت صحابہ کے منافی ہے، اس کا یہ جواب دیا ہے کہ بعض صحابہ سے گناہ سرزد ہوئے ہیں، لیکن اللہ تعالیٰ نے انہیں توبہ کی توفیق عطا فرما دی، اس لیے بحیثیت مجموعی ان کی عدالت پر کوئی اثر نہیں پڑتا۔ لیکن حقیقت یہ ہے کہ اس واقعے کے بیان میں جو روایتیں آئی ہیں، اول تو وہ سند کے اعتبار سے مضبوط نہیں ہیں، اور ان میں تعارض و اختلاف بھی پایا جاتا ہے، دوسرے اس واقعے کی بنا پر حضرت ولید کو فاسق قرار دینے کی کوئی معقول وجہ بھی سمجھ میں نہیں آتی، کیونکہ اس واقعے میں انہوں نے جان بوجھ کر کوئی جھوٹ نہیں بولا، بلکہ جو کچھ کیا، غلط فہمی کی وجہ سے کیا جس کی وجہ سے کسی کو فاسق نہیں کہا جاسکتا۔ اس لیے بظاہر ایسا معلوم ہوتا ہے کہ جب حضرت ولید بستی کے قریب پہنچے، اور قبیلے کے لوگ بڑی تعداد میں وہاں جمع ہورہے تھے تو کسی شریر آدمی نے ان سے یہ کہا ہوگا کہ یہ لوگ آپ سے لڑنے کے لیے نکلے ہیں۔ اس شریر آدمی کو آیت میں فاسق قرار دیا گیا ہے، اور حضرت ولید کو یہ تنبیہ کی گئی ہے کہ تنہا اس شریر آدمی کی خبر پر بھروسہ کر کے کوئی اقدام کرنے کے بجائے پہلے اس خبر کی تحقیق کرنی چاہیے تھی۔ اس خیال کی تائید ایک روایت سے بھی ہوتی ہے جو حافظ ابن جریر نے نقل کی ہے، اور اس میں یہ الفاظ ہیں کہ فحدثه الشیطان انھم یریدون قتله (تفسیر ابن جریر ج : 22 ص 286) یعنی شیطان نے انہیں یہ بتایا کہ وہ لوگ انہیں قتل کرنا چاہتے ہیں۔ ظاہر یہی ہے کہ شیطان نے کسی انسان کی شکل میں آ کر انہیں یہ جھوٹی خبر دی ہوگی۔ اس لیے آیت کے لفظ فاسق کو خواہ مخواہ ایک صحابی پر چسپاں کرنے کی کیا ضرورت ہے جبکہ انہوں نے جو کچھ کیا غلط فہمی میں کیا۔ اس کے بجائے اسے اس مخبر پر چسپاں کرنا چاہیے جس نے حضرت ولید کو یہ غلط خبر دی تھی۔\n بہرحال ! واقعہ کچھ بھی ہو، قرآن کریم کا اسلوب یہ ہے کہ اس کی آیتیں چاہے کسی خاص موقع پر نازل ہوئی ہوں، اکثر ان کے الفاظ عام ہوتے ہیں، تاکہ ان سے ایک اصولی حکم معلوم ہوسکے۔ چنانچہ یہ ایک عام حکم ہے کہ کسی فاسق کی خبر پر بغیر تحقیق کے اعتماد نہیں کرنا چاہیے، خاص طور پر جب اس خبر کے نتیجے میں کسی کو کوئی نقصان پہنچ سکتا ہو۔"}