{"text":"27: اس آیت میں ان معجزات کا ذکر فرمایا گیا ہے جن کی فرمائش مکہ مکرمہ کے کافر لوگ کیا کرتے تھے، وہ کہتے تھے کہ مکہ مکرمہ کے ارد گرد جو پہاڑ ہیں ان کو یہاں سے ہٹادو، اور یہاں کی زمین کو شق کرکے یہاں سے دریا نکال دو ، اور ہمارے باپ داداؤں کو زندہ کرکے ان سے ہماری بات کروادو، اس آیت میں یہ فرمایا گیا ہے کہ اگر بالفرض یہ بےہودہ مطالبات پورے کر بھی دئے جاتے، تب بھی یہ لوگ ایمان لانے والے نہیں تھے، کیونکہ یہ فرمائشیں حق طلبی کے جذبے سے نہیں، صرف ضد کی وجہ سے کی جارہی ہیں، سورة بنی اسرائیل (15۔ 90 تا 93) میں اسی قسم کی کچھ اور فرمائشیں بھی مذکور ہیں جو کفار کیا کرتے تھے اور اسی سورت کی آیت نمبر : 59 میں فرمائشی معجزات نہ دکھانے کی ایک وجہ یہ بیان فرمائی گئی ہے کہ جب کسی قوم کو کسی خاص معجزے کی فرمائش پر وہ معجزہ دکھا دیا جاتا ہے اور وہ پھر بھی ایمان نہیں لاتی تو اس پر عذاب نازل ہوتا ہے، چنانچہ پچھلی امتوں عاد اور ثمود وغیرہ کے ساتھ یہی ہوا ہے، اللہ تعالیٰ کو معلوم ہے کہ یہ لوگ اپنے فرمائشی معجزات دیکھ کر بھی ایمان نہیں لائیں گے، اور ابھی ان کو ہلاک کرنا منظور نہیں ہے، اس لئے بھی ایسے معجزات نہیں دکھائے جارہے ہیں۔\n 28: کبھی کبھی مسلمانوں کو یہ خیال ہوتا تھا کہ جو معجزات یہ لوگ مانگ رہے ہیں، اگر وہ ان کو دکھا دئے جائیں تو شاید یہ لوگ مسلمان ہوجائیں، یہ آیت ان مسلمانوں کو ہدایت دے رہی ہے کہ انہیں اب اس بات سے اپنا ذہن فارغ کرلینا چاہیے اور یہ سوچنا چاہیے کہ اللہ تعالیٰ کی قدرت میں تو یہ بھی ہے کہ وہ ان سب کو اپنی قدرت سے زبردستی مسلمان کردے، لیکن چونکہ دنیا کی اس امتحان گاہ کا اصل مقصد ہی یہ ہے کہ ہر شخص اپنی عقل استعمال کرکے اپنے اختیار سے ایمان لائے اس لئے اللہ تعالیٰ نے اس معاملے میں اپنی قدرت کو استعمال نہیں کیا، البتہ ایسے دلائل واضح کردئے ہیں کہ اگر انسان ان پر انصاف سے غور کرے اور ہٹ دھرمی چھوڑ دے تو اس کو حقیقت تک پہنچنے میں دیر نہیں لگنی چاہیے، اس کے بعد کافروں کی ہر فرمائش پوری کرنے کی کوئی ضرورت نہیں ہے۔\n 29: بعض مسلمانوں کو کبھی یہ خیال بھی ہوتا تھا کہ جب یہ لوگ ایمان لانے والے نہیں ہیں تو ان پر ابھی کوئی عذاب کیوں نہیں آجاتا، اس آیت میں اس کا یہ جواب دیا گیا ہے کہ ان لوگوں پر چھوٹی چھوٹی مصیبتیں تو اس دنیا میں بھی پڑتی رہتی ہیں مثلاً کبھی قحط آجاتا ہے کبھی کوئی اور بلا نازل ہوجاتی ہے، اور بعض اوقات ان کی قریبی بستیوں پر ایسی مصیبتیں آجاتی ہیں جن سے یہ لوگ خوف زدہ ہوجاتے ہیں، مگر ان کو اصل عذاب اس وقت ہوگا جب قیامت آنے کا وعدہ پورا ہوگا۔"}