{"text":"71: ستر آدمیون کو کوہ طور پر لے جانے کی کیا وجہ تھی ؟ اس کے بارے میں مفسرین نے مختلف رائیں ظاہر کی ہیں۔ بعض حضرات نے فرمایا ہے کہ بچھڑے کی عبادت کا جو جرم عظیم بنی اسرائیل سے سرزد ہوتا تھا، اس پر توبہ کرانے کے لیے انہیں کوہ طور پر بلایا گیا تھا۔ لیکن اگر یہ بات تھی تو ان پر زلزلہ مسلط کرنے کی کوئی معقول توجیہ واضح نہیں ہوتی۔ اور جو توجیہات بیان کی گئی ہیں، تکلف سے خالی نہیں ہیں۔ لہذا زیادہ صحیح بات وہ معلوم ہوتی ہے جو بعض روایات میں آئی ہے کہ جب حضرت موسیٰ ؑ تورات لے کر آئے اور بنی اسرائیل کو اس پر عمل کرنے کا حکم دیا تو ان میں سے بعض نے کہا کہ ہمیں اس بات کا یقین کیسے آئے کہ یہ کتاب اللہ تعالیٰ ہی نے نازل کی ہے۔ اس پر اللہ تعالیٰ نے حضرت موسیٰ ؑ سے فرمایا کہ وہ قوم کے ستر نمائندے منتخب کر کے انہیں کوہ طور پر لے آئیں۔ اور بعض روایات میں ہے کہ وہاں ان کو اللہ تعالیٰ کا کلام سنا دیا گیا۔ لیکن اب انہوں نے اپنے مطالبے کو بڑھا کر یہ کہا کہ ہمیں تو اس وقت تک یقین نہیں آئے گا جب تک ہم اللہ تعالیٰ کو کھلی آنکھوں نہ دیکھ لیں۔ اس معاندانہ مطالبے کی وجہ سے ان پر بجلی کا کڑکا ہوا جس نے زلزلے کی کیفیت پیدا کردی اور وہ سب بےہوش ہوگئے۔ واقعے کی یہ توجیہ خود قرآن کریم کی تصریحات سے مطابقت رکھتی ہے۔ سورة بقرہ (55:2، 56) اور سورة نساء (153:4) میں بنی اسرائیل کا یہ مطالبہ بیان فرمایا گیا ہے کہ ہمیں کھلی آنکھوں اللہ تعالیٰ کا دیدار کرواؤ اور یہ کہ ہم اس وقت تک تورات کو نہیں مانیں گے جب تک اللہ تعالیٰ کو خود نہ دیکھ لیں اور یہ بات بھی ان دونوں آیتوں میں مذکور ہے کہ ان کے اس مطالبے پر انہیں ایک کڑکے نے آپکڑا تھا۔ غالباً اسی کڑکے کے نتیجے میں وہ زلزلہ آیا جس کا یہاں ذکر فرمایا گیا ہے یہاں یہ واضح رہے کہ سورة نساء (153:4) میں کڑکے کے ذکر کے بعد جو یہ فرمایا گیا کہ ہے کہ ثم اتخذوا العجل، اس سے یہ لازم نہیں آتا کہ کڑکا بچھڑے کے واقعے سے پہلے پیش آچکا تھا۔ کیونکہ وہاں اللہ تعالیٰ نے بنی اسرائیل کی متعدد بد اعمالیاں بیان فرمائی ہیں، ان میں زمانی ترتیب ہونا ضروری نہیں ہے۔ اور ثم کا لفظ عربی زبان میں ”اس سے بھی بڑھ کر“ کے معنی میں یہ بھی بکثرت استعمال ہوتا ہے \n 72: جیسا کہ سورة بقرہ (56:2) میں گذر چکا ہے اس زلزلے کے نتیجے میں ان ستر آدمیوں پر موت جیسی حالت طاری ہوگئی تھی۔ کم از کم دیکھنے والا یہی سمجھتا تھا کہ یہ سب مرچکے ہیں۔ حضرت موسیٰ ؑ اپنی خدا داد بصیرت سے سمجھ گئے کہ بظاہر اللہ تعالیٰ کو ان کا اس وقت ہلاک کرنا منظور نہیں ہے۔ چنانچہ انہوں نے اللہ تعالیٰ سے عرض کیا کہ آپ کی قدرت میں تو یہ بھی تھا کہ انہیں، بلکہ مجھے بھی، پہلے ہی اس وقت ہلاک کردیتے جب ان کی متعدد نافرمانیاں سامنے آئی تھیں۔ نیز یہ بھی آپ کی رحمت اور حکمت سے بعید ہے کہ چند بیوقوفوں کی حرکت پر ہم سب کو ہلاک کر ڈالیں۔ اور اس وقت اگر یہ ستر آدمی واقعی ہمیشہ کے لیے مرگئے تو میری اور میرے مخلص ساتھیوں کی بھی ہلاکت تقریباً یقینی ہے کیونکہ میری قوم کے لوگ مجھے ان ستر آدمیوں کا قاتل قرار دے کر مجھے بھی ہلاک کرنے کی کوشش کریں گے۔ ان سب باتوں سے واضح ہوتا ہے کہ آپ کا مقصد اس وقت ان کو ہلاک کرنا نہیں، بلکہ یہ ایک امتحان ہے جس سے لوگوں کو آزمانا مقصود ہے کہ وہ دوبارہ زندگی پا کر شکر بجالاتے ہیں، یا بدستور ناشکری کر کے اللہ تعالیٰ کا شکوہ کرنے لگتے ہیں۔"}