{"tafsir":"75:: حضرت موسیٰ ؑ کی قوم بنی اسرائیل کو ان کی وفات کے بعد بھی صدیوں تک باقی رہنا تھا اور حضرت موسیٰ ؑ نے دنیا اور آخرت کی بھلائی کی جو دعا کی تھی وہ بنی اسرائیل کی اگلی نسلوں کے لئے بھی تھی، اس لئے اللہ تعالیٰ نے ان کی دعا قبول کرتے وقت یہ بھی واضح فرمادیا کہ بنی اسرائیل کے جو لوگ نبی آخرالزماں حضرت محمد مصطفیٰ ﷺ کے زمانے میں موجود ہوں گے، ان کو دنیا اور آخرت کی بھلائی اسی صورت میں مل سکے گی جب وہ آنحضرت ﷺ پر ایمان لاکر ان کی پیروی کریں، آنحضرت ﷺ کا ذکر فرماتے ہوئے اللہ تعالیٰ نے آپ کی کچھ صفات بھی بیان فرمائیں، جن میں سے پہلی صفت یہ ہے کہ آپ نبی ہونے کے ساتھ رسول بھی ہوں گے، عام طور سے رسول کا لفظ ایسے پیغمبر کے لئے بولا جاتا ہے جو نئی شریعت لے کر آئے، لہذا اس لفظ سے اشارہ کردیا گیا کہ آنحضرت ﷺ نئی شریعت لے کر آئیں گے، جس میں کچھ فروعی احکام تورات کے احکام سے مختلف بھی ہوسکتے ہیں اور بنی اسرائیل کو اس وقت یہ نہ کہنا چاہیے کہ یہ تو ہماری شریعت سے مختلف احکام بیان کررہے ہیں، اس لئے ان پر کیسے ایمان لائیں ؟ چنانچہ پہلے سے بتایا جارہا ہے کہ ہر دور کے تقاضے مختلف ہوتے ہیں اور جو رسول نئی شریعت لے کر آتے ہیں ان کے فروعی احکام پہلے احکام سے مختلف ہوسکتے ہیں، آنحضرت ﷺ کی دوسری صفت یہ بیان فرمائی گئی ہے کہ آپ امی ہوں گے، یعنی لکھتے پڑھتے نہیں ہوں گے، عام طور سے بنی اسرائیل امی نہیں تھے ؛ بلکہ نسلی عربوں کو امی کہا جاتا تھا (2: 78۔ 3: 20۔ 2: 63) اور خود یہودی عرب نسل کے لوگوں کے لئے کسی قدر حقارت کے پیرائے میں استعمال کرتے تھے (دیکھئے سورة آل عمران 3: 75) اس لئے اس لفظ سے یہ اشارہ بھی دے دیا گیا کہ وہ بنی اسرائیل کے بجائے عربوں کی نسل سے مبعوث ہوں گے، آپ کی تیسری صفت یہ بیان فرمائی گئی ہے کہ آپ کا ذکر مبارک تورات اور انجیل دونوں میں موجود ہوگا، اس سے ان بشارتوں کی طرف اشارہ ہے جو آپ کی تشریف آوری سے متعلق ان مقدس کتابوں میں دی گئی تھیں، آج بھی بہت سی تحریفات کے باوجود بائبل میں متعدد بشارتیں موجود ہیں، تفصیل کے لئے دیکھئے حضرت مولانا رحمت اللہ کیرانوی ؒ کی کتاب اظہار الحق کا اردو ترجمہ بائبل سے قرآن تک مرتبہ راقم الحروف۔\n 76: اس سے ان سخت احکام کی طرف اشارہ ہے جو یہودیوں پر عائد کیے گئے تھے۔ ان میں سے کچھ احکام تو خود تورات میں تھے اور اللہ تعالیٰ نے اپنی حکمت سے اس وقت یہودیوں کو ان کا پابند کیا تھا۔ بعض سخت احکام ان کی نافرمانیوں کی سزا کے طور پر نافذ کیے گئے تھے جس کا ذکر سورة نساء (160:4) میں گذرا ہے اور بہت سے احکام یہودی علماء نے اپنی طرف سے گھڑ لیے تھے۔ شاید ”بوجھ“ سے پہلی اور دوسری قسم کی طرف اور گلے کے طوق سے تیسری قسم کے احکام کی طرف اشارہ ہو۔ بتایا جا رہا ہے کہ آنحضرت ﷺ ان احکام کو منسوخ کر کے ایک آسان اور معتد شریعت لائیں گے۔","translation":"جو اس رسول یعنی نبی امی کے پیچھے چلیں جس کا ذکر وہ اپنے پاس تورات اور انجیل میں لکھا ہوا پائیں گے (75) جو انہیں اچھی باتوں کا حکم دے گا، برائیوں سے روکے گا، اور ان کے لیے پاکیزہ چیزوں کو حلال اور گندی چیزوں کو حرام قرار دے گا، اور ان پر سے وہ بوجھ اور گلے کے وہ طوق اتار دے گا جو ان پر لدے ہوئے تھے۔ (76) چنانچہ جو لوگ اس (نبی) پر ایمان لائیں گے اس کی تعظیم کریں گے اس کی مدد کریں گے، اور اس کے ساتھ جو نور اتارا گیا ہے اس کے پیچھے چلیں گے تو وہی لوگ فلاح پانے والے ہوں گے۔"}