{"tafsir":"80: یہ واقعہ بھی اختصار کے ساتھ سورة بقرہ (2۔ 65، 66) میں گزرا ہے، خلاصہ یہ ہے کہ سنیچر کو عربی اور عبرانی زبان میں سبت کہتے ہیں، یہودیوں کے لئے اسے ایک مقدس دن قرار دیا گیا تھا، جس میں ان کے لئے معاشی سرگرمیاں ممنوع تھیں، جن یہودیوں کا یہاں ذکر ہے وہ (غالباً حضرت داؤد ؑ کے زمانے میں) کسی سمندر کے کنارے رہتے تھے، اور مچھلیاں پکڑا کرتے تھے، سنیچر کے دن مچھلیاں پکڑ نا ان کے لئے ناجائز تھا، مگر شروع میں انہوں نے کچھ حیلے کرکے اس حکم کی خلاف ورزی کرنی چاہی، اور پھر کھلم کھلا مچھلیاں پکڑنی شروع کردیں، کچھ نیک لوگوں نے انہیں سمجھایا مگر وہ باز نہ آئے، بالآخر ان پر عذاب آیا اور ان کی صورتیں مسخ کرکے انہیں بندر بنادیا گیا، سورة بقرہ میں جو الفاظ استعمال ہوئے ہیں ان سے معلوم ہوتا ہے کہ یہ واقعہ اگرچہ موجودہ بائبل میں موجود نہیں ہے لیکن عرب کے یہودی اس سے خوب اچھی طرح واقف تھے \n 81: جب کوئی قوم نافرمانی پر کمر باندھ لیتی ہے تو بعض اوقات اللہ تعالیٰ اسے ڈھیل دیتے ہیں جیسا کہ آگے آیت نمبر 182 میں خود اللہ تعالیٰ نے بیان فرمایا ہے۔ سنیچر کے دن معاشی سرگرمیوں سے باز رہنا اپنی ذات میں کچھ اتنا ناقابل برداشت نہیں تھا، لیکن جس قوم کی سرشت ہی میں نافرمانی تھی، اس نے جب کسی معقول وجہ کے بغیر احکام کی خلاف ورزی شروع کی تو اللہ تعالیٰ نے یہ ڈھیل دی کہ سنیچر کے دن مچلیاں اتنے افراط کے ساتھ نظر آنے لگیں کہ دوسرے دنوں میں اتنے افراط کے ساتھ نظر نہیں آتی تھیں۔ اس سے ان کو نافرمانی کا اور حوصلہ ہوا، اور وہ یہ نہ سمجھے کہ یہ اللہ تعالیٰ کی طرف ڈھیل اور آزمائش ہے۔ اور انہوں نے ایسے ایسے حیلے کیے کہ سنیچر کے دن مچھلی کی دم میں رسی اٹکا کر اسے زمین کی کسی چیز سے باندھ دیا۔ اور اتوار کے دن اسے پکا کھایا۔ جب ان حیلوں سے نافرمانی کا حوصلہ بڑھا تو کھلم کھلا شکار شروع کردیا۔ اس سے یہ سبق ملتا ہے کہ اگر کسی شخص کو گناہ کے وافر مواقع میسر آرہے ہوں تو اسے ڈرنا چاہیے کہ یہ کہیں اللہ تعالیٰ کی طرف سے ڈھیل نہ ہو جس کے بعد وہ ایک دم پکڑ لیا جائے۔","translation":"اور ان سے اس بستی کے بارے میں پوچھو جو سمندر کے کنارے آباد تھی، جب وہ سبت (سینچر) کے معاملے میں زیادتیاں کرتے تھے۔ (80) جب ان (کے سمندر) کی مچھلیاں سینچر کے دن تو اچھل اچھل کر سامنے آتی تھیں، اور جب وہ سینچر کا دن نہ منا رہے ہوتے تو وہ نہیں آتی تھیں۔ اس طرح ان کی مسلسل نافرمانیوں کی وجہ سے ہم انہیں آزماتے تھے۔ (81)"}