{"text":"39: ثمود بھی قوم عاد ہی کی نسل سے پیدا ہوئی تھی اور ظاہر یہ ہے کہ حضرت ہود ؑ اور ان کے مومن ساتھی جو عذاب سے بچ گئے تھے یہ ان کی اولاد تھی اور ثمود ان کے دادا کا نام تھا، اسی لئے ان کو عاد ثانیہ بھی کہا جاتا ہے، یہ قوم عرب اور شام کے درمیان اس علاقے میں آباد تھی جس کو اس وقت حجر کہا جاتا تھا اور آج کل اسے مدائن صالح کہتے ہیں، اور آج بھی ان کے گھروں اور محلات کے کھنڈر موجود ہیں اور پہاڑوں سے تراشی ہوئی عمارتوں کے آثار جن کا ذکر آیت 74 میں ہے آج بھی وہاں دیکھے جاسکتے ہیں، عرب مشرکین جب تجارتی سفر پر شام جاتے تو یہ کھنڈر ایک نشان عبرت کے طور پر ان کے راستے میں پڑتے تھے اور قرآن کریم نے کئی مقامات پر انہیں اس کی طرف توجہ دلائی ہے، اس قوم میں بھی رفتہ رفتہ بت پرستی کی بیماری پیدا ہوگئی تھی، اور اس کے نتیجے میں بہت سی عملی خرابیاں پھیل گئی تھیں، حضرت صالح ؑ اسی قوم کے ایک فرد تھے جن کو اللہ تعالیٰ نے ان کو راہ راست دکھانے کے لئے پیغمبر بناکر بھیجا، لیکن یہاں بھی وہی صورت پیش آئی کہ قوم کی اکثریت نے ان کی بات نہیں مانی، حضرت صالح ؑ نے جوانی سے بڑھاپے تک مسلسل ان کو تبلیغ جاری رکھی، آخر کار ان لوگوں نے یہ مطالبہ کیا کہ اگر آپ ہمارے سامنے کے پہاڑ سے کوئی اونٹنی نکال کر دکھادیں گے تو ہم ایمان لے آئیں گے، حضرت صالح ؑ نے دعا فرمائی اور اللہ تعالیٰ نے پہاڑ سے اونٹنی بھی نکال کر دکھادی، اس پر کچھ لوگ تو ایمان لے آئے، مگر بڑے بڑے سردار اپنے عہد سے پھرگئے اور نہ صرف یہ کہ اپنی ضد پر اڑے رہے ؛ بلکہ جو دوسرے لوگ ایمان لانے کا ارادہ کررہے تھے انہیں بھی روک دیا، حضرت صالح ؑ کو اندیشہ ہوا کہ ان کی عہد شکنی کی وجہ سے ان پر اللہ کا عذاب آجائے گا، اس لئے انہوں نے فرمایا کہ کم از کم اللہ تعالیٰ کی پیدا کی ہوئی اس اونٹنی کو تم آزاد چھوڑے رکھو، اور اسے کوئی تکلیف نہ پہنچاؤ، اور اونٹنی کو چونکہ پورے کنویں کا پانی درکار ہوتا تھا، اس لئے اس کی باری مقرر کردی کہ ایک دن اونٹنی کنویں کا پانی پیئے گی اور دوسرے دن آبادی کے لوگ پانی لیں گے، لیکن ہوا یہ کہ قوم کے کچھ لوگوں نے اونٹنی کو مار ڈالنے کا ارادہ کیا اور آخر کار ایک شخص نے جس کا نام قذار تھا اس کو قتل کرڈالا، اس موقع پر حضرت صالح ؑ نے انہیں متنبہ کیا کہ اب ان کی زندگی کے صرف تین دن باقی رہ گئے ہیں، جس کے بعد وہ عذاب سے ہلاک کردئے جائیں گے، بعض روایات میں ہے کہ انہوں نے یہ بھی بتادیا تھا کہ ان تین دنوں میں سے ہر دن ان کے چہروں کا رنگ بدل جائے گا یعنی پہلے دن رنگ پیلا، دوسرے دن سرخ اور تیسرے دن کالا ہوجائے گا، اس کے باوجود اس ضدی قوم نے توبہ اور استغفار کرنے کے بجائے خود حضرت صالح ؑ کو قتل کرنے کا منصوبہ بنایا، جس کا ذکر قرآن کریم نے سورة نمل میں فرمایا ہے ؛ لیکن اللہ تعالیٰ نے انہیں راستے ہی میں ہلاک کردیا اور ان کا منصوبہ دھرہ رہ گیا، آخر کار تین دن اسی طرح گزرے جیسے حضرت صالح ؑ نے فرمایا تھا اسی حالت میں شدید زلزلہ آیا اور آسمان سے ایک ہیبت ناک چیخ کی آواز نے ان سب کو ہلاک کرڈالا۔ حضرت صالح ؑ اور ان کی قوم کا تفصیلی ذکر سورة ہود (61:11) سورة شعراء (141:126) سورة نمل (45:27) اور سورة قمر (23:54) میں آیا ہے۔ نیز سورة حجر، سورة ذاریات، سورة نجم سورة الحاقہ اور سورة شمس میں بھی ان کے مختصر حوالے آئے ہیں۔"}