{"tafsir":"41: مدین ایک قبیلے کا نام ہے اور اسی کے نام پر ایک بستی بھی ہے جس میں حضرت شعیب ؑ کو پیغمبر بناکر بھیجا گیا تھا، ان کا زمانہ حضرت موسیٰ ؑ سے کچھ پہلے کا ہے اور بعض روایات میں ہے کہ وہی حضرت موسیٰ ؑ کے خسر تھے، یہ ایک سرسبز شاداب علاقہ تھا اور یہاں کے لوگ خاصے خوش حال تھے، رفتہ رفتہ ان میں کفر وشرک کے علاوہ بہت سی بد عنوانیاں رواج پاگئیں، ان کے بہت سے لوگ ناپ تول میں دھوکا دیتے تھے، بہت سے زور آور لوگوں نے راستوں پر چوکیاں بنا رکھی تھیں جو گزرنے والوں سے زبردستی کا ٹیکس وصول کرتے تھے، کچھ لوگ ڈاکے بھی ڈالتے تھے، نیز جو لوگ حضرت شعیب ؑ کے پاس جاتے نظر آتے انہیں روکتے اور تنگ کرتے تھے، ان کی بد عنوانیوں کا ذکر اگلی دو آیتوں میں آرہا ہے، حضرت شعیب ؑ کو اللہ تعالیٰ نے اپنی قوم کے لئے پیغمبر بناکر بھیجا، انہوں نے مختلف طریقوں سے اپنی قوم کو راہ راست پر لانے کی کوشش کی، اللہ تعالیٰ نے تقریر اور خطابت کا خاص ملکہ عطا فرمایا تھا اسی لئے وہ خطیب الانبیاء کے لقب سے مشہور ہیں ؛ لیکن ان کی مؤثر تقریروں کا قوم نے کچھ اثر نہ لیا اور آخر کار وہ اللہ تعالیٰ کے عذاب کا نشانہ بنی، حضرت شعیب ؑ اور ان کی قوم کے واقعات سب سے زیادہ تفصیل سے سورة ٔ ہود (11: 84 تا 95) میں آئے ہیں اور سورة حجر (15: 78) میں مختصر حوالہ آیا ہے۔\n 42: اس سے معلوم ہوتا ہے کہ یہ قوم ناپ تول میں کمی کے علاوہ دوسرے طریقوں سے بھی لوگوں کی حق تلفی کیا کرتی تھی، اس آیت میں لفظ بخس استعمال کیا گیا ہے، جس کے لفظی معنی کمی کرنے کے ہیں اور یہ لفظ خاص طور پر کسی کا حق مارلینے کے معنی میں کثرت سے استعمال ہوتا ہے اور قرآن کریم میں یہ فقرہ تین جگہ بڑی تاکید کے ساتھ آیا ہے اور اس میں دوسروں کی ملکیت کے احترام پر زور دیا گیا ہے، اس احترام میں یہ بات بھی داخل ہے کہ کسی کے مال یا جائیداد پر اس کی مرضی کے بغیر قبضہ کرلیا جائے اور یہ بھی کہ کسی کی کوئی بھی چیز اس کی خوش دلی کے بغیر استعمال کی جائے۔\n 43: اس کی تشریح کیلئے دیکئے پیچے آیت نمبر 56 کا حاشیہ","translation":"اور مدین کی طرف ہم نے ان کے بھائی شعیب کو بھیجا۔ (41) انہوں نے کہا : اے میری قوم کے لوگو ! اللہ کی عبادت کرو۔ اس کے سوا تمہارا کوئی معبود نہیں ہے۔ تمہارے پاس تمہارے پروردگار کی طرف سے ایک روشن دلیل آچکی ہے۔ لہذا ناپ تول پورا پورا کیا کرو۔ اور جو چیزیں لوگوں کی ملکیت میں ہیں ان میں ان کی حق تلفی نہ کرو۔ (42) اور زمین میں اس کی اصلاح کے بعد فساد برپا نہ کرو۔ (43) لوگو ! یہی طریقہ تمہارے لیے بھلائی کا ہے، اگر تم میری بات مان لو۔"}