{"tafsir":"9: یہاں سے آیت نمبر 26 تک جس واقعے کی طرف اشارہ ہے، اس کا پس منظر یہ ہے کہ آنحضرت ﷺ کے مدینہ منورہ تشریف لانے کے بعد اسلام کو جو تیز رفتار فروغ حاصل ہوا، اس پر کفر کی طاقتیں دانت پیس رہی تھیں۔ خود مدینہ منورہ میں ان منافقوں کا ایک گروہ موجود تھا جو زبان سے تو اسلام لے آئے تھے، لیکن ان کے دلوں میں آنحضرت ﷺ اور صحابہ کے خلاف کینہ بھرا ہوا تھا، اور وہ مسلمانوں کو بدنام کرنے اور تکلیف پہنچانے کا کوئی موقع چھوڑتے نہیں تھے۔ اسی زمانے میں غزوہ بنو المصطلق پیش آیا جس میں ایک جگہ پڑاؤ ڈالا گیا تو حضرت عائشہ کا ایک ہار گم ہوگیا، اور وہ اس کی تلاش میں جنگل کی طرف نکل گئیں۔ آنحضرت ﷺ کو اس واقعے کا علم نہیں تھا، اس لیے آپ نے لشکر روانہ ہونے کا حکم دے دیا، اور جب حضرت عائشہ ؓ واپس آئیں تو قافلہ جا چکا تھا۔ اللہ تعالیٰ نے انہیں ذہانت اور تحمل کا غیر معمولی مقام عطا فرمایا تھا، وہ پریشان ہو کر ادھر ادھر جانے کے بجائے اسی جگہ بیٹھ گئیں جہاں سے روانہ ہوئی تھیں، کیونکہ انہیں یقین تھا کہ آنحضرت ﷺ کو جب ان کی غیر موجودگی کا احساس ہوگا تو آپ ان کی تلاش میں اسی جگہ یا تو خود تشریف لائیں گے یا کسی کو بھیجیں گے۔ قافلوں کا ایک دستور یہ تھا کہ ایک شخص کو قافلے کے بالکل پیچھے اس طرح رکھا جاتا تھا کہ قافلے کی روانگی کے بعد وہ یہ دیکھتا ہوا آئے کہ کوئی چیز گری پڑی تو نہیں رہ گئی ہے۔ اس قافلے میں آپ نے حضرت صفوان بن معطل ؓ کو اس کام پر مقرر فرمایا تھا۔ وہ جب اس جگہ سے گذرے جہاں حضرت عائشہ ؓ بیٹھی ہوئی تھیں تو انہیں اس سانحے کا علم ہوا، اور پھر انہوں نے اپنا اونٹ ام المومنین کو پیش کیا، جس پر سوار ہو کر وہ مدینہ منورہ پہنچ گئیں۔ اس واقعے کو منافقین کے سردار عبداللہ بن ابی نے ایک بتنگڑ بنا لیا کہ حضرت عائشہ ؓ نے تنہا صفوان بن معطل کے ساتھ سفر کیا ہے، اور اس کی وجہ سے آپ پر وہ گھناؤنی تہمت لگائی جسے زبان سے نکالنا بھی ایک غیرت مند مسلمان کے لیے مشکل ہے۔ عبداللہ بن ابی نے اس تہمت کو اتنی شہرت دی کہ وہ تین سادہ لوح مسلمان بھی اس کے فریب میں آگئے، اور اس طرح کئی دن تک یہ بےسروپا باتیں لوگوں میں پھیلائی جاتی رہیں۔ بالاخر سورة نور کی یہ آیات نازل ہوئیں جنہوں نے حضرت عائشہ ؓ کی مکمل براءت ظاہر کرنے کے ساتھ ان لوگوں کو سخت وعیدیں سنائیں جو اس سازش کے کرتا دھرتا تھے۔\n 10: یعنی اگرچہ بظاہر یہ واقعہ بڑا تکلیف دہ تھا، لیکن انجام کے لحاظ سے تمہارے حق میں بہتر ہی بہتر ہے، اول تو اس لیے کہ اس کے ذریعے وہ لوگ بےنقاب ہوگئے جو خانوادہ نبوت کے خلاف سازشیں کرتے تھے، دوسرے حضرت عائشہ ؓ کا مقام بلند لوگوں پر ظاہر ہوا تیسرے اس واقعے سے مسلمانوں کو جو تکلیف پہنچی، اس پر انہیں بڑا ثواب ہوا۔\n 11: اس سے مراد منافقوں کا سردار عبداللہ بن ابی ہے جس نے یہ ساری سازش تیار کی تھی۔","translation":"یقین جانو کہ جو لوگ یہ جھوٹی تہمت گھڑ کر لائے ہیں وہ تمہارے اندر ہی کا ایک ٹولہ ہے (9) تم اس بات کو اپنے لیے برا نہ سمجھو، بلکہ یہ تمہارے لیے بہتر ہی بہتر ہے۔ (10) ان لوگوں میں سے ہر ایک کے حصے میں اپنے کیے کا گناہ آیا ہے۔ اور ان میں سے جس شخص نے اس (بہتان) کا بڑا حصہ اپنے سر لیا ہے اس کے لیے تو زبردست عذاب ہے۔ (11)"}