{"text":"18: سجاوٹ سے مراد جسم کے وہ حصے ہیں جن پر زیور پہنا جاتا ہے، یا خوشنما کپڑے پہنے جاتے ہیں۔ لہذا اس آیت کریمہ نے عورتوں کو یہ حکم دیا ہے کہ وہ غیر محرم مردوں کے سامنے اپنا پورا جسم کسی ایسی چادر یا برقع سے چھپائیں جو ان کے سجاوٹ کے مقامات کو چھپالے۔ البتہ ان مقامات میں سے کوئی حصہ کام کاج کے دوران بےاختیار کھل جائے، یا کسی ضرورت کی وجہ سے کھولنا پڑے تو اسے یہ کہہ کر مستثنی کردیا گیا ہے کہ سوائے اس کے جو خود ہی ظاہر ہوجائے۔ تفسیر ابن جریر کے مطابق حضرت عبداللہ بن مسعود ؓ نے اس کی تفسیر میں فرمایا کہ اس سے مراد وہ چادر ہے جو عورت نے اوڑھی ہوئی ہو کہ اس کو چھپانا ممکن نہیں ہے۔ اور حضرت عبداللہ بن عباس ؓ نے اس کی تفسیر میں فرمایا کہ ضرورت کے وقت عورت کو اگر اپنا چہرہ اور ہتھیلیوں تک ہاتھ کھولنے پڑیں تو اس آیت نے اس کی بھی اجازت دی ہے۔ لیکن چونکہ چہرہ ہی عورت کے حسن کا اصل مرکز ہوتا ہے۔ اس لیے عام حالات میں اس کو بھی چھپانے کا حکم ہے جیسا کہ سورة احزاب : 59 میں بیان فرمایا گیا ہے البتہ صرف ضرورت کے مواقع پر اسے کھولنے کی اجازت ہے، اور اس حالت میں بھی مردوں کو یہ حکم ہے کہ وہ اپنی نگاہیں نیچی رکھیں، جیسا کہ پچھلی آیت میں گذرا۔\n 19: یہاں سے ان افراد کی فہرست دی جا رہی ہے جن سے عورتوں کو پردہ کرنے کی ضرورت نہیں ہے \n 20: بعض مفسرین نے فرمایا ہے کہ اس سے مراد مسلمان عورتیں ہیں، لہذا غیر مسلم عورتوں سے بھی پردہ ضروری ہے، لیکن چونکہ متعدد احادیث سے ثابت ہے کہ غیر مسلم عورتیں ازواج مطہرات کے پاس جایا کرتی تھیں، اس لیے امام رازی اور علامہ آلوسی نے اس بات کو ترجیح دی ہے کہ اپنی عورتوں سے مراد اپنے میل جول کی عورتیں ہیں تو چاہے مسلمان ہوں یا کافر۔ ان سے پردہ واجب نہیں ہے (معارف القرآن)\n 21: اس سے مراد باندیاں ہیں، چاہے مسلمان ہوں یا غیر مسلم۔ اور بعض فقہاء نے اپنے غلاموں کو بھی اس میں شامل قرار دیا ہے، یعنی ان سے پردہ نہیں ہے۔\n 22: قرآن کریم میں اصل لفظ ”تابعین“ استعمال ہوا ہے، اس کے معنی ایسے لوگ ہیں جو کسی دوسرے کے تابع ہوں۔ اکثر مفسرین نے اس کا مطلب یہ بتایا ہے کہ اس زمانے میں کچھ بےعقل قسم کے لوگ ایسے ہوتے تھے جو کسی گھر والے کے اس لیے پیچھے لگ جاتے تھے کہ وہ انہیں کھانا کھلا دے، یا کسی مہمان کے طفیلی بن کر کسی کے گھر میں چلے جاتے تھے اور کھانے کے سوا انہیں کسی سے سروکار نہیں ہوتا تھا، اور نہ ان میں کوئی جنسی خواہش ہوتی تھی۔ البتہ امام شعبی نے فرمایا ہے کہ اس سے مراد وہ نوکر چاکر ہیں جو اتنے بوڑھے ہوچکے ہوں کہ ان کے دل میں عورتوں کی طرف کوئی میلان باقی نہ رہا ہو۔ (تفسیر ابن جریر)\n 23: یعنی وہ نابالغ بچے جن کو ابھی مرد و عورت کے جنسی تعلقات کا کچھ پتہ ہی نہ ہو۔\n 24: یعنی اگر پاؤں میں پازیب پہنی ہوئی ہے تو اس طرح نہ چلیں کہ پازیب کی آواز سنائی دے، یا زیوروں کے ایک دوسرے سے ٹکرا کر بجنے کی آواز غیر محرم مرد سنیں۔"}