{"text":"44: ان آیات کا پس منظر یہ ہے کہ بعض افراد جو نابینا یا پاؤں سے معذور یا بیمار ہوتے تھے وہ دوسروں کے ساتھ مل کر کھانا کھانے سے اس لئے شرماتے تھے کہ شاید دوسروں کو ان کے ساتھ کھاتے ہوئے کراہیت محسوس ہو، اور بعض معذور افراد یہ بھی سوچتے تھے کہ کہیں ایسا نہ ہو کہ وہ اپنی معذوری کی وجہ سے دوسروں سے زیادہ جگہ گھیر لیں یا نابینا ہونے کی بنا پر دوسروں سے زیادہ کھالیں، دوسری طرف صحت مند لوگ بھی بعض اوقات یہ خیال کرتے تھے کہ کہیں یہ اپنی معذوری کی وجہ سے دوسروں کا ساتھ نہ دے سکیں کم کھائیں اور مشترک کھانے میں سے اپنا مناسب حصہ نہ لے سکیں، یہ احساس ان حضرات کے دل میں اسلام کے ان احکام نے پیدا کیا جن کی رو سے کسی دوسرے کو اپنی طرف سے ادنی سی تکلیف پہنچانا گناہ قرار دیا گیا ہے، نیز مشترک چیزوں کے استعمال میں احتیاط کی تاکید کی گئی ہے، ان آیات نے یہ واضح فرمایا کہ بےتکلف مقامات پر اتنی باریک بینی کی ضرورت نہیں ہے۔\n 45: عرب کے لوگوں میں یہ عام رواج تھا کہ ان کے گھروں میں آنے والے یہ رشتہ دار جن کا اس آیت میں ذکر ہے اگر ان کی اجازت کے بغیر بھی ان کے گھر سے کچھ کھالیتے تو وہ نہ صرف یہ کہ برا نہیں مناتے تھے ؛ بلکہ خوش ہوتے تھے، جب یہ احکام آئے کہ کسی کی چیز اس کی خوش دلی کے بغیر استعمال کرنا جائز نہیں تو بعض صحابہ یہاں تک پرہیز کرنے لگے کہ اگر کسی شخص کی غیر موجودگی میں اس کے گھر جاتے اور اس کی بیوی بچے ان کی کچھ خاطر تواضع کرتے تو ان کو کھانے میں تردد ہوتا تھا کہ گھر کا اصل مالک تو موجود نہیں ہے اس لئے ہمیں اس کی اجازت کے بغیر کھانا نہیں چاہیے، اس آیت نے واضح فرمادیا کہ جہاں یہ بات یقینی ہو کہ اصل مالک ہمارے کھانے سے خوش ہوگا، وہاں کھانے میں کچھ حرج نہیں ہے، البتہ جہاں یہ بات مشکوک ہو وہاں یہ حکم نہیں ہے چاہے کتنے قریبی رشتہ دار کا گھرہو۔\n 46: بعض حضرات جب جہاد کے لئے جاتے تو اپنے گھر کی چابیاں ایسے معذور افراد کے حوالے کرجاتے جو جہاد میں جانے کے لائق نہیں تھے، اور ان کو یہ بھی کہہ جاتے تھے کہ ہمارے گھر کی کوئی چیز اگر آپ کھانا چاہیں تو کھالیا کریں، اس کے باوجود یہ معذور حضرات احتیاط کی وجہ سے کھانے سے پرہیز کرتے تھے، اس آیت نے ان کو بھی یہ ہدایت فرمادی کہ اتنی احتیاط کی ضرورت نہیں ہے، جب مالک کی طرف سے چابیاں تک آپ کے حوالے کردی گئیں ہیں اور اجازت بھی دے دی گئی ہے تو اب کھانے میں کچھ حرج نہیں ہے۔"}