{"text":"31: جیسا کہ پیچھے حاشیہ نمبر 27 میں گذرا ہے، کافروں نے صلح نامہ لکھواتے وقت آنحضرت ﷺ کا نام مبارک محمد رسول اللہ لکھوانے سے انکار کیا تھا، اور صرف محمد بن عبداللہ لکھوایا تھا، اللہ تعالیٰ نے اس آیت میں آپ کو محمد رسول اللہ فرما کر اشارہ دیا ہے کہ کافر لوگ اس حقیقت سے چاہے کتنا انکار کریں، اللہ تعالیٰ نے اس کو قیامت تک قرآن کریم میں ثبت فرمادیا ہے۔\n 32: اگرچہ تورات میں بہت سی تبدیلیاں ہوچکی ہیں، لیکن بائبل کے جن صحیفوں کو آج کل یہودی اور عیسائی مذہب میں تورات کہا جاتا ہے، ان میں سے ایک یعنی استثناء :2، 3 میں ایک عبارت ہے جس کے بارے میں یہ احتمال ہے کہ شاید قرآن کریم نے اس کی طرف اشارہ فرمایا ہو۔ وہ عبارت یہ ہے :\n خداوند سینا سے آیا، اور شعیر سے ان پر آشکار ہوا، اور کوہ فاران سے جلوہ گر ہوا، اور وہ دس ہزار قدسیوں میں سے آیا۔ اس کے داہنے ہاتھ پر ان کے لیے آتشیں شریعت تھی۔ وہ بیشک قوموں سے محبت رکھتا ہے، اس کے سب مقدس لوگ تیرے ہاتھ میں ہیں، اور وہ تیرے قدموں میں بیٹھے ایک ایک تیری باتوں سے مستفیض ہوگا۔ (استثناء :2، 3)\n واضح رہے کہ یہ حضرت موسیٰ ؑ کا آخری خطبہ ہے، جس میں یہ فرمایا جا رہا ہے کہ پہلے اللہ تعالیٰ کی وحی کوہ سینا پر اتری، جس سے مراد تورات ہے، پھر کوہ شعیر پر اترے گی، جس سے مراد انجیل ہے، کیونکہ کوہ شعیر وہ پہاڑ ہے، جسے آج جبل الخلیل کہتے ہیں، اور حضرت عیسیٰ ؑ کی تبلیغ کا مرکز تھا۔ پھر فرمایا گیا ہے کہ تیسری وحی کوہ فاران پر اترے گی، جس سے مراد قرآن کریم ہے، کیونکہ فاران اس پہاڑ کا نام ہے جس پر غار حرا واقع ہے۔ اور اس میں حضور اقدس ﷺ پر پہلی وحی نازل ہوئی۔ فتح مکہ کے موقع پر آنحضرت ﷺ کے صحابہ کی تعداد دس ہزار تھی، لہذا ”دس ہزار قدسیوں میں سے آیا“ سے ان صحابہ کی طرف اشارہ ہے۔ (واضح رہے کہ قدیم نسخوں میں دس ہزار کا لفظ ہے، اب بعض نسخوں میں اسے لاکھوں سے تبدیل کردیا گیا ہے)۔\n نیز قرآن کریم فرماتا ہے کہ یہ صحابہ کافروں کے مقابلے میں سخت ہیں۔ استثناء کی مذکورہ عبارت میں ہے کہ : اس کے داہنے ہاتھ پر ان کے لیے آتشیں شریعت تھی۔ قرآن کریم میں ہے کہ : وہ آپس میں ایک دوسرے کے لیے رحم دل ہیں۔ اور وہ استثناء کی مذکورہ عبارت میں ہے کہ : وہ بیشک قوموں سے محبت رکھتا ہے۔ اس لیے بات دور از قیاس نہیں ہے کہ قرآن کریم نے اس عبارت کا حوالہ دیا ہو، اور وہ تبدیل ہوتے ہوتے موجودہ استثناء کی عبارت کی شکل میں رہ گئی ہو۔\n 33: انجیل مرقس میں بالکل یہی تشبیہ ان الفاظ میں مذکور ہے۔ خدا کی بادشاہی ایسی ہے جیسے کوئی آدمی زمین میں بیج ڈالے اور رات کو سوئے اور دن کو جاگے، اور وہ بیج اس طرح اگے اور بڑھے کہ وہ نہ جانے زمین آپ سے آپ پھل لاتی ہے پہلے پتی، پھر بالیں، پھر بالوں میں تیار دانے۔ پھر جب اناج پک چکا تو وہ فی الفور درانتی لگاتا ہے کیونکہ کاٹنے کا وقت آپہنچا۔ (مرقس : 26 تا 29)\n یہی تشبیہ انجیل لوقا : 18، 19 اور انجیل متی : 31 میں بھی موجود ہے۔"}