{"tafsir":"3: مشہور تفسیر کے مطابق ان آیتوں میں ایک واقعے کی طرف اشارہ ہے جو حضور اقدس ﷺ سے صحیح مسلم کی ایک حدیث میں منقول ہے۔ اور وہ یہ کہ پچھلی کسی امت میں ایک بادشاہ تھا جو ایک جادوگر سے کام لیا کرتا تھا۔ جب وہ جادوگر بوڑھا ہوگیا تو اس نے بادشاہ سے کہا کہ میرے پاس کوئی لڑکا بھیج دیا کرو جسے میں جادو سکھاؤں، تاکہ میرے بعد وہ تمہارے کام آسکے۔ بادشاہ نے ایک لڑکے کو جادوگر کے پاس بھیجنا شروع کردیا۔ یہ لڑکا جب جادوگر کے پاس جاتا تو راستے میں ایک عبادت گزار شخص کے پاس سے گذرتا جو حضرت عیسیٰ ؑ کے اصلی دین پر تھا (ایسے شخص کو راہب کہتے تھے) اور توحید کا قائل تھا۔ یہ لڑکا اس کے پاس بیٹھ جاتا اور اس کی باتیں سنتا تھا جو اسے اچھی لگتی تھیں۔ ایک دن وہ جا رہا تھا تو راستے میں ایک بڑا جانور نظر آیا جس نے لوگوں کا راستہ روکا ہوا تھا (بعض روایتوں میں ہے کہ وہ جانور شیر تھا، اور لوگ اس سے ڈر رہے تھے)۔ لڑکے نے ایک پتھر اٹھایا، اور اللہ تعالیٰ سے دعا کی کہ یا اللہ ! اگر راہب کی باتیں آپ کو جادوگر کی باتوں سے زیادہ پسند ہیں تو اس پتھر سے اس جانور کو مروا دیجئے۔ اب جو اس نے پتھر اس جانور کی طرف پھینکا تو جانور مرگیا، اور لوگوں کا راستہ کھل گیا۔ اس کے بعد لوگوں کو اندازہ ہوا کہ اس لڑکے کے پاس کوئی خاص علم ہے۔ چنانچہ ایک اندھے شخص نے اس سے درخواست کی کہ اس کی بینائی واپس آجائے۔ لڑکے نے اس سے کہا کہ شفا دینے والا تو اللہ تعالیٰ ہے، اس لیے اگر تم یہ وعدہ کرو کہ اللہ تعالیٰ کی توحید پر ایمان لے آؤ گے تو میں تمہارے لیے اللہ تعالیٰ سے دعا کروں گا۔ اس نے یہ شرط مان لی۔ لڑکے نے دعا کی تو اللہ تعالیٰ نے اس کو بینائی عطا فرمادی، اور وہ توحید پر ایمان لے آیا۔ ان واقعات کی خبر جب بادشاہ کو ہوئی تو اس نے اس نابینا کو بھی گرفتار کرلیا، اور لڑکے اور راہب کو بھی۔ اور ان سب کو توحید کے انکار پر مجبور کیا۔ جب وہ نہ مانے تو اس نے اس نابینا شخص اور راہب کو تو آری سے چروا دیا اور لڑکے کے بارے میں اپنے نوکروں کو حکم دیا کہ اسے کسی اونچے پہاڑ پر لے جا کر نیچے پھینک دیں۔ لیکن جب وہ لوگ لڑکے کو لے کر گئے تو اس نے اللہ تعالیٰ سے دعا کی، پہاڑ پر زلزلہ آیا جس سے وہ لوگ مرگئے، اور لڑکا زندہ رہا۔ بادشاہ نے حکم دیا کہ اسے کشتی میں لے جا کر سمندر میں ڈبو دیا جائے۔ لڑکے نے پھر دعا کی، جس کے نتیجے میں کشتی الٹ گئی، وہ سب ڈوب گئے، اور لڑکا پھر سلامت رہا۔ بادشاہ جب عاجز آگیا تو لڑکے نے اس سے کہا کہ اگر تم مجھے واقعی مارنا چاہتے ہو تو اس کا ایک ہی طریقہ ہے، اور وہ یہ کہ تم سب لوگوں کو ایک میدان میں جمع کر کے مجھے سولی پر چڑھاؤ، اور اپنے ترکش سے تیر نکال کر کمان میں چڑھاؤ، اور یہ کہو کہ : اس اللہ کے نام پر جو اس لڑکے کا پروردگار ہے۔ پھر تیر سے میرا نشانہ لگاؤ۔ بادشاہ نے ایسا ہی کیا، اور تیر اس لڑکے کی کنپٹی پر جا کر لگا، اور اس سے وہ شہید ہوگیا۔ لوگوں نے جب یہ نظارہ دیکھا تو بہت سے ایمان لے آئے۔ اس موقع پر بادشاہ نے ان کو سزا دینے کے لیے سرکوں کے کناروں پر خندقیں کھدوا کر ان میں آگ بھڑکائی، اور حکم دیا کہ جو کوئی دین حق کو نہ چھوڑے، اسے ان خندقوں میں ڈال دیا جائے۔ چنانچہ اس طرح ایمان والوں کی ایک بڑی تعداد کو زندہ جلا دیا گیا۔\n صحیح مسلم کی اس حدیث میں یہ صراحت نہیں ہے کہ سورة بروج میں خندق والوں کا جو ذکر ہے، اس سے یہی واقعہ مراد ہے۔ محمد بن اسحاق نے اس سے ملتا جلتا ایک اور واقعہ بیان کیا ہے، اور اس کو سورة بروج کی تفسیر قرار دیا ہے۔ یہاں اس تفصیل کا موقع نہیں ہے۔ حضرت مولانا حفظ الرحمن صاحب سیوہاروی نے ”قصص القرآن“ میں اس پر بہت مفصل بحث کی ہے۔ اہل علم اس کی مراجعت فرمائیں۔","translation":"کہ خدا کی مار ہے ان خندق (کھودنے) والوں پر (3)"}