{"text":"5: شروع میں اللہ تعالیٰ نے آسمان کا مادہ پیدا فرما دیا تھا جو دھویں کی شکل میں تھا، پھر دو دن میں اسے سات آسمانوں کی صورت میں تبدیل فرما کر اس کا مستقل نظام قائم فرمایا۔\n 6: ”چلے آؤ“ کا مطلب یہ ہے کہ ہمارے حکم کے تابع بن جاؤ، ساتھ ہی یہ بھی فرما دیا گیا کہ تم خوشی سے ہمارے حکم کے تابع بننا نہ چاہو، تب بھی تمہیں زبردستی تابع بننا ہی پڑے گا، یعنی زمین اور آسمان میں وہی کام ہوں گے جن کا اپنی حکمت اور مصلحت کے مطابق تکوینی طور پر ہم حکم دیں گے، تمہارے اندر یہ قدرت پیدا نہیں کی گئی ہے کہ تم ہمارے تکوینی احکام کی مخالفت کرسکو، لہذا اگر تم خوشی سے نہیں چاہو گے تو زبردستی تمہیں کرنا وہی ہوگا جو ہمارا حکم ہے۔ اس میں یہ حقیقت واضح فرمائی گئی ہے کہ انسان کا معاملہ کائنات کی دوسری مخلوقات سے مختلف ہے، انسان اللہ تعالیٰ کی طرف سے دو قسم کے احکام کا پابند ہے، ایک تکوینی احکام ہیں، مثلا یہ کہ وہ کب پیدا ہوگا، کتنی عمر پائے گا، اسے کونسی بیماریاں لاحق ہوں گے، اس کی کتنی اولاد ہوگی، یہ سب باتیں اللہ تعالیٰ کے حکم کے تابع ہیں، اور ان معاملات میں انسان کائنات کی دوسری مخلوقات کی طرح اللہ تعالیٰ کے احکام کے تابع رہنے پر مجبور ہے۔ یہاں آسمان و زمین سے یہ مکالمہ حقیقی بھی ہوسکتا ہے، اور مجازی بھی، لیکن انسان کو بتانا یہ مقصود ہے کہ ان تکوینی احکام میں چونکہ ساری کائنات اللہ تعالیٰ کے حکم کے مطابق چلنے پر مجبور ہے، اس لیے وہ ان احکام پر خوشی سے چلے، یا ان پر ناخوش ہو، ہوگا وہی جو اللہ تعالیٰ چاہے گا۔ لہذا ایک بندہ ہونے کی وجہ سے انسان کو وہی طرز عمل اختیار کرنا چاہیے جو زمین اور آسمان نے کیا کہ انہوں نے کہ ہم تو خوشی خوشی اللہ تعالیٰ کے ہر حکم کے تابع رہیں گے۔ لہذا غیر اختیاری معاملات میں جو بات بھی پیش آئے، انسان کو اس پر اللہ تعالیٰ کا حکم سمجھ کر کم از کم عقلی طور پر راضی رہنا چاہیے۔\n اللہ تعالیٰ کے احکام کی ایک قسم اور ہے جنہیں تشریعی احکام کہا جاتا ہے، یعنی کونسی چیز حلال ہے، کونسی حرام، اللہ تعالیٰ کو کونسا کام پسند ہے، کونسا ناپسند۔ انسان کو حکم یہ دیا گیا ہے کہ وہ وہی کام کرے جو اللہ تعالیٰ کو پسند ہیں، لیکن اس بات پر اسے اس طرح مجبور نہیں کیا گیا جیسے تکوینی احکام پر وہ مجبور ہے، بلکہ یہ احکام دینے کے بعد اسے یہ اختیار بھی دیا گیا ہے کہ اگر وہ چاہے تو ان پر عمل کرے، اور اگر چاہے تو نافرمانی کا راستہ اختیار کرلے، اور یہی اس کا امتحان ہے جس کے نتیجے میں اس کے لیے جنت یا جہنم کا فیصلہ ہوگا۔ چونکہ دوسری مخلوقات کو اس امتحان میں نہیں ڈالا گیا، اس لیے ان کو نہ تشریعی احکام دئیے گئے ہیں، اور نہ نافرمانی کا اختیار دیا گیا ہے۔ ان احکام پر بھی انسان کو خوشی خوشی عمل کرنا چاہیے، کیونکہ اس کی ابدی زندگی کی صلاح و فلاح اسی پر موقوف ہے۔"}