{"tafsir":"10: آنحضرت ﷺ کو اللہ تعالیٰ نے بہت سے معجزات عطا فرمائے تھے، جن میں سب سے بڑا معجزہ خود قرآن کریم تھا ؛ کیونکہ آپ کے امی ہونے کے باوجود یہ فصیح وبلیغ کلام آپ پر نازل ہوا، تنہا یہی ایک معجزہ ایک حق کے طلب گار کے لئے کافی تھا ؛ لیکن کفار مکہ اپنی ضد اور عناد کی وجہ سے ہر روز نت نئے معجزات کا مطالبہ کرتے رہتے تھے، اس سلسلے میں جس قسم کے بیہودہ مطالبات وہ کرتے تھے ان کی ایک فہرست قرآن کریم نے سوہ بنی اسرائیل (15۔ 89) میں بیان فرمائی ہے، اس پر کبھی کبھی آنحضرت ﷺ کو بھی یہ خیال ہوتا تھا کہ اگر ان کے فرمائشی معجزات میں سے کوئی معجزہ دکھادیا جائے تو شاید یہ لوگ ایمان لاکر جہنم سے بچ جائیں، اس آیت میں آنحضرت ﷺ سے مشفقانہ خطاب کرتے ہوئے فرمایا گیا ہے کہ درحقیقت ان کے یہ مطالبات محض ہٹ دھرمی پر مبنی ہیں اور جیسا کے پیچھے آیت نمبر 25 میں کہا گیا ہے، یہ اگر ساری نشانیاں دیکھ لیں گے تب بھی ایمان نہیں لائیں گے، اس لئے ان کے مطالبات کا پورا کرنا نہ صرف بیکار ہے بلکہ اللہ تعالیٰ کی اس حکمت کے خلاف ہے جس کی طرف اشارہ آگے آیت نمبر : 37 میں آرہا ہے، ہاں اگر آپ خود ان کے مطالبات پورے کرنے کے لئے ان کے کہنے کے مطابق زمین کے اندر جانے کے لئے کوئی سرنگ بناسکیں یا آسمان پر چڑھنے کے لئے سیڑھی ایجاد کرسکیں تو یہ بھی کر دیکھیں اور ظاہر ہے کہ اللہ تعالیٰ کے حکم کے بغیر آپ ایسا نہیں کرسکتے، اس لئے یہ فکر چھوڑ دیجئے کہ ان کے منہ مانگے معجزات انہیں دکھائے جائیں، پھر اللہ تعالیٰ نے یہ بھی فرمایا ہے کہ اللہ تعالیٰ اگر چاہتا تو سارے انسانوں کو زبردستی ایک ہی دین کا پابند بنا دیتا ، لیکن درحقیقت انسان کو دنیا میں بھیجنے کا بنیادی مقصد امتحان ہے اور اس امتحان کا تقاضا یہ ہے کہ انسان زور زبردستی سے نہیں بلکہ خود اپنی سمجھ سے کام لے کر ان دلائل پر غور کرے جو پوری کائنات میں بکھرے پڑے ہیں اور پھر اپنی مرضی سے توحید رسالت اور آخرت پر ایمان لائے، انبیاء کرام لوگوں کی فرمائش پر نت نئے کرشمے دکھانے کے لئے نہیں ان دلائل کی طرف متوجہ کرنے کے لئے بھیجے جاتے ہیں اور آسمانی کتابیں اس امتحان کو آسان کرنے کے لے نازل کی جاتی ہیں مگر ان سے فائدہ وہی اٹھاتے ہیں جن کے دل میں حق کی طلب ہو، اور جو لوگ اپنی ضد پر اڑے رہنے کی قسم کھاچکے ہوں ان کے لئے نہ کوئی بڑی سے بڑی دلیل کار آمد ہوسکتی ہے نہ کوئی بڑے سے بڑا معجزہ۔","translation":"اور اگر ان لوگوں کا منہ موڑے رہنا تمہیں بہت بھاری معلوم ہورہا ہے تو اگر تم زمین کے اندر (جانے کے لیے) کوئی سرنگ یا آسمان میں (چڑھنے کے لیے) کوئی سیڑھی ڈھونڈ سکتے ہو تو ان کے پاس (ان کا منہ مانگا یہ) معجزہ لے آؤ۔ اور اگر اللہ چاہتا تو ان سب کو ہدایت پر جمع کردیتا۔ لہذا تم نادانوں میں ہرگز شامل نہ ہونا۔ (10)"}