{"tafsir":"11: یہاں سے آیت نمبر 24 تک جو واقعہ بیان ہوا ہے، اس کا خلاصہ یہ ہے کہ حضرت داؤد ؑ سے کوئی لغزش ہوگئی تھی، اللہ تعالیٰ نے اس لغزش پر تنبیہ کرنے کے لیے یہ دو آدمی غیر معمولی طریقے سے آپ کے پاس اس وقت بھیجے جب آپ اپنی عبادت گاہ میں تھے۔ ان دونوں نے اپنا ایک جھگڑا فیصلے کے لیے آپ کے سامنے پیش کیا۔ آپ نے فیصلہ تو فرما دیا لیکن اس کے ساتھ ہی آپ سمجھ گئے کہ یہ مقدمہ جو آپ کے سامنے پیش کیا گیا ہے، اس کے ذریعے اللہ تعالیٰ نے ایک لطیف پیرائے میں انہیں تنبیہ کی ہے، اس لیے وہ فوراً سجدے میں گرگئے، اور توبہ اور استغفار میں مشغول ہوگئے۔ قرآن کریم نے یہ تفصیل نہیں بتائی کہ وہ لغزش کیا تھی ؟ اور اس مقدمے کے پیش ہونے سے انہیں اس کا خیال کس طرح آیا ؟ کیونکہ قرآن کریم تو صرف یہ سبق دینا چاہتا ہے کہ بھول چوک تو انسان کی خاصیت ہے، بڑے بڑے بزرگوں، یہاں تک انبیائے کرام سے بھی معمولی قسم کی لغزشیں ہوجاتی ہیں، لیکن یہ حضرات اپنی کسی لغزش پر اصرار نہیں فرماتے، بلکہ جونہی اپنی غلطی واضح ہوتی ہے، فوراً اللہ تعالیٰ سے رجوع کر کے اس پر توبہ اور استغفار کرتے ہیں۔ یہ عملی سبق حضرت داؤد ؑ کے اس واقعے کی تفصیل جاننے پر موقوف نہیں ہے۔ البتہ جو حضرات مفسرین تفصیل میں گئے ہیں، انہوں نے مختلف باتیں کہی ہیں۔ اس سلسلے میں طرح طرح کی داستانیں بھی گھڑی گئی ہیں جن میں سے ایک بےہودہ داستان بائبل میں بھی ہے کہ حضرت داؤد ؑ نے اپنے ایک سپہ سالار ”اور یا“ کی بیوی سے (معاذ اللہ) زنا کا ارتکاب کیا تھا۔ لیکن یہ داستان تو بیان کرنے کے بھی لائق نہیں ہے۔ ایک جلیل القدر پیغمبر کے بارے میں، جنہیں خود قرآن کریم کے بیان کے مطابق اللہ تعالیٰ کا خاص تقرب حاصل تھا ، ایسی بات یقیناً من گھڑت ہے۔ البتہ بعض مفسرین نے یہ روایت بیان کی ہے کہ اس زمانے میں کسی شخص کی بیوی سے نکاح کرنے کی خواہش ظاہر کر کے اس کے شوہر سے یہ فرمائش کرنا معیوب نہیں سمجھا جاتا تھا کہ وہ اپنی بیوی کو طلاق دیدے۔ یہ ایک عام رواج تھا جس پر کوئی برا بھی نہیں مانتا تھا۔ اور یا کی بیوی چونکہ بہت ذہین تھی، اس لیے حضرت داؤد ؑ نے اپنے معاشرے کے چلن کے مطابق اس سے یہ فرمائش کی تھی کہ وہ اسے طلاق دیدے، تاکہ وہ حضرت داؤد ؑ کے نکاح میں آسکے۔ ایسی فرمائش نہ تو گناہ تھی، کیونکہ شوہر کو حق حاصل تھا کہ وہ یہ بات مانے یا نہ مانے، اور نہ معاشرے کے رواج کے مطابق معیوب تھی، لیکن ایک جلیل القدر پیغمبر کے شایان شان نہیں تھی، اس لیے اللہ تعالیٰ نے اس لطیف پیرائے میں آپ کو تنبیہ فرمائی۔ چنانچہ آپ نے اس پر استغفار فرمایا، اور پھر نکاح کی تجویز پر عمل بھی نہیں کیا۔ یہ تشریح اگرچہ بائبل والے واقعے کی طرح لغو تو نہیں ہے، لیکن کسی مستند روایت سے ثابت بھی نہیں۔ اصل بات یہ ہے کہ لغزش جو کوئی بھی تھی، اللہ تعالیٰ نے اپنے ایک جلیل القدر پیغمبر کو اس پر نہ صرف یہ کہ معاف فرمایا، بلکہ اس پر اتنا پردہ ڈالا کہ قرآن کریم میں بھی اسے صراحت کے ساتھ بیان نہیں فرمایا، اس لیے اس بات کی چھان بین جسے اللہ تعالیٰ نے خود خفیہ رکھا ہے، نہ تو اس جلیل القدر پیغمبر کی تعظیم کے شایان شان ہے، نہ اس کی کوئی ضرورت ہے، لہذا اسے اتنا ہی مبہم رکھنا چاہیے جتنا قرآن کریم نے اسے مبہم رکھا ہے، کیونکہ جو سبق قرآن کریم دینا چاہتا ہے، وہ اس کے بغیر بھی پوری طرح حاصل ہوجاتا ہے۔","translation":"اور کیا تمہیں ان مقدمہ والوں کی خبر پہنچی ہے جب وہ دیوار پر چڑھ کر عبادت گاہ میں گھس آئے تھے ؟ (11)"}