{"tafsir":"2: جنگ بدر میں ستر آدمی گرفتار ہوئے تھے، ان کو آنحضرت ﷺ نے صحابہ کی اکثریت کے مشورے سے فدیہ لے کر چھوڑدیا تھا، ان پر سورة انفال (8۔ 22، 23) میں اللہ تعالیٰ نے ناپسندیدگی کا اظہار کرتے ہوئے فرمایا تھا کہ جب تک کافروں کی طاقت اچھی طرح کچلی نہیں جاتی، اس وقت تک قیدیوں کو فدیہ لے کر چھوڑنا صحیح فیصلہ نہیں تھا، کیونکہ ان حالات میں دشمنوں کو چھوڑنے کا نتیجہ یہ ہوتا کہ ان کی طاقت کو اور مضبوط کیا جائے، سورة انفال کی ان آیتوں سے یہ نتیجہ نکالا جاسکتا تھا کہ شاید آئندہ بھی جنگی قیدیوں کو چھوڑنا جائز نہ ہو، اس آیت نے یہ وضاحت فرمادی کہ اس وقت قیدیوں کو چھوڑ نے پر اللہ تعالیٰ نے ناراضگی کا جو اظہار فرمایا تھا وہ اس لئے کہ دشمن کی طاقت کو اچھی طرح کچلے بغیر انہیں رہا کردیا گیا، لیکن جب ان کی طاقت کچلی جاچکی ہو تو اس وقت انہیں چھوڑنے میں کوئی حرج نہیں ہے، اور مسلمان حاکم کے لئے دونوں صورتیں جائز ہیں چاہے کوئی فدیہ یعنی معاوضہ لئے بغیر احسان کے طور پر انہیں چھوڑدیا جائے یا کوئی فدیہ لے کر چھوڑا جائے، چنانچہ اس آیت کی روشنی میں اسلامی حکومت کو چارقسم کے اختیار حاصل ہیں، ایک یہ کہ قیدیوں کو بلا معاوضہ احسان کے طور پر چھوڑدے، دوسرے یہ کہ ان سے کوئی فدیہ یا معاوضہ لے کر چھوڑے جس میں جنگی قیدیوں کا تبادلہ بھی داخل ہے، تیسرے یہ کہ اگر ان کو زندہ چھوڑنے میں یہ اندیشہ ہو کہ وہ مسلمانوں کے لئے خطرہ بنیں گے تو انہیں قتل کرنے کی بھی گنجائش ہے جیسا کے سورة انفال (8۔ 22، 23) میں بیان فرمایا گیا ہے، اور چوتھے یہ کہ اگر ان میں یہ صلاحیت محسوس ہو کہ وہ زندہ رہ کر مسلمانوں کے لئے خطرہ بننے کے بجائے اچھی خدمات انجام دے سکیں گے تو انہیں غلام بناکر رکھا جائے، اور ان اسلامی احکام کے مطابق رکھا جائے جو غلاموں کے ساتھ حسن سلوک کی تاکید کرتے ہیں، اور انہیں بھائیوں کا سادرجہ دیتے ہیں، ان چار صورتوں میں سے کوئی صورت لازمی نہیں ہے، بلکہ اسلامی حکومت حالات کے مطابق کسی بھی صورت کو اختیار کرسکتی ہے، لیکن یہ اس وقت ہے جب دشمنوں سے جنگی قیدیوں کے بارے میں کوئی معاہدہ نہ ہو، اگر کوئی ایسا معاہدہ ہو تو مسلمانوں پر اس کی پابندی لازم ہے، آج کل بین الاقوامی طور پر اکثر ملکوں نے جنگی قیدیوں کے بارے میں یہ معاہدہ کیا ہوا ہے کہ وہ قیدیوں کو نہ قتل کریں گے اور نہ غلام بنائیں گے، جو ممالک اس معاہدے میں شریک ہیں اور جب تک شریک ہیں ان کے لئے اس کی پابندی شرعاً لازم ہے۔\n 3: اس کا مطلب یہ ہے کہ غیرمسلموں کو قتل کرنا یا گرفتار کرنا صرف حالت جنگ میں جائز ہے، جب حالت جنگ ختم ہوگئی ہو، اور امن کا کوئی معاہدہ ہوگیا ہو تو قتل یا گرفتار کرنا جائز نہیں ہے۔\n 4: یعنی اللہ تعالیٰ خود براہ راست ان پر کوئی عذاب نازل کرکے ان سے انتقام لے سکتا تھا، لیکن اس نے تم پر جہاد کا فریضہ اس لئے عائد فرمایا ہے کہ تمہارا امتحان مقصود ہے کہ اللہ تعالیٰ کے دین کی خاطر تم میں سے کون ثابت قدمی سے اپنی جان خطرے میں ڈالتا ہے، اور ان کافروں کا بھی امتحان مقصود ہے کہ وہ اللہ تعالیٰ کی نصرت دیکھ کر ایمان کی طرف مائل ہوتے ہیں یا نہیں۔\n 5: جو لوگ جہاد میں شہید ہوجائیں ان کے بارے میں یہ خیال ہوسکتا تھا کہ وہ فتح کی منزل تک پہنچے بغیر دنیا سے چلے گئے، اس لئے شاید ان کے اجر وثواب میں کوئی کمی ہو، آیت نے واضح فرمایا کہ انہوں نے جو قربانی دی اللہ تعالیٰ اس کو ضائع نہیں کرے گا، اور ان کو اصلی منزل یعنی جنت تک پہنچادے گا","translation":"اور جب ان لوگوں سے تمہارا مقابلہ ہو جنہوں نے کفر اختیار کر رکھا ہے، تو گردنیں مارو، یہاں تک کہ جب تم ان کی طاقت کچل چکے ہو، تو مضبوطی سے گرفتار کرلو، پھر چاہے احسان کر کے چھوڑ دو ، یا فدیہ لے کر (2) یہاں تک کہ جنگ اپنے ہتھیار پھینک کر ختم ہوجائے۔ (3) تمہیں تو یہی حکم ہے اور اگر اللہ چاہتا تو خود ان سے انتقام لے لیتا، لیکن (تمہیں یہ حکم اس لیے دیا ہے) تاکہ تمہارا ایک دوسرے کے ذریعے امتحان لے۔ (4) اور جو لوگ اللہ کے راستے میں قتل ہوئے، اللہ ان کے اعمال کو ہرگز اکارت نہیں کرے گا۔ (5)"}