{"tafsir":"31: یہ آیت کریمہ چند ایسے واقعات کے پس منظر میں نازل ہوئی جن میں حضور نبی کریم ﷺ نے اپنے بعض صحابہ کے لیے کسی خاتون سے رشتہ دیا، مگر وہ خاتون یا ان کے رشتہ دار شروع میں اس رشتے پر راضی نہیں ہوئے۔ حافظ ابن کثیر نے یہ واقعات تفصیل سے بیان کیے ہیں، اور ان سب میں مشترک بات یہ ہے کہ آنحضرت ﷺ نے جن صحابہ کے نکاح کا پیغام دیا تھا، ان میں کوئی خرابی نہیں تھی، لیکن خاتون یا ان کے گھر والوں نے صرف اپنی خاندانی یا مالی فوقیت کی وجہ سے شروع میں ان کا رشتہ قبول کرنے سے انکار کیا تھا۔ دوسری طرف حضور نبی کریم ﷺ غالباً یہ چاہتے تھے کہ لوگ صرف اپنی خاندانی یا مالی فوقیت کی وجہ سے اچھے رشتوں سے انکار کرنے کا رجحان ختم کریں۔ اگرچہ شریعت نے نکاح میں کفاءت (یعنی میاں بیوی کے ہم پلہ ہونے) کا فی الجملہ اعتبار کیا، لیکن اگر رشتے میں کوئی اور بڑی وجہ ترجیح موجود ہو تو عورت اور اس کے سرپرستوں کو صرف اس بنا پر رشتے سے انکار نہیں کردینا چاہیے کہ وہ خاندانی اعتبار سے عورت کے خاندان کا ہم پلہ نہیں ہے۔ چنانچہ اس آیت کے نازل ہونے کے بعد ان تمام واقعات میں رشتہ منظور کرلیا گیا، اور آنحضرت ﷺ کی تجویز ہی کے مطابق نکاح ہوا۔\n ان واقعات میں سب سے اہم واقعہ حضرت زید بن حارثہ ؓ کا واقعہ ہے، جس کا تعلق آنے والی آیات سے بھی ہے۔ یہ شروع میں حضرت خدیجہ ؓ کے غلام تھے، اور انہوں نے آنحضرت ﷺ کو ہبہ کردیا تھا، آپ نے انہیں آزاد کر کے اپنا منہ بولا بیٹا بنا لیا تھا۔ (جس کی تفصیل اگلی آیت کے حاشیہ میں آرہی ہے)۔ چنانچہ آپ نے اپنی پھوپی کی صاحبزادی حضرت زینب بنت جحش ؓ سے ان کے نکاح کا پیغام دیا۔ حضرت زینب اونچے خاندان کی خاتون تھیں، اور اس وقت کسی آزاد کردہ غلام سے شادی کرنا ایسی خاندانی عورت کے لیے معیوب سمجھا جاتا تھا۔ اس لیے انہوں نے شروع میں انکار کیا۔ اس پر یہ آیت نازل ہوئی، جس کے بعد انہوں نے یہ رشتہ منظور کرلیا، اور پھر حضرت زید بن حارثہ ؓ سے ان کا نکاح ہوگیا جس کا مہر خود آنحضرت ﷺ نے ادا فرمایا۔\n آیت کریمہ اگرچہ ان واقعات کے پس منظر میں نازل ہوئی ہے، لیکن اس کے الفاظ عام ہیں، اور وہ شریعت کا یہ بنیادی اصول واضح کر رہی ہے کہ اللہ اور اس کے رسول ﷺ کے حکم کے بعد کسی بھی مخلوق کو اپنی رائے چلانے کا اختیار نہیں رہتا۔","translation":"اور جب اللہ اور اس کا رسول کسی بات کا حتمی فیصلہ کردیں تو نہ کسی مومن مرد کے لیے یہ گنجائش ہے نہ کسی مومن عورت کے لیے کہ ان کو اپنے معاملے میں کوئی اختیار باقی رہے۔ (31) اور جس کسی نے اللہ اور اس کے رسول کی نافرمانی کی، وہ کھلی گمراہی میں پڑگیا۔"}