{"text":"32: اس سے مراد حضرت زید بن حارثہ ؓ ہیں۔ ان پر اللہ تعالیٰ کا احسان تو یہ تھا کہ انہیں آنحضرت ﷺ کی خدمت میں پہنچایا، اور اسلام لانے کی توفیق دی، یہاں تک کہ یہ ان چار خوش نصیب صحابہ کرام میں سے ہیں جو سب سے پہلے اسلام لائے۔ اور آنحضرت ﷺ کے ان پر احسان کی تفصیل یہ ہے کہ یہ آٹھ سال کی عمر میں اپنی والدہ کے ساتھ اپنی ننھیال میں گئے تھے، وہاں قبیلہ قین کے لوگوں نے حملہ کر کے انہیں غلام بنایا، اور عکاظ کے میلے میں لے جا کر حضرت حکیم بن حزام کے ہاتھ بیچ دیا، انہوں نے یہ غلام اپنی پھوپی حضرت خدیجۃ الکبری ؓ کو دے دیا۔ اس کے بعد جب حضرت خدیجہ ؓ سے حضور سرور عالم ﷺ کا نکاح ہوا تو حضرت خدیجہ نے انہیں آپ کی خدمت میں پیش کردیا، جبکہ ان کی عمر پندرہ سال تھی۔ کچھ عرصے کے بعد ان کے والد اور چچا کو معلوم ہوا کہ ان کا بچہ مکہ مکرمہ میں ہے تو وہ آنحضرت ﷺ کے پاس آئے، اور عرض کی کہ آپ جو معاوضہ چاہیں، ہم سے لے لیں، اور یہ بچہ ہمارے حوالے کردیں، آپ نے جواب دیا کہ اگر وہ بچہ آپ کے ساتھ جانا چاہے تو میں کسی معاوضے کے بغیر ہی اسے آپ کے حوالے کردوں گا، البتہ اگر وہ نہ جانا چاہے تو میں زبردستی اسے نہیں بھیج سکتا، وہ لوگ یہ سن کر بہت خوش ہوئے، اور حضرت زید ؓ کو بلایا گیا، اور آپ نے انہیں اختیار دیا کہ اگر وہ اپنے والد اور چچا کے ساتھ جانا چاہیں تو جاسکتے ہیں، لیکن حضرت زید نے یہ حیرت انگیز جواب دیا کہ میں حضرت محمد ﷺ کو چھوڑ کر کہیں نہیں جاسکتا۔ ان کے والد اور چچا بڑے حیران ہوئے کہ ان کا بیٹا آزادی پر غلامی کو اور اپنے باپ اور چچا پر ایک بالکل غیر شخص کو ترجیح دے رہا ہے۔ لیکن حضرت زید نے یہ حیرت انگیز جواب دیا کہ میں حضرت محمد ﷺ کو چھوڑ کر کہیں نہیں جاسکتا۔ ان کے والد اور چچا بڑے حیران ہوئے کہ ان کا بیٹا آزادی پر غلامی کو اور اپنے باپ اور چچا پر ایک بالکل غیر شخص کو ترجیح دے رہا ہے، لیکن حضرت زید ؓ نے فرمایا کہ میں نے اپنے اس آقا کا جو طرز عمل دیکھا ہے، اس کے بعد دنیا کے کسی شخص کو میں ان پر ترجیح نہیں دے سکتا۔ (واضح رہے کہ یہ واقعہ اس وقت کا ہے جب آنحضرت ﷺ کو ابھی تک نبوت عطا نہیں ہوئی تھی) اس پر ان کے والد اور چچا بھی مطمئن ہو کر چلے گئے۔ اور آنحضرت ﷺ نے حضرت زید کو فوراً آزاد کردیا، اور حرم مکہ میں جا کر قریش کے لوگوں کے سامنے اعلان فرمادیا کہ آج سے میں نے انہیں اپنا بیٹا بنا لیا ہے۔ اسی بنا پر لوگ انہیں زید بن محمد ﷺ کہا کرتے تھے۔\n 33: حضرت زینب ؓ سے حضرت زید کا نکاح ہو تو گیا تھا، لیکن حضرت زید کو یہ شکایت رہتی تھی کہ ان کی اہلیہ کے دل سے اپنی خاندانی فوقیت کا احساس مٹا نہیں، اور شاید اسی کی وجہ سے بعض اوقات وہ حضرت زید کے ساتھ تیز زبانی کا بھی مظاہرہ کرتی ہیں۔ حضرت زید کی یہ شکایت اتنی بڑھی کہ انہوں نے حضرت زینب کو طلاق دینے کے لیے آنحضرت ﷺ سے مشورہ کیا۔ آپ نے ان سے فرمایا کہ اپنی بیوی کو طلاق نہ دو۔ بلکہ اپنے پاس رکھو، اور اللہ سے ڈرو، کیونکہ اللہ تعالیٰ کو طلاق پسند نہیں ہے، اور اللہ تعالیٰ نے بیوی کے جو حقوق رکھے ہیں، انہیں ادا کرو۔\n 34: حضور نبی کریم ﷺ کو اللہ تعالیٰ نے وحی کے ذریعے حضرت زید کے مشورہ لینے سے پہلے ہی یہ بتادیا تھا کہ حضرت زید کسی وقت حضرت زینب کو طلاق دے دیں گے، اور اس کے بعد اللہ تعالیٰ کے حکم کے تحت آپ کو ان سے نکاح کرنا ہوگا، تاکہ عرب میں اپنے منہ بولے بیٹے کی بیوی سے نکاح کرنے کو جو معیوب سمجھا جاتا ہے، اس رسم کا عملی طور پر خاتمہ ہو، آنحضرت ﷺ کے لیے یہ بڑی آزمائش تھی، اول تو حضرت زید کا یہ نکاح آپ نے بڑے اصرار سے کرایا تھا، دوسرے ان کے طلاق دینے کے بعد ان سے آپ کا نکاح ہونے سے مخالفین کو باتیں بنانے کا موقع ملے گا کہ انہوں نے اپنی منہ بولی بہو سے نکاح کرلیا۔ لہذا جب حضرت زید نے آپ سے طلاق دینے کے بارے میں مشورہ کیا تو آپ نے یہ سوچا ہوگا کہ جب اللہ تعالیٰ کی طرف سے حتمی حکم آجائے گا، اس وقت تو سر تسلیم خم کرنا ہی ہوگا، لیکن جب تک حتمی حکم نہیں آتا، اس وقت تک مجھے حضرت زید کو وہی مشورہ دینا چاہیے جو میاں بیوی کے اختلاف کے موقع پر عام طور سے دیا جاتا ہے کہ طلاق سے حتی الامکان بچو، اور اللہ تعالیٰ سے ڈر کر ایک دوسرے کے حقوق ادا کرو۔ چنانچہ آپ نے یہی مشورہ دیا، اور یہ بات ظاہر نہیں فرمائی کہ اللہ تعالیٰ نے یہ فیصلہ کر رکھا ہے کہ کسی وقت حضرت زید اپنی اہلیہ کو طلاق دیں گے، اور پھر وہ آپ کے نکاح میں آئیں گی، اسی بات کو اللہ تعالیٰ نے اس آیت میں یوں بیان فرمایا ہے کہ : اور تم اپنے دل میں وہ بات چھپائے ہوئے تھے جسے اللہ کھول دینے والا تھا، صحیح روایات کی روشنی میں اس آیت کی یہی تفسیر صحیح ہے۔ بعض دشمنان اسلام نے کچھ واہی تباہی کی روایتوں کی بنا پر اس کا جو مطلب نکالا ہے، وہ سراسر غلط ہے، اور جو انتہائی کمزور روایتیں اس سلسلے میں پیش کی گئی ہیں، وہ قطعی طور پر غیر معقول اور ناقابل توجہ ہیں۔"}