{"tafsir":"10: یہاں سے جنگ احزاب کا بیان شروع ہورہا ہے۔ آیت نمبر 27 تک اس جنگ کے مختلف پہلوؤں پر تبصرہ فرمایا گیا ہے۔ اس جنگ کا واقعہ مختصراً یہ ہے کہ بنو نضیر کے یہودیوں کی سازش سے قریش کے بت پرستوں نے یہ طے کیا تھا کہ عرب کے مختلف قبائل کو جمع کر کے مدینہ منورہ پر اکٹھے حملہ کریں۔ چنانچہ قریش کے علاوہ بنو غطفان، بنو اسلم، بنو مرہ، بنو اشجع، بنو کنانہ اور بنو فزارہ نے مل کر ایک زبردست لشکر تیار کیا جس کی تعداد بارہ سے پندرہ ہزار تک بتائی جاتی ہے، اور یہ لشکر جرار مدینہ منورہ کی طرف روانہ ہوا۔ آنحضرت ﷺ کو اس کی اطلاع ہوئی تو آپ نے صحابہ کرام سے مشورہ فرمایا۔ حضرت سلمان فارسی ؓ نے مشورہ دیا کہ مدینہ منورہ کے شمال میں جہاں سے حملہ آور آنے والے ہیں، ایک گہری خندق کھود دی جائے، تاکہ وہ شہر تک نہ پہنچ سکیں۔ چنانچہ تمام صحابہ نے بڑی محنت اٹھا کر صرف چھ دن میں یہ خندق کھودی جو ساڑھے تین میل لمبی اور پانچ گز گہری تھی۔ یہ جنگ پچھلی تمام جنگوں کے مقابلے میں مسلمانوں کے لیے سب سے زیادہ سخت جنگ تھی۔ دشمن کی تعداد ان کے چار گنے سے بھی زائد تھی، اور اس پر طرہ یہ ہوا کہ بنو قریظہ کے یہودی جو مسلمانوں کی بالکل بغل میں بیٹھے تھے، ان کے بارے میں یہ اطلاع مل گئی کہ انہوں نے بھی مسلمانوں سے کیا ہوا عہد توڑ کر دشمن کی مدد کا عہد کرلیا ہے۔ سخت سردی کا موسم تھا، اتنی لمبی خندق کھودنے میں دن رات مصروفیت کی وجہ سے خوراک کا سامان کم پڑگیا تھا۔ پھر جب دشمن نے خندق کے پار پڑاؤ ڈال دیا تو دونوں طرف سے تیروں اور پتھروں کا تبادلہ تقریباً ایک مہینے جاری رہا، اور دن رات پہرہ دینے کی وجہ سے لوگ تھکن سے نڈھال تھے۔ کڑی آزمائش کا یہ زمانہ آخر کار اس طرح ختم ہوا کہ اللہ تعالیٰ نے دشمن کے لشکر پر برفانی ہوا کی ایک سخت آندھی مسلط فرما دی جس سے ان کے خیمے اکھڑ گئے، دیگیں الٹ گئیں، چولہے تباہ ہوگئے، اور سواری کے جانور بدک کر بھاگنے لگے۔ اس موقع پر انہیں محاصرہ ختم کر کے واپس جانا پڑا۔ اس آیت میں اسی آندھی کا ذکر فرمایا گیا ہے، اور اس کے ساتھ ان دیکھے لشکروں کا بھی جن سے مراد فرشتے ہیں جنہوں نے دشمن کو سراسیمہ کر کے بھاگنے پر مجبور کیا۔","translation":"اے ایمان والو ! یاد کرو اللہ نے اس وقت تم پر کیسا انعام کیا جب تم پر بہت سے لشکر چڑھ آئے تھے، پھر ہم نے ان پر ایک آندھی بھی بھیجی، اور ایسے لشکر بھی جو تمہیں نظر نہیں آتے تھے۔ (10) اور تم جو کچھ کر رہے تھے اللہ اس کو دیکھ رہا تھا۔"}