{"text":"1: یہاں دو باتیں سمجھنے کی ضرورت ہے، ایک یہ کہ اللہ تعالیٰ کو اپنی کسی بات کا یقین دلانے کے لئے قسم کھانے کی ضرورت نہیں ہے، وہ اس بات سے بےنیاز ہے کہ اپنی کسی بات پر قسم کھائے، البتہ قرآن کریم میں بہت سے مقامات پر اللہ تعالیٰ کی طرف سے جو قسمیں کھائی گئی ہیں وہ کلام میں فصاحت و بلاغت کا زور پیدا کرنے کے لئے آئی ہیں، اور بسا اوقات ان میں یہ پہلو مد نظر ہے کہ جس چیز کی قسم کھائی جارہی ہے اگر اس پر غور کیا جائے تو وہ اس بات کی دلیل اور گواہ ہوتی ہے جو قسم کے بعد مذکور ہے، چنانچہ یہاں قسم کے بعد جو بات بیان فرمائی گئی ہے وہ یہ ہے کہ قیامت ضرور آئے گی اور جزاء وسزا کا فیصلہ ضرور ہوگا۔ اور قسم ان ہواؤں کی کھائی گئی ہے جو گرد اڑاتی ہیں، اور بادلوں کا بوجھ اٹھا کر انہیں ایک جگہ سے دوسری جگہ لے جاتی ہیں، اور جب وہ برستے ہیں تو ان کا پانی مردہ زمین میں رزق کا سامان پیدا کر کے انہیں مخلوقات میں تقسیم کرتا ہے، اور ان مخلوقات کے لیے نئی زندگی کا باعث بنتا ہے۔ ان کی قسم کھا کر اس طرف توجہ دلائی گئی ہے کہ جو اللہ تعالیٰ ان ہواؤں اور ان کے نتیجے میں برسنے والے پانی کو نئی زندگی کا ذریعہ بناتا ہے، وہ یقیناً اس بات پر قادر ہے کہ مردہ انسانوں کو دوسری زندگی عطا فرما دے۔\n یہ تشریح اس بات پر مبنی ہے کہ جن چار چیزوں کی یہاں قسم کھائی گئی ہے، ان سب سے مراد ہوائیں ہیں، اور ان کی چار مختلف صفات ذکر فرمائی گئی ہیں۔ ان آیتوں کی ایک اور تفسیر یہ منقول ہے کہ پہلی صفت یعنی گرد اڑانا تو ہواؤں سے متعلق ہے، اور دوسری صفت سے مراد خود بادل ہیں جو پانی کا بوجھ اٹھاتے ہیں، اور تیسری صفت سے مراد کشتیاں ہیں جو پانی میں رواں دواں رہتی ہیں، اور چوتھی صفت سے مراد فرشتے ہیں جو مخلوقات میں رزق وغیرہ تقسیم کرنے کا انتظام کرتے ہیں۔ یہ تفسیر ایک روایت میں خود حضور سرور دو عالم ﷺ سے منقول ہے، لیکن اس روایت کے بارے میں علامہ ہیثمی ؒ نے یہ فرمایا ہے کہ یہ ایک ضعیف راوی ابوبکر ابن ابی سبرہ سے مروی ہے جو متروک ہے۔ (مجمع الزوائد ج : 7 ص 244، 245 کتاب التفسیر حدیث نمبر 11365) تاہم چونکہ اس تفسیر کو آنحضرت ﷺ سے ایک نسبت ہے، اس لیے بہت سے مفسرین نے اسی کو اختیار کیا ہے، اور ہم نے جو ترجمہ کیا ہے، اگر اس میں سے قوسین والے الفاظ کو نظر انداز کردیا جائے تو اس ترجمے میں اس تفسیر کی بھی گنجائش ہے۔ اس تفسیر کے مطابق ان قسموں سے آخرت کا تعلق بظاہر یہ ہے کہ اللہ تعالیٰ نے انسانوں کی ضروریات پوری کرنے کے یہ انتظامات بےمقصد نہیں فرمائے۔ اس سارے نظام کا یہ مقصد ہے کہ اللہ تعالیٰ کی ان نعمتوں کو جو لوگ ٹھیک ٹھیک استعمال کریں، انہیں ان کی نیکی کا انعام دیا جائے، اور جو لوگ غلط استعمال کریں، انہیں سزا دی جائے، لہذا کائنات کی یہ ساری چیزیں اس بات کا تقاضا کرتی ہیں کہ کوئی ایسا دن آئے جس میں انعام اور سزا کا یہ فیصلہ ہو۔"}