{"tafsir":"15: یہاں آقا سے مراد اللہ تعالیٰ بھی ہوسکتے ہیں، اور وہ عزیز مصر بھی ہوسکتا ہے جس نے انہیں اپنے گھر میں عزت سے رکھا ہوا تھا۔ اور مطلب یہ ہوگا کہ تم میرے آقا کی بیوی ہو، اور میں تمہاری بات مان کر اس کے ساتھ خیانت کیسے کرسکتا ہوں۔\n 16: اس آیت کی تفسیر دو طریقے سے ممکن ہے ایک یہ کہ اگر حضرت یوسف ؑ اپنے رب کی طرف سے ایک دلیل نہ دیکھ لیتے تو ان کے دل میں بھی اس عورت کی طرف جھکاؤ پیدا ہوجاتا لیکن چونکہ اللہ تعالیٰ کی طرف سے انہیں ایک دلیل نظر آگئی جس کی تفصیل آگے آرہی ہے۔ اس لیے ان کے دل میں اس عورت کے بارے میں کوئی برا خیال تک نہیں آیا۔ اور دوسرا مطلب یہ بھی ہوسکتا ہے کہ شروع میں ان کے دل میں بھی تھوڑا سا میلا پیدا ہوا تھا جو ایک بشری تقاضا ہے۔ مگر بقول حکیم الامت حضرت مولانا اشرف علی تھانوی ؒ اس کی بہترین مثال ایسی ہے جیسے پیاس کی حالت میں روزہ دار کو ٹھنڈا پانی دیکھ کر طبعی طور پر اس کی طرف میلان پیدا ہوتا ہے۔ لیکن روزہ توڑنے کا بالکل ارادہ نہیں ہوتا۔ اسی طرح غیر اختیار طور پر حضرت یوسف ؑ کے دل میں بھی میلان پیدا ہوا اور اگر وہ اپنے رب کی دلیل نہ دیکھ لیتے تو یہ میلان آگے بھی بڑھ سکتا تھا لیکن اپنے رب کی دلیل دیکھنے کے بعد وہ غیر اختیار جھکاؤ سے آگے نہیں بڑھا۔ زیادہ تر مفسرین نے اس دوسری تفسیر کو اس لیے اختیار کیا ہے کہ اول تو یہ عربی زبان کے قواعد کے لحاظ سے زیادہ بہتر ہے دوسرے اس سے حضرت یوسف ؑ کے مقام بلند کا مزید اندازہ ہوتا ہے اگر ان کے دل میں یہ غیر اختیارای خیال بھی پیدا نہ ہوتا تو گناہ سے بچنا اتنا مشکل نہیں تھا۔ لیکن اس جھکاؤ کے باوجود اپنے آپ کو بچانا زبردست اولوالعزمی کے بغیر ممکن نہیں ہے۔ اور قرآن و حدیث سے معلوم ہوتا ہے کہ دل کے تقاضے کے باوجود اللہ تعالیٰ کے خوف سے اپنے آپ پر قابو رکھنا اور گناہ سے بچنا بڑے اجر وثواب کا کام ہے۔\n اب یہ سوال رہ جاتا ہے کہ وہ دلیل کیا تھی جسے اللہ تعالیٰ نے اپنے رب کی دلیل سے تعبیر فرمایا ہے۔ اس سوال کا واضح اور بےغبار جواب یہ ہے کہ اس سے مراد اس عمل کے گناہ ہونے کی دلیل ہے جس کی طرف انہوں نے دھیان رکھا اور گناہ سے محفوظ رہے۔ بعض روایات میں اس کی یہ تفسیر بھی آئی ہے کہ اس وقت ان کو اپنے والد ماجد حضرت یعقوب ؑ کی صورت دکھا دی گئی تھی۔ واللہ سبحانہ اعلم","translation":"اس عورت نے تو واضح طور پر یوسف (کے ساتھ برائی) کا ارادہ کرلیا تھا، اور یوسف کے دل میں بھی اس عورت کا خیال آچلا تھا، اگر وہ اپنے رب کی دلیل کو نہ دیکھ لیتے، (16) ہم نے ایسا اس لیے کیا تاکہ ان سے برائی اور بےحیائی کا رخ پھیر دیں۔ بیشک وہ ہمارے منتخب بندوں میں سے تھے۔"}