{"text":"35: بعض مفسرین کا خیال ہے کہ یہ فرعون کے لشکر کا چھوڑا ہوا مال غنیمت تھا، اس دور میں مال غنیمت کو استعمال کرنا جائز نہیں تھا۔ اس کے بجائے اسے ایک میدان میں رکھ دیا جاتا تھا، اور آسمان سے ایک آگ آکر اسے جلا دیتی تھی، شاید ان زیورات کو پھینکنے کا یہی مقصد ہو کہ آسمانی آگ انہیں آ کر جلا دے۔ اس کے برخلاف عام طور پر تفسیروں میں یہ روایت مذکور ہے کہ بنی اسرائیل جب مصر سے نکلے تھے تو نکلنے سے پہلے انہوں نے فرعون کی قوم کے لوگوں سے بہت سے زیورات عید کے موقع پر پہننے کے لیے مستعار لیے تھے وہ سارے زیورات مصر سے نکلتے ہوئے ان کے ساتھ تھے۔ چونکہ یہ زیورات دوسروں کی امانت تھی۔ اس لیے بنی اسرائیل کے لیے جائز نہیں تھا کہ وہ انہیں مالکوں کی اجازت کے بغیر استعمال کریں۔ دوسری طرف انہیں واپس کرنے کا بھی کوئی راستہ نہیں تھا اس لیے حضرت ہارون ؑ نے ان سے کہا کہ یہ زیورات یہیں پھینک دو ، اور ان کے ساتھ وہی معاملہ کرو، جو دشمن سے حاصل کیے ہوئے مال غنیمت کے ساتھ کیا جاتا ہے۔ لیکن ان میں سے کوئی روایت بہت مستند نہیں ہے۔ اور احتمال یہ بھی ہے کہ سامری نے اپنا شعبدہ دکھانے کے لیے لوگوں سے کہا ہو کہ تم اپنے زیور نیچے پھینکو، میں تمہیں ایک تماشا دکھاتا ہوں۔ یہاں یہ بات بھی قابل غور ہے کہ عام لوگوں نے جو زیورات پھینکے، اس کا ذکر کرتے ہوئے اللہ تعالیٰ نے ”قذف“ کا لفظ استعمال فرمایا ہے، اور سامری نے جو کچھ پھینکا، اس کے لیے دوسرا لفظ ”القاء“ استعمال فرمایا ہے۔ اس میں یہ بھی امکان ہے کہ یہ صرف اسلوب کی تبدیلی ہو، اور یہ بھی ممکن ہے کہ سامری کے پھینکنے سے مراد اس کی شعبدہ بازی کی کاریگری ہو، کیونکہ القاء کا لفظ جادوگروں کے کرتب کے لیے بھی استعمال ہوتا ہے۔\n 36: جب سارے لوگوں نے اپنے زیورات پھینک دئیے تو سامری بھی کوئی چیز مٹھی میں دبا کر لایا، اور حضرت ہارون ؑ سے کہا کہ کیا میں بھی پھینک دوں ؟ حضرت ہارون ؑ نے سمجھا کہ وہ بھی کوئی زیور ہوگا، اس لیے فرمایا کہ ڈال دو۔ اس پر سامری نے کہا کہ آپ میرے لیے دعا فرمائیں کہ جب میں ڈالوں تو جو کچھ میں چاہتا ہوں، وہ پورا ہوجائے۔ حضرت ہارون ؑ کو اس کی منافقت معلوم نہیں تھی، اس لیے دعا فرما دی۔ حقیقت میں وہ مٹھی میں زیور کے بجائے مٹی لے کر آیا تھا۔ اور اس نے وہ مٹی ان زیورات پر ڈال کر انہیں پگھلایا۔ اور ان سے ایک بچھڑے کی سی مورت بنا لی جس میں سے آواز نکلتی تھی۔"}