{"tafsir":"8: یہ آیت اوپر کی آیات سے کم از کم ایک سال بعد نازل ہوئی، اور اس کے ذریعے تہجد کے حکم میں آسانی پیدا فرمائی گئی۔ جیسا کہ اوپر ذکر ہوا، شروع میں ایک تہائی رات کی مقدار تہجد پڑھنا ضروری تھا، لیکن چونکہ گھڑیوں وغیرہ کا رواج نہیں تھا، اس لیے آنحضرت ﷺ اور صحابہ کرام احتیاط کے پیش نظر تہائی رات سے کافی زیادہ مقدار تہجد پڑھنے میں گذارتے تھے، کبھی آدھی رات، کبھی دو تہائی کے قریب قریب۔\n 9: مطلب یہ ہے کہ دن اور رات کی ٹھیک ٹھیک مقدار چونکہ اللہ تعالیٰ ہی مقرر فرماتا ہے، اس لیے اسے معلوم ہے کہ تم لوگوں کے لیے تہائی رات کا حساب رکھنا بھی مشکل ہے، اور اس عمل کو نبھانا بھی، اس لیے اب جبکہ ایک مدت تک تم نے یہ مشقت اٹھالی ہے، اور اس کے ذریعے تمہارے اندر جو صفات پیدا کرنی مقصود تھیں، وہ بڑی حد تک حاصل ہوگئی ہیں، اس لیے اب اللہ تعالیٰ نے تہجد کی فرضیت کو ختم فرما دیا ہے۔\n 10: اس سے مراد تہجد کی نماز میں قرآن کریم پڑھنا ہے، اور مطلب یہ ہے کہ اب نہ تو تہجد کی نماز فرض ہے، اور نہ اس کی کوئی خاص مقدار مقرر ہے۔ اب بھی وہ مستحب ضرور ہے لیکن جتنا آسانی سے پڑھ سکو، پڑھ سکتے ہو۔ واضح رہے کہ اگرچہ تہجد کا افضل طریقہ یہ ہے کہ انسان رات کو سونے کے بعد آخر رات میں بیدار ہو کر تہجد پڑھے، لیکن اگر کوئی ایسا نہ کرسکے تو عشاء کے بعد کسی بھی وقت صلاۃ اللیل کی نیت سے نماز پڑھ لینے سے بھی اس نماز کی فضیلت حاصل ہوسکتی ہے۔\n 11: یعنی تجارت یا روزگار حاصل کرنے کے لیے سفر کر رہے ہوں گے۔ مطلب یہ ہے کہ اللہ تعالیٰ کو معلوم ہے کہ آئندہ تمہیں بہت سے ایسے حالات سے سابقہ پڑے گا جن میں رات کے وقت اتنی لمبی نماز کا نبھانا مشکل ہوجائے گا، اس لیے اب وہ فرض نہیں رہی۔\n 12: اس سے مراد پانچ وقت کی فرض نمازیں ہیں۔\n 13: اس سے مراد صدقہ دینا اور دوسرے نیک کاموں میں کرچ کرنا ہے۔ اسے مجازی طور پر قرض اس لیے فرمایا گیا ہے کہ اللہ تعالیٰ نے آخرت میں اس کے اجر وثواب کا وعدہ فرمایا ہے اور ”اچھا والا قرض“ کا مطلب یہ ہے کہ اس میں نیت صرف اللہ تعالیٰ کی خوشنودی حاصل کرنا ہو، دکھاوا وغیرہ مقصود نہ ہو۔","translation":"(اے پیغمبر) تمہارا پروردگار جانتا ہے کہ تم دو تہائی رات کے قریب، اور کبھی آدھی رات اور کبھی ایک تہائی رات (تہجد کی نماز کے لیے) کھڑے ہوتے ہو، اور تمہارے ساتھیوں میں سے بھی ایک جماعت (ایسا ہی کرتی ہے) (8) اور رات اور دن کی ٹھیک ٹھیک مقدار اللہ ہی مقرر فرماتا ہے۔ اسے معلوم ہے کہ تم اس کا ٹھیک حساب رکھ سکو گے، اس لیے اس نے تم پر عنایت فرما دی ہے۔ (9) اب تم اتنا قرآن پڑھ لیا کرو جتنا آسان ہو۔ (10) اللہ کو علم ہے کہ تم میں کچھ لوگ بیمار ہوں گے، اور کچھ دوسرے ایسے ہوں گے جو اللہ کا فضل تلاش کرنے کے لیے زمین میں سفر کر رہے ہوں گے۔ (11) اور کچھ ایسے جو اللہ کے راستے میں جنگ کر رہے ہوں گے۔ لہذا تم اس (قرآن) میں سے اتنا ہی پڑھ لیا کرو جتنا آسان ہو۔ اور نماز قائم کرو، (12) اور زکوٰۃ ادا کرو، اور اللہ کو قرض دو ، اچھا والا قرض ! (13) اور تم اپنے آپ کے لیے جو بھلائی بھی آگے بھیجو گے، اسے اللہ کے پاس جاکر اس طرح پاؤ گے کہ وہ کہیں بہتر حالت میں اور بڑے زبردست ثواب کی شکل میں موجود ہے۔ اور اللہ سے مغفرت مانگتے رہو۔ یقین رکھو کہ اللہ بہت بخشنے والا، بہت مہربان ہے۔"}